{
    "directories_to_ims": [
        "auto-evaluation",
        "devoirs",
        "webcontent",
        "videos",
        "media"
    ],
    "lom_metadata": {
        "language": " fr",
        "title": "     Représentation numérique de l'information : les documents",
        "category":"Divers"
    },
    "sections": [
        {
            "subsections": [
                {
                    "source_file": "webcontent/0_0_cours_webcontent.html",
                    "sub_src": "\n\nPourquoi représenter l'information sous format numérique ? En premier\nlieu, c'est un changement de support. Par exemple pour un roman, il\nfaut passer d'un support papier à un support numérique compréhensible\npar une machine pour qu'elle puisse le stocker et l'afficher. Il faut\ndonc représenter le roman comme une suite de 0 et de 1 et inversement\npasser de cette suite de 0 et 1 en un texte lisible.\n\n*************** Animation \nPeut être des lettres simples en suite de 0 et de 1, et des\n  compositions en mots/composition de suites de 0 et 1...  est-ce\n  qu'on fait passer l'idée de coder/décoder et sa contraction en codec\n  ?  \n*************** END\n\nIl faut aussi pouvoir échanger. Plutôt que de se prêter un roman sur\nsupport papier, c'est sa représentation numérique qui sera copiée à\ntravers le réseau. Il est donc nécessaire que l'émetteur et le\nrécepteur (en l'occurrence les logiciels utilisés par chacun d'eux)\nsoient d'accord sur la façon de représenter l'ouvrage.\n\n*************** Animation\nCe serait bien de voir différents choix possibles et un\naccord entre deux protagonistes. Donc l'idée de choix et ensuite\nd'accord entre parties.  \n*************** END\nRetrouver le titre et l'auteur du roman est une tâche qui vous semble\névidente. Elle sera rendue plus facile et sûre pour une machine si la\nreprésentation choisie contient explicitement la désignation du titre\net de l'auteur.\n\n*************** Animation\n ex d'un roman dont le titre est un nom (Harry Potter vs\n  J.K. Rolling).  \n*************** END\nDe même, considérons la classification du roman dans les catégories\npolicier, historique ou libertin.  Cette tâche est difficile pour une\nmachine sauf à spécifier dans la représentation la catégorie définie\npar un expert humain. Terminons par l'exemple d'une vidéo. En tant\nqu'humain, vous reconnaîtrez sans problème des personnages connus dans\nles images. Ici encore, c'est une tâche très difficile pour une\nmachine sans une représentation adéquate et des informations\ncomplémentaires. Par conséquent, la représentation numérique d'une\ninformation peut être enrichie pour faciliter les traitements relatifs\nà de telles tâches.\n\n*************** Animation\nIci on illustre que dans le codage on ajoute des meta-données.  \n*************** END\nLa numérisation ne se limite pas à un changement de support. En effet,\nelle permet des traitements automatiques sur des grandes quantités de\ndocuments. \n\nPar exemple comment faire en sorte que votre smartphone reconnaisse un\nmorceau de musique chantonné ? À l'aide d'un logiciel transformant\nles sons en un codage astucieux, votre voix est numérisée, puis la\nreprésentation numérique qui a été produite est envoyée à un service\npossédant un très grand nombre de morceaux de musique représentés avec\nle même codage, après comparaison le morceau le plus proche pourra\nêtre envoyé vers votre smartphone.\n\nNous allons dans ce module, présenter les bases de la représentation\nnumérique de l'information. Ce domaine est vaste. Nous avons fait le\nchoix de nous restreindre à un message principal : la représentation\nnumérique d'une information est un processus conçu par l'homme,\nreposant sur des choix conceptuels, organisationnels et scientifiques\net assurant la possibilité de traitements numériques.  Divers critères\nvont gouverner le choix d'une telle représentation :\n- la pertinence : modélise-t-elle bien l'information et permet-elle de\n  réaliser les traitements souhaités ?\n- l'économie : est-elle économe en taille pour permettre un stockage\n  et des échanges rapides ?\n- l'efficacité : les traitements envisagés pourront-ils se faire rapidement ?  \n- la sûreté ou la confidentialité : permet-elle de cacher\n  l'information ou d'en contrôler les accès ?\n\nCette liste est non exhaustive.  Les concepteurs, informaticiens en\nrelation avec des experts métier, vont effectuer les choix de\nreprésentation. C'est un processus créatif complexe car l'espace des\nsolutions possibles est immense, ce qui explique la très grande\ndiversité des représentations numériques.\n\nUn choix de représentation aura un impact important sur les\ntraitements possibles. Ces traitements sont accessibles à\ntravers des logiciels et prendre conscience des choix de\nreprésentation contribue à une compréhension plus profonde et une\nutilisation bien plus efficace et réfléchie de ces logiciels.\n\n\nNous allons considérer, dans un premier temps, la représentation\nnumérique des documents textuels. Le cours devrait vous permettre de\ntransposer les notions présentées dans d'autres domaines. En\nparticulier, à la fin du cours, les questions liées à la parole,\nl'image et la vidéo seront esquissées pour vous guider dans le monde\nnumérique multimédia.\n\n",
                    "title": "Cours",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/0_1_quizz_auto-evaluation.html",
                    "sub_src": "::Il n'existe qu'une façon de représenter numériquement une image:: \n{F# représenter une information est le résultat de nombreux choix}\n\n::Représentation des données et traitement informatique sont-ils liés ?::{T}\n\n::La représentation numérique d'un livre peut inclure des données qui ne se limitent pas au texte. Donnez quelques exemples:: {\n# Le genre, la date de création, ...\n}\n\n::Donnez quelques exemples de critères qui peuvent gouverner le choix d'une représentation numérique d'une information.::\n{\n# la concision, la pertinence (permettre des traitements voulus), l'efficacité (traitements sont réalisés rapidement, la confidentialité (l'accès aux données  peut être contrôlé),...\n} \n",
                    "title": "Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "devoirs/0_2_exercice-dapprodissement_devoirs.html",
                    "sub_src": "\n::Représenter et normaliser est une tache complexe : l'exemple de HTML.::\n[html]<p>En vous rendant sur la page wikipedia de HTML répondez aux questions suivantes </p>\n<ul>\n<li>Qui développe le format =html=</li>\n<li>Depuis quand ce travail sur ce langage HTML existe-t-il ? </li>\n<li>Quels sont les objectifs de cette numérisation ?</li>\n<li>Approximativement combien de groupes et de participants participent à l'élaboration de cette norme ? </li>\n<li>Quelle est la version la plus récente de HTML ? </li>\n</ul>\n{\n# Le W3C développe le HTML, Le travail a commencé au début des années 1990, HTML est conçu pour l'interopérabilité et donner du sens aux parties de textes ; la version  récente est HTML5.\n}\n",
                    "title": "Exercice d'approdissement",
                    "type": "devoirs"
                }
            ],
            "title": "Introduction : Représenter c'est choisir..."
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/1_0_introduction_webcontent.html",
                    "sub_src": "\nDans cette section, nous analysons ce qu'est un document textuel pour\ndéterminer les critères amenant à une bonne représentation numérique.\nLe cours sur le Web a déjà introduit un exemple de représentation\nnumérique de document dont une caractéristique essentielle est de\nreprésenter contenu et structure d'un côté dans le langage =html= et\nprésentation d'un autre côté avec une feuille de style =CSS=. Cette\nreprésentation facilite les traitements et la transmission à travers\nles réseaux et permet l'affichage sur tout type d'écran. Cette\ndistinction entre structure, contenu et présentation est plus générale\net résulte de l'analyse de ce qu'est un document textuel.\n\nL'analyse des documents textuels met en évidence *quatre vues\ncomplémentaires* : les vues séquentielle, structurée, qualifiée et de\nprésentation.\n\n",
                    "title": "Introduction",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/1_1_quizz_auto-evaluation.html",
                    "sub_src": "::Installer des logiciels:: \n[html]<p>Selon le système d'exploitation de votre ordinateur, vous utiliserez et installerez si nécessaire les logiciels suivants</p>\n<ul>\n<li>Un éditeur de textes : Nous vous recommandons :\n <ul>\n   <li>Sous linux : <code>gedit</code>  (installé par défaut) ou <code>atom</code> (https://atom.io)</li>\n   <li>Sous Windows : <code>notepad</code> (installé par défaut) ou <code>atom</code>((https://atom.io)</li>\n   <li>Sous Mac</li> : <code>yyy</code> (installé par défaut) ou  <code>atom</code>((https://atom.io)</li>\n   <li>Une solution alternative est d'utiliser l'éditeur de texte  intégré dans <code>owncloud</code>.</li>\n </ul>\n<li>Un traitement de textes. Les exemples seront donnés dans ce cours avec <code>libreoffice</code>. \n</ul>\n{}\n\n",
                    "title": "Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "webcontent/1_2_le-contenu-une-vue-sequentielle_webcontent.html",
                    "sub_src": "\n\nLe premier constat évident est qu'un document textuel est une suite de\nsymboles. C'est la *vue séquentielle* du document.  L'ordre est\nimportant et le parcours naturel est de commencer par le début, passer\nd'un symbole au symbole suivant jusqu'à la fin.\n\nGrâce à cette organisation séquentielle, il est déjà possible\nd'imaginer des traitements : rechercher, remplacer, couper, copier,\ncoller, identifier des mots et pourquoi pas en vérifier l'orthographe,\n...\n\n",
                    "title": "Le contenu, une vue séquentielle",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/1_3_quizz_auto-evaluation.html",
                    "sub_src": "::Éditeur de textes:: \n[html]<p>Lancer un éditeur de textes et en faire une capture\n  d'écran à déposer en réponse à ce quizz.</p>\n{}\n\n::Fonctionnalités d'un éditeur de textes::\n[html]<p>Parmi les  fonctionnalités suivantes, lesquelles sont possibles ?\n</p>\n{\n~%25%copier/couper/coller#tous les éditeurs le permettent\n~%25%rechercher et remplacer#très souvent disponible\n~%25%avancer de mots en mots#souvent par la conjonction CRTL-flèches\n~%25%corriger l'orthographe#certains le font\n~%-100%mettre en gras#l'éditeur ne permet pas d'enregistrer des mises en forme (il est possible toutefois d'écrire des commandes de mise en forme : un mot n'est pas en gras mais un texte dans un langage peut exprimer l'ordre de mettre en gras)\n}\n",
                    "title": "Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "webcontent/1_4_la-structure-une-vue-arborescente_webcontent.html",
                    "sub_src": "\n\nLes mots, phrases et paragraphes définissent une première\nstructuration du document. Cependant, tout document textuel contient\ndes niveaux plus abstraits de structuration : un livre contient une\npage de titre, une page de garde, une préface, des chapitres ; un\nrapport contient un titre, un résumé, une introduction, des sections\net sous-sections, des listes, etc... C'est la vue *structurée*. Elle\nest souvent hiérarchique ou arborescente car il y a des relations\nd'inclusion : un paragraphe dans une sous-section dans une section\ndans le document.\n\n*************** Animation\nillustrer hiérarchie et arbre \n*************** END\nGrâce à cette organisation structurelle, de nouveaux traitements sont\ndisponibles : extraire le résumé, numéroter les sections, construire\nune table des matières, réordonner des sections avec mise à jour de la\ntable des matières, ...\n\n",
                    "title": "La structure, une vue arborescente",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/1_5_quizz_auto-evaluation.html",
                    "sub_src": "::La structure d'un document:: \n[html]<p>Téléchargez le document suivant sur votre machine et ouvrez-le avec <code>libreoffice</code>: http://culturenumerique.univ-lille3.fr/activitesWeb/textes/representation.odt</p>\n<ul>\n<li>Ouvrez le <em>navigateur</em> (touche F5), déplier tous les niveaux de titre pour faire apparaître la structure complète des titres du document. </li>\n<li>Rendre une capture de cette fenêtre de navigateur</li>\n</ul>\n{}\n\n::La structure d'une page web::\n<ul>\n<li> à l'aide de firefox, rendez-vous sur la page http://culture-numerique.univ-lille3.fr/activitesWeb/html/.</li>\n<li>pressez les touches <code>CTRL-MAJ-C</code>. La fenêtre de l'inspecteur de code\n  <code>html</code> s'ouvre.</li>\n<li>observez la structure du document <code>html</code>. Utilisez les petites\n  flèches pour découvrir ou cacher les parties de code <code>html</code> incluses les unes dans les autres.</li>\n<li>Sur quelles petites flèches devez-vous cliquer pour arriver au texte <em>Vous pouvez changer la taille...</em>? \n<li>La liste des balises associées à chacune de ces petites flèches apparaît dans la zone située juste au dessus du code <code>html</code>. Elle représente le chemin dans l'arbre associé au document, depuis sa racine jusqu'au texte sélectionné. Reproduisez ce chemin en réponse à ce quizz.</li>\n{#html/body/section/ul/li}\n\n",
                    "title": "Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "devoirs/1_6_exercice-dapprodissement_devoirs.html",
                    "sub_src": "\n::Réorganiser la structure d'un document::\nAvec le document http://culturenumerique.univ-lille3.fr/activitesWeb/textes/representation.odt, déplacez la partie 4.2 en la plaçant juste après la partie 2.2. Pour cela, n'utilisez pas de copier coller mais uniquement les fonctionnalités offertes par l'usage du <em>navigateur</em> (touche <code>F5</code>). Rendez une capture d'écran de la structure obtenue visible dans le <em>navigateur</em>.\n{}\n",
                    "title": "Exercice d'approdissement",
                    "type": "devoirs"
                },
                {
                    "source_file": "webcontent/1_7_les-meta-donnnees-une-vue-qualifiee_webcontent.html",
                    "sub_src": "\n\nUne troisième vue découle des besoins lorsqu'on manipule des\ndocuments : un utilisateur peut souhaiter retrouver la date de\ncréation d'un document, un bibliothécaire cherche des documents par\nauteur, par titre, par mot-clef, par édition et numéro d'édition, ou\nencore par date. Ces éléments ne figurent pas nécessairement dans le\ndocument mais ils le qualifient. Ce sont des méta-informations (ou\nméta-données), c'est-à-dire des informations à propos des\ninformations. Elles forment la *vue qualifiée* du document. Très\nsouvent ces informations sont mémorisées sous la forme de propriétés\n(ou attributs) ayant une valeur.  Par exemple, la propriété /titre/ de\nce document vaut =Culture numérique=, la propriété /datecréation/ de\nce document vaut =10 septembre 2015=, etc...\n\n*************** Animation\nje verrais bien en anim des docs papier qu'on range dans une\npochette avec les meta données qu'on écrit sur la pochette.\n*************** END\nGrâce à cette vue qualifiée et ces méta-données, les traitements sur\ndes ensembles de documents sont facilités : on peut classer par\nauteur, rechercher par titre, ordonner des versions par date, ...\n\n",
                    "title": "Les méta-donnnées, une vue qualifiée",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/1_8_quizz_auto-evaluation.html",
                    "sub_src": "\n::La vue qualifiée:: \nDans le traitement de texte, regarder les propriétés du\ndocument suivant : http://culturenumerique.univ-lille3.fr/activitesWeb/textes/representation.odt\n<ul>\n  <li>Quel est le titre, le sujet, les mots clef ? Faites une capture d'écran de la fenêtre où vous avez trouvé ces meta-données.  \n  </li>\n</ul>\n{}\n",
                    "title": "Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "auto-evaluation/1_9_quizz_auto-evaluation.html",
                    "sub_src": ": plus loin\n::Uniquement des méta-données::\n[html]<p>Pour certaines applications, un  document un document \ntextuel peut se résumer uniquement à ses méta-données. C'est le cas des notices bibliographiques où la plus grande partie des fonds n'est pas numérisée et donc pour lesquelles le contenu des livres n'est pas représenté numériquement. </p>\n<p>Rendez-vous sur le site de la bibliothèque de l'université dans l'interface de recherche de livres.</p>\n<ul>\n<li>Indiquez sur quels critères vous pouvez effectuer une recherche</li>\n</ul>.  \n{}\n",
                    "title": "Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "webcontent/1_10_la-presentation-une-vue-pas-uniquement-graphique_webcontent.html",
                    "sub_src": "\n\nEnfin, les choix du dessin de chaque caractère, de leur taille, de la\ncouleur du titre, de la taille des marges, etc.  participent à *la\nprésentation ou forme* du document. Cette forme va s'appliquer au\ncontenu en s'aidant de la structure mais il est important de bien\ndistinguer la /présentation/ et le /contenu structuré/. En effet,\ncomme vous l'avez vu dans le cours sur le Web, la séparation entre\ncontenu et structure dans un fichier =html= et présentation dans une\nfeuille de style css permet d'afficher un même contenu avec\ndifférentes formes mais aussi de faciliter certains traitements.\nEnfin, soyez vigilants car les traitements de textes entretiennent la\nconfusion entre contenu, structure et forme. Or, un document mis en\nforme *n'est pas* un document structuré. Les interfaces proposées qui\nsemblent très intuitives entraînent souvent de mauvais apprentissages\net de mauvais usages.\n\nCette vue de présentation est néanmoins très importante pour des\nquestions de communication et de diffusion car il faut toujours\nadapter la forme à la fonction du document. La forme d'un document\npour impression et lecture diffère de la forme d'un document pour\naffichage sur écran. La forme peut dépendre de l'objectif de\ncommunication visé.\n\n",
                    "title": "La présentation, une vue pas uniquement graphique",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/1_11_quizz_auto-evaluation.html",
                    "sub_src": "on peut remettre une couche html et css. On peut\nmontrer des documents du Web sous différentes formes. On peut montrer\nun document Latex et faire découvrir sa structure, puis montrer le pdf\ncorrespondant. On peut ajouter twocolumn et montrer le résultat. La\nmême chose avec document OpenOffice et deux styles (cf après mais par\nexpérience ce n'est pas facile)\n\nune activité qui montre que forme n'est pas structure.\n- fournir 2 fichiers .odt identiques dans la forme, l'un mis en forme\n  avec le formatage direct (représentation séquentielle) sans aucune\n  structure ni description, l'autre à l'aide de styles (représentation\n  structurée).\n- faire chercher le nombre de mots, de car, un mot particulier,\n  rech/rempl dans les 2 docs: résultat et facilité identique\n- faire chercher, le nom de l'auteur, l'adresse de l'auteur, le titre,\n  la date de création, les mots clés, le résumé, l'un des 2 avec des\n  métadonnées renseignées l'autre pas\n- passer en mode navigation, demander de modifier la structure (par ex\n  des niveaux)\n- générer une TDM\n- changer le style de tous les parag (taille de typo par ex)\n",
                    "title": "Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "webcontent/1_12_un-point-detape_webcontent.html",
                    "sub_src": "\n\n*************** Animation\nPeut-être une anim de rappel\n1. *Le contenu brut* : la suite de caractères\n2. *La structure* : identification des paragraphes, des titres, des\n   sections, etc... et identification de l'organisation de ces\n   éléments.\n3. *La présentation* : l'apparence graphique.\n4. *Les méta-données* : informations à propos du document, non\n   nécessairement affichées ou imprimées mais utiles pour sa gestion,\n   son traitement.  \n*************** END\nChacune des vues contenu, structure, qualifiée et de présentation est\nimportante.  Elles contribuent toutes, à des degrés divers, à des\nobjectifs complémentaires : l'intelligibilité est essentiellement\nportée par le contenu et la structure ; la lisibilité est\nmajoritairement une affaire de présentation ; la capacité à être\nefficacement traité par une machine repose sur le contenu, la\nstructure et les méta-données.\n\n",
                    "title": "Un point d'étape ",
                    "type": "webcontent"
                }
            ],
            "title": "Analyse d'un document : plusieurs vues complémentaires"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/2_0_cours_webcontent.html",
                    "sub_src": "\n\nChacune des vues va contribuer à la représentation numérique d'un\ndocument textuel, mais, selon le domaine d'application, elle sera plus\nou moins importante ou nécessaire. La première question est : *que\nveut-on représenter en vue de quels usages ?* Des choix techniques\nseront associés pour répondre à la question : *comment représenter ?*\nCette distinction entre le quoi et le comment est, en informatique\ncomme dans beaucoup d'autres sciences, une approche essentielle des\nproblèmes.\n\n",
                    "title": "Cours",
                    "type": "webcontent"
                },
                {
                    "source_file": "webcontent/2_1_differents-formats-pour-differents-usages_webcontent.html",
                    "sub_src": "\n\nLes choix effectués pour répondre à la question /comment représenter\ndes documents textuels/ aboutissent à des *formats* de\nreprésentation. Vous connaissez sans doute certains de ces formats\nprécisés avec les abréviations suivantes :\n\n- le format =txt= pour les textes,\n- le format =doc= ou le format  =docx= du traitement de textes Word,\n- le format =odt= des traitements de textes LibreOffice ou OpenOffice,\n- le format =pdf= pour l'impression,\n- le format =html= pour les hypertextes.\n\nVous noterez, que pour de mêmes usages, comme la composition de\ndocuments textuels, il existe des formats différents comme =doc= et\n=odt=. Vous noterez également que les formats évoluent avec les usages\net les technologies. Par exemple =html= a été défini dans des versions\nsuccessives depuis le début des années 90 jusque =html5=, paru\nen 2014.\n\n\n",
                    "title": "Différents formats pour différents usages",
                    "type": "webcontent"
                },
                {
                    "source_file": "webcontent/2_2_formats-et-logiciels_webcontent.html",
                    "sub_src": "\n\nNous avons expliqué la relation forte entre le choix de la\nreprésentation et les traitements qui peuvent être faits sur une\ndonnée numérique. D'un point de vue très concret, cette relation se\ntraduit souvent par la liaison entre un format et une application\nspécifique d'un éditeur logiciel. Par exemple, un document textuel au\nformat =doc= est associé au logiciel Word de Microsoft. Il aura\nsouvent été créé avec ce logiciel et pourra être lu et modifié avec ce\nlogiciel.\n\nUn document dans un format pourra être stocké dans un fichier. Pour\ndes raisons historiques, le format d'un document est souvent précisé\ndans l'extension du nom de fichier constituée de trois ou quatre\nlettres après le point. On désigne même abusivement un format par\ncette extension, comme nous l'avons fait précédemment en parlant de\nformat =doc= par exemple. Cette extension peut être vue comme une\nméta-donnée qui dit : \"le document dans ce fichier respecte le format\nde représentation de documents utilisé par le logiciel =Word=\".\n\nSi nous avons un document textuel au format =odt=, il ne suffit pas de\nle renommer avec l'extension =doc= pour le rendre lisible par Word. Il\nfaut réaliser une *conversion* d'un format dans l'autre, opération qui\npeut être difficile voire impossible. Pourquoi ? Pour au moins deux\nraisons :\n\n1. Tout d'abord, les choix qui ont été opérés pour définir les formats\n   ne sont pas toujours compatibles.  On peut donc perdre des\n   informations lors de cette conversion.\n2. Ensuite, les choix ne sont pas toujours rendus publics. On ne peut donc pas écrire\n   de programme de conversion.\n\nPar ailleurs, un document textuel dans un format peut être parfois\nmanipulé avec des logiciels différents pour des besoins différents.\nPar exemple, un fichier =html= peut être ouvert par un navigateur pour\nle visualiser.  Le même fichier peut être ouvert avec un éditeur de\ntexte pour le modifier. Comme vous l'avez vu dans le cours du Web, il\nsera également manipulé par les robots des moteurs de recherche qui\ncontribuent à indexer le web.\n\n",
                    "title": "Formats et logiciels",
                    "type": "webcontent"
                },
                {
                    "source_file": "webcontent/2_3_ouvert-ou-proprietaire_webcontent.html",
                    "sub_src": "\n\nLe processus de choix de représentation et de définition d'un format\nest complexe et coûteux. Il peut être aussi stratégique d'un point de\nvue industriel ou commercial. Dès lors, les créateurs ont la\npossibilité de le rendre disponible pour tous librement ou non, de le\ncacher ou de le protéger par des brevets.\n\nOn parle de *format ouvert* si le format est diffusé publiquement. Par\nexemple, vous pouvez accéder librement sur le Web à la définition du\nformat =html5=.  De plus, aucune entrave légale n'accompagne\nl'utilisation d'un format ouvert et de ce fait, un format ouvert n'est\npas lié à un logiciel. En effet, plusieurs logiciels différents\npeuvent librement lire ou écrire les informations représentées dans ce\nformat. On facilite ainsi l'interopérabilité. Par exemple, le format\n=html= est utilisé par de nombreux logiciels et même au delà du Web.\n\nOn parle de *format fermé* ou propriétaire lorsque des restrictions\nd'accès et/ou d'utilisation s'appliquent. Être propriétaire d'un\nformat très répandu donne une puissance économique très importante\ndans notre monde numérique et une position dominante. En effet, la\nconversion étant impossible, une mise en concurrence est rendue très\nimprobable et les utilisateurs sont alors contraints d'utiliser le\nlogiciel associé. Si =html= avait été un format fermé, sans doute le\nweb serait-il très différent de celui d'aujourd'hui ou n'existerait\npeut-être même pas.\n\n\n\n",
                    "title": "Ouvert ou propriétaire",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/2_4_quizz_auto-evaluation.html",
                    "sub_src": "::Les fichiers d'extension Doc::\n[html] <p>Lisez la page Wikipedia suivante : https://fr.wikipedia.org/wiki/Doc_%28informatique%29 et répondez aux questions suivantes</p>\n<ol>\n  <li>Est-ce que les fichiers avec l'extension <code>doc</code> désignent  une chose unique ? </li>\n  <li>Est-ce que ce format est ouvert ?</li>\n  <li>Est-ce que ce format est toujours développé ?</li>\n  <li>Est-ce un format adapté à de grands documents ?</li>\n</ol>\n::Les documents au format PDF::\n[html]<p>Lisez la page Wikipedia suivante : https://fr.wikipedia.org/wiki/Portable_Document_Format et répondez aux questions suivantes</p>\n<ol>\n <li>Est-ce un format ouvert ?</li>\n <li>Peut-on lire et écrire du <code>pdf</code> avec des logiciels différents ?</li>\n <li>Que signifie portable ? </li>\n <li>Les documents dans ce format peuvent-ils toujours être reconstitués à l'identique ? Pourquoi ?</li>\n</ol>\n",
                    "title": "Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "webcontent/2_5_une-minute-citoyenne_webcontent.html",
                    "sub_src": "\n\nLe numérique est aujourd'hui un facteur de développement économique important. Ce développement repose en partie sur des infrastructures comme les réseaux, le web, étudiés dans les semestres précédents. Les organisations publiques mondiales, pour ne pas freiner ce développement ont mis en place des normes et étudient des garanties pour un accès neutre et de qualité à ces infrastructures. Les normes du W3C sont un exemple. Le débat actuel sur la neutralité du net est une autre illustration. Par le passé et encore aujourd'hui plusieurs entreprises, par des moyens techniques ou commerciaux tentent d'accaparer ce que beaucoup pensent être soit un bien public soit des données personnelles. Mais ces infrastructures ne sont pas le seul point d'accès au numérique. La question des formats de représentation des données entre évidemment dans l'éventail des possibilités de contrôler l'économie du numérique. \n\nLorsque vous enregistrez un document dans un certain format, c'est un peu comme si vous rangiez un objet dans une boite. Si le format est propriétaire et protégé, alors cela signifie que lorsque vous voulez retrouver votre objet vous devez vous adresser à un tiers qui lui seul a l'autorisation d'ouvrir la boite. La question de savoir si l'objet vous appartient toujours se pose donc, ou encore celle de la liberté d'utiliser cet objet. \n\nTransposée dans le monde numérique, cette image signifie que limiter cet accès a de nombreuses conséquences. L'interopérabilité est rendue plus difficile : un document dans un format propriétaire, ne peut être librement utilisé dans un autre logiciel. La liberté des utilisateurs est également atteinte : en échangeant avec un format propriétaire, vous forcez vos interlocuteurs à utiliser un logiciel précis. Enfin, lorsqu'il s'agit de données sensibles ou devant être archivées pour une très longue durée, l'usage de formats propriétaires repose sur des logiciels qui peuvent disparaître ou changer leur règles d'utilisation...\n\nComme pour les infrastructures, l'état et bien d'autres organisations sont conscientes de ces difficultés. Elle produisent souvent des directives, circulaires  pour inciter à utiliser des formats ouverts et libres. Mais il est bien plus difficile de convaincre les utilisateurs souvent plus enclins à continuer selon leurs habitudes, résultant souvent de nombreux efforts d'apprentissage.   \n\nDe votre côté, recevoir une formation indépendante des outils, donc plus fondamentale peut contribuer à être moins dépendant et moins servile dans ce monde numérique. Mais cela demande un effort particulier, une attente moins centrée sur l'immédiat et l'utilitaire, un peu moins personnelle car prenant conscience d'enjeux communautaires.\n  \n",
                    "title": "Une minute citoyenne",
                    "type": "webcontent"
                }
            ],
            "title": "Documents numériques - formats et normes"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/3_0_cours_webcontent.html",
                    "sub_src": "\n\nNous avons analysé ce qu'est un document textuel.  Nous avons mis en\névidence les quatre vues de contenu, de structure, de forme et\nqualifiée. Nous avons discuté des formats de document. Nous allons\nmaintenant étudier comment peuvent être saisis des documents\nnumériques textuels. Nous allons voir deux approches :\n- l'une dans laquelle on décrit les différentes vues sur le document\n  dans un texte structuré,\n- l'autre qui repose sur une approche plus orientée vers le rendu\n  souhaité.\n\nAuparavant, nous traitons la question du codage des caractères.\n\n",
                    "title": "Cours",
                    "type": "webcontent"
                },
                {
                    "source_file": "webcontent/3_1_representation-numerique-des-caracteres_webcontent.html",
                    "sub_src": "\n\nUn document textuel est construit avec des caractères et une séquence\n de caractères correspond souvent à un texte intelligible par l'homme.\n Nous présentons donc, dans un premier temps, comment sont représentés\n en machine les *caractères*.\n\nPrécisons d'abord la notion de caractère en prenant l'exemple de la\nlangue française. Les caractères sont les minuscules, les majuscules,\nles lettres accentuées, les chiffres, l'espace et les symboles de\nponctuation.  On peut aussi considérer des caractères comme le\ncaractère \"e dans l'o\" ou les symboles monétaires...\n\nMais avec l'internationalisation et la numérisation de textes anciens,\nil faut être également capable de représenter tous les caractères de\ntoutes les langues, vivantes ou mortes.\n\nCe travail d'inventaire est long et complexe. Fort heureusement, il\nexiste des groupes internationaux qui ont pour mission d'établir des\nnormes pour la représentation numérique des caractères. C'est le cas\ndu consortium international *Unicode* fondé il y a plus de 20\nans. Il définit en premier lieu le *quoi*, c'est-à-dire quels\ncaractères ou symboles faut-il coder. À l'heure actuelle, la plupart\ndes caractères et symboles de la très grande majorité des langues sont\ncodés. Mais le consortium introduit régulièrement des nouvelles\nlangues rares ou anciennes ou même des langages comme les Emoji.\n\nDans ces normes comme Unicode, ce ne sont pas les dessins qui sont\nrépertoriés mais les caractères eux-même. Cette distinction est\nparfois assez subtile : majuscules et minuscules sont des caractères\ndifférents mais un *a* minuscule en gras ou italique en écriture\nattachée ou en script est toujours le même caractère. À ces\ncaractères, s'ajoutent des caractères particuliers, dits caractères de\ncontrôle souvent invisibles. C'est par exemple, le caractère qui\nsignifie la fin d'un fichier texte. D'autres proviennent même de\nl'époque des machines à écrire comme la tabulation, le retour à la\nligne ou même le /retour chariot/ qui permettait à la tête d'écriture\nde revenir en début de ligne.\n\nLe consortium unicode définit en second lieu le *comment*. Il s'agit\nd'associer à tout caractère pris en charge par Unicode, un nom et un\nnuméro appelé /point de codage/.  Par exemple, A a pour nom \"Latin\nCapital Letter A\" et pour numéro 65, * a pour nom \"Asterisk\" et pour\nnuméro 42. Ces choix ont une histoire et ont été faits de façon\nastucieuse pour faciliter certains traitements. Par exemple, pour\npasser d'une lettre majuscule de notre alphabet à la lettre minuscule\ncorrespondante, il suffit d'ajouter 32 à son numéro. Avec Unicode,\ntout caractère a donc un numéro, il reste à préciser comment ce numéro\nest représenté comme une suite de 0 et de 1. Il existe\ndifférents codages, le plus répandu et le plus économe en place est\n=UTF-8=.\n\n*************** Animation\nbien montrer le double encodage : car vers nombre vers\nbinaire. On peut le faire avec des caractères divers français, arabe,\nchinois, et même Emoji.\n*************** END\n\n",
                    "title": "Représentation numérique des caractères",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/3_2_quizz_auto-evaluation.html",
                    "sub_src": "\n- Représenter et normaliser est une tache complexe :\n  l'exemple du codage des caractères. Le site montre bien le qui est\n  dans le consortium et que c'est une structure complexe mais organisée\n  qui gère tout cela. A des relations avec W3C et ISO.\n- Montrer la ligne avec codage des caractères dans une source\n  html. Sur le Web, 85% des docts sont en UTF-8\n- Trouver le point de codage de caractères\n  français, et de caractères de différentes langues.  \n- Les codages ont évolué au cours du temps. Une activité\n  autour de ASCII et Latin1 ?\n- Les codages sont nombreux. Vous avez déja vu des problèmes\n  d'affichage dans des mails ou des pages web, ils sont souvent dus à\n  des erreurs de codage. Montrer des exemples ?\n- Envoyer sur des documents décrivant UTF8 et UTF16 et poser\n  des questions sur ces codages. \n- *avancée* on peut faire réfléchir au\n  décodage et demander un algorithme de décodage d'un texte en UTF 16,\n  puis en UTF8\n",
                    "title": "Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "webcontent/3_3_textes-simples_webcontent.html",
                    "sub_src": "\n\nUn document textuel peut être réduit à la seule vue séquentielle,\nc'est-à-dire une simple séquence de caractères. Dans ce cas, le format\nde représentation privilégié est celui communément appelé *texte\nsimple*, dont l'extension principale est =txt= et le logiciel\nprincipal pour le manipuler est un *éditeur de textes*. Pour\nl'utilisateur, il existe cependant un niveau implicite de structure :\n- un *mot* est une suite de caractères séparés par des espaces ou des\n  caractères de ponctuation ;\n- une *phrase* est une suite de mots dont le premier commence par une\n  lettre capitale et qui se termine par un point ;\n- un *paragraphe* est une suite de mots séparés par des fins de\n  paragraphes.\n\nCe niveau de structure n'est pas explicitement représenté. Par\nexemple, il n'existe pas de codage de la notion de fin de mot. La\nnotion de mot est le résultat d'un traitement par la machine dépendant\ndes choix des concepteurs des logiciels qui peuvent reposer sur la\nlangue, de la définition des symboles de ponctuation. \n\n\n",
                    "title": "Textes \"simples\"",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/3_4_quizz_auto-evaluation.html",
                    "sub_src": "- Activité ou demo sur éditeur de textes et ses fonctionnalités\n- Méta-données sur textes simples. Notez que le compte de\n  mots est souvent différent selon le logiciel (gedit vs linux)\n- Montrer que la ligne d'affichage n'est pas un élément de\n  structure. Par contre, la ligne ou paragraphe correspondant à un appui\n  sur touche Entrée en est un.\n- Sur la notion de mot. On peut montrer que deux logiciels\n  différents vont compter les mots de façon différente. On peut envoyer\n  sur la page wikipedia mot et montrer que selon le point de vue le mot\n  peut être défini de façon différente.\n",
                    "title": "Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "webcontent/3_5_des-langages-et-des-logiciels_webcontent.html",
                    "sub_src": "\n\nAu delà de cette structure informelle ou naturelle (les mots, les\nphrases et les paragraphes), nous avons vu qu'il était important de\nstructurer un document de manière plus explicite et plus précise en\ndéclarant des parties, sections, sous-sections, listes, etc.  La\ndéfinition de cette structure est exclusivement sous la responsabilité\nhumaine. C'est le concepteur du document qui sait quelle organisation,\nquelle structure associer à son contenu.  Il existe 2 grandes méthodes\npour interagir avec la machine, soit utilisant un langage spécifique\nqui à l'aide de mots et de symboles permet de décrire la structure\ncomme avec le langage =html= dont nous avons déjà parlé, soit en\nutilisant les fonctions prédéfinies d'un traitement de texte.\nÉtudions ces deux options un peu plus en détail.\n\n# Alors comment définir cette structure de façon explicite ?\n# L'interaction, par le biais d'un langage commun entre l'homme et la\n# machine joue alors un rôle essentiel. Ce langage d'interaction peut se\n# traduire par un texte écrit et formel qui décrit un document comme par\n# exemple le =html= dont nous avons déjà parlé.  Mais, ce langage peut\n# prendre la forme d'une suite d'actions dans un logiciel de traitement\n# de textes.\n\n",
                    "title": "Des langages et des logiciels",
                    "type": "webcontent"
                },
                {
                    "source_file": "webcontent/3_6_textes-structures-pour-decrire-des-documents-textuels_webcontent.html",
                    "sub_src": "\n\nPour définir un document textuel, on peut décrire les différentes vues\nsur ce document. On parle alors de composition de document en mode\n*WYSIWYM* pour \"What You See Is What You Mean\", en français /ce que\nvous voyez est ce que vous vous représentez/. Pour cela, on va décrire\nle document par un texte dans un langage de description.  Dans ce\nlangage certains caractères ou certaines suites de caractères ont un\nsens particulier. Les éditeurs de texte servent à écrire directement\ndans le langage de description, et des logiciels spécifiques sont\nensuite utilisés pour *calculer* une vue de présentation du document à\npartir de sa description.\n\n- *Les langages Wiki* ont été utilisés principalement pour composer\n  des pages Web dans un langage simplifié. On utilise des conventions\n  comme : une ligne qui commence par * est un titre, ** pour un\n  sous-titre. Une ligne blanche sépare les paragraphes. Un programme\n  de calcul peut construire une page Web à partir d'une description\n  textuelle en langage Wiki.\n- *Le langage LateX* utilisé pour la composition de documents dans le\n  monde scientifique (articles, rapports, thèses, livres). Dans ce\n  langage, le texte structuré décrit le contenu et la structure avec,\n  par exemple, une section commence par la séquence de caractères\n  =\\section{titredesection}=. La forme est définie par les règles\n  externes de l'édition scientifique. Un programme de calcul prend en\n  entrée le document texte décrivant le document et produit en sortie\n  un document lisible et imprimable au format =pdf= respectant ces\n  règles d'édition.\n- *Le langage html* utilise des caractères particuliers comme <, > et\n  / pour définir des balises. Par exemple, les balises =<section>= et\n  =</section>= permettent de définir une section. Le corps du document\n  =html= contient le contenu et la structure. L'entête du document\n  contient des méta données comme le codage des caractères utilisé par\n  le navigateur pour un affichage correct de la page, mais aussi des\n  mots clés à destination des robots pour une bonne indexation du\n  document. Enfin, la forme est définie dans un fichier texte\n  structuré (une feuille de style) dans *le langage css*.\n\n\n",
                    "title": "Textes structurés pour décrire des documents textuels",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/3_7_quizz_auto-evaluation.html",
                    "sub_src": "- Éditeur de texte et org. Coloration syntaxique. Comprendre. Voir dans    navigateur.\n- Éditeur de texte et LateX. Coloration syntaxique. Comprendre et montrer le pdf correspondant. On peut montrer un site LateX en ligne.\n- On peut refaire html et css. Par exemple sur html montrer corps et entête. Montrer les méta-données de l'entête.\n- On doit respecter certaines règles typographiques lorsqu'on décrit un document. Cf document Marc.\n",
                    "title": "Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "webcontent/3_8_traitement-de-textes_webcontent.html",
                    "sub_src": "\n\nQuand la définition de la structure se traduit par une suite d'actions\ndans un logiciel, on parle alors de composition *WYSIWYG* pour \"What\nYou See Is What You Get\" en français /ce que vous voyez est ce que\nvous obtenez/. Dans ce mode de composition, vos actions définissant la\nstructure, le contenu ou la présentation sont immédiatement\ninterprétées par le logiciel. Vous voyez donc à l'écran une image\npresque fidèle du document imprimé final.  Les logiciels de\n*traitements de textes* comme =Word= ou =LibreOffice Writer= ou même\ncertains éditeurs de contenu Web fonctionnent selon ce principe.\n\nLe mode WYSIWYG semble très facile d'accès car vous échappez à\nl'apprentissage contraignant d'un langage de description très\nformel. Mais vous ne devez pas oublier que l'interaction avec le\nlogiciel repose toujours sur les vues structure, contenu, forme et\nméta-données lorsque vous composez un document textuel. En effet, si\nvous les respectez, vous aurez alors facilement accès aux\nfonctionnalités de haut niveau des traitements de texte : la\ngénération automatique de table des matières, de bibliographie,\nd'index ; la réorganisation des sections ; la modification de la\nprésentation dans tout votre document ; ...\n\nL'apprentissage de cette interaction est alors d'apprendre le sens de\ncertaines actions. Vous apprendrez par exemple que le rôle de la\ntouche *entrée* est d'indiquer une fin de paragraphe ; que la\ndéclaration des sections se fait en cliquant sur le texte du titre\npuis dans une liste pour sélectionner le niveau de titre etc.\n\n\n*** Comment procéder ?\n\nUne dernière caractéristique commune aux langages de description et\naux traitements de texte est qu'ils sont extensibles et permettent de\ns'adapter à des domaines spécifiques. Par exemple, la structure d'un\nmanuel scolaire peut comprendre la notion d'exercice, d'activité, de\nleçon etc. Être capable de traduire dans la composition de documents\nchacun de ces éléments structurels est une plus-value qui permet des\ntraitements adaptés, que ce soit dans la présentation ou\nl'interrogation. Donc une démarche d'analyse préalable à la création\nd'un document s'avère nécessaire.\n\nRéaliser cette analyse, c'est comprendre qu'un document a des\nobjectifs, qu'il doit parfois respecter des règles liées à ses\nobjectifs. Vous devez avoir réfléchi à ces objectifs, au contenu et à\nla structure la mieux adaptée. La démarche de composition d'un\ndocument suivra, en général, l'ordre suivant :\n\n1. Saisir le contenu textuel ou importer ce contenu textuel. Votre\n   texte doit respecter les règles de typographie de la langue du\n   document. Votre texte doit être structuré en paragraphes.\n2. Effectuer les déclarations de structure : sections et titres de\n   sections, listes, ... Ces déclarations sont faites à l'aide de\n   styles (par exemple titre de niveau 1). L'emploi du mot style est\n   regrettable car il entraîne des confusions.\n3. Effectuer les choix de présentation basés sur la structure. Par\n   exemple, vous préciserez que le style titre de niveau 1 sera\n   présenté en gras, police Times, 14 pt, avec un retrait à droite de\n   1cm et un espacement avant de 0.5cm et un espacement après de 0.2\n   cm.\n3-bis Cela revient à dire qu'il est préférable de ne *jamais* utiliser\nles boutons de mise en forme directe qui sont pourtant en bonne\nposition dans l'interface... Toute les /mises en forme/ doivent être\nassociées aux éléments de structure, et pas à des portions de texte\nque l'on aurait sélectionnées.\n\nDans la pratique, il peut être intéressant de réutiliser une mise en\nforme pour plusieurs documents. Par exemple, tous les rapports d'une\nmême entreprise respectent la même présentation. Pour cela, on utilise\nla notion de *modèle de document*.\n\nEnfin, la plupart des méta-données comme auteur, date de création,\ndate de dernière modification sont ajoutées automatiquement par\nl'outil s'il a été correctement paramétré au préalable mais vous\npouvez ajouter explicitement des méta-données.\n\n*** Erreurs communes\nLes modes WYSIWYG induisent souvent de mauvaises\npratiques. En effet, un utilisateur a souvent tendance à se laisser\nguider par le rendu sur l'écran en oubliant que \n\n- les règles typographiques utilisées par le logiciel vont venir\n  modifier ce rendu. Par exemple, c'est le logiciel qui va calculer la\n  largeur d'une espace.\n- des modifications ultérieures de contenu vont changer la mise en\n  page. Par exemple, l'ajout d'un paragraphe peut changer toute la\n  mise en page du document complet.\n\nNous vous donnons donc les conseils suivants :\n\n1. *Respecter les règles de typographie, en particulier de ponctuation*\n2. *Ne pas aligner/décaler des parties de textes avec des espaces*\n3. *Ne pas mettre en page en créant des paragraphes vides*\n4. *Ne pas utiliser les boutons de mises en forme directe*\n\n\n",
                    "title": "Traitement de textes",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/3_9_quizz_auto-evaluation.html",
                    "sub_src": "- installer grammalecte sur son LO et jouer avec, on peut\n  donner un texte avec plein d'erreurs et demander combien ont été\n  corrigées par l'outil (typo, grammaire, conjugaison, style).\n- Marc a un texte sur la typographie\n",
                    "title": "Quizz",
                    "type": "auto-evaluation"
                }
            ],
            "title": "Documents numériques textuels"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/4_0_cours_webcontent.html",
                    "sub_src": "\nÀ travers cette présentation, vous avez sans doute retenu la distinction entre les vues de contenu, structure, présentation et les méta-données qui qualifient un document numérique. Dans les autres types de données manipulées par les ordinateurs, comme les images, le son par exemple on retrouve également ces distinctions. \n\nUne autre distinction que vous pouvez également retenir c'est celle entre logiciel et donnée. Parfois très liés à cause de formats propriétaires, on en arrive de temps à autres à les confondre, mais bien-sûr la donnée doit pouvoir exister, suivre son cycle de développement et d'utilisation en dehors du logiciel qui l'a créé. \n\n\nPar les formats de données libres et ouverts ou propriétaires ou fermés, vous voyez également une illustration de la rencontre entre le numérique et le droit. Le droit ne s'applique pas qu'aux formats, mais aux également aux contenus et aux logiciels. Le domaine du droit du numérique sort du périmètre de ce cours mais vous devez toujours vous poser la question du droit dès que vous utilisez une ressource pour la publier.\n\nEnfin, sachez que l'idée de la liberté ou de l'ouverture s'applique aux contenus par le biais des licences *creative commons* et aux logiciels par le biais des licences *GPL* et *CECILL* en précisant comment vous pouvez utiliser ces contenus et ces logiciels. La philosophie du libre dans le numérique est née dans les années 80 à propos des logiciels. Elle s'est étendue depuis et devient un mouvement qui impacte aujourd'hui toute la société numérique. \n\n",
                    "title": "Cours",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/4_1_quizz_auto-evaluation.html",
                    "sub_src": "::Le libre::\n<ul>\n<li>Les personnages: Qui est Richard Stallman ? Qui est Laurence Lessig ?</li>\n<li>Quelles sont les différentes variantes de creative commons?</li>\n<li>Quels sont les 4 principes du logiciel libre (voir le site de l'april : http://www.april.org) ? </li>\n</ul>\n",
                    "title": "Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "webcontent/4_2_cours_webcontent.html",
                    "sub_src": "\n\n\n*************** À discuter\n- Faire réfléchir sur les évolutions récentes de html ? Web\n  des données, knowledge graph, réseaux sociaux ?  \n- éditeur de texte: la notion de paragraphe définie par la fin de\n  ligne 8-). Montrer que la ligne (vue à l'écran) n'est pas un élément\n  de structure en faisant varier la taille de la fenêtre éditeur. Le\n  mot et les ponctuations ? \n- Montrer que une organisation hiérarchique se retrouve souvent. Montrer la structure d'un livre avec un docbook simplifié. Montrer la structure d'une BD xml de gestion d'une\nbibliothèque.  \n\n*************** END\n\n",
                    "title": "Cours",
                    "type": "webcontent"
                }
            ],
            "title": "Ouverture, interopérabilité, licences, ... et liberté"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/5_0_cours_webcontent.html",
                    "sub_src": "\n\n\n[fn:9] Pas trop convaincu par la BU...\n",
                    "title": "Cours",
                    "type": "webcontent"
                }
            ],
            "title": "Footnotes"
        }
    ]
}
