<body>
    <p dir="ltr"><span>Le web, c'est sans doute l'application informatique qui a rencontr&#233; le plus grand succ&#232;s. </span></p>
<p><b id="docs-internal-guid-884e2f5f-b146-510f-83c1-a44638de532c"><span>C'est une utilisation particuli&#232;re &#160;d'internet. Il a &#233;t&#233; invent&#233; par Tim Berners Lee au d&#233;but des ann&#233;es 90. C'est d'abord un moyen de communication entre personnes qui permet de </span><span>s'&#233;changer</span><span> des </span><span>informations d&#233;crites dans des documents</span><span>. Il est fr&#233;quent de constater une </span><span>confusion</span><span> entre Internet et le Web. Or, si le </span><span>web utilise Internet</span><span>, il n'est pas la seule application &#224; le faire, le mail par exemple est un autre service qui utilise Internet. Socialement, le web a pris une place consid&#233;rable dans nos vies. Sur cette application au d&#233;part tr&#232;s simple se sont b&#226;ties d'autres applications dans tous les domaines d'activit&#233;s : pour le commerce, le marketing, la recherche d'emploi, le travail &#224; distance et la collaboration... C'est un vecteur important de d&#233;veloppement &#233;conomique aujourd'hui. C'est aussi par des applications web que l'&#233;tat et les administrations offrent leurs services aux citoyens. C'est encore par les applications sociales du web que nous communiquons dans notre vie priv&#233;e. Ma&#238;triser les technologies du web est important pour comprendre les enjeux, saisir des opportunit&#233;s, &#233;viter des pi&#232;ges... Naviguer sur le web fait aujourd'hui partie du quotidien de chacun d'entre nous. Ce chapitre propose d'en expliquer le fonctionnement pour nous permettre d'avoir des </span><span>comportements responsables</span><span> et de </span><span>garder la ma&#238;trise</span><span> de ce que nous faisons.</span></b><span><br><br></span></p>
<div><a href="%24@COURSEVIEWBYID*4796@%24#section-2"><b><span>Retour</span></b></a></div>
<p><span><br></span><b id="docs-internal-guid-884e2f5f-b147-7735-66db-5144959f84dc"></b></p>
  </body>
