<body>
    <p><b id="docs-internal-guid-884e2f5f-b149-ad7a-9551-6f118e886229"><span><i><b>Client/serveur</b></i></span></b><b id="docs-internal-guid-884e2f5f-b149-ad7a-9551-6f118e886229"><span><br>Le Web, et bien d'autres applications d'internet, fonctionnent selon un mod&#232;le tr&#232;s simple : le </span><span>mod&#232;le client/serveur</span><span>.</span></b></p><p><span>Celui-ci peut s'illustrer par un petit exemple du quotidien.</span><b id="docs-internal-guid-8177bca4-b149-e196-84aa-a291d4a4cdac"><span><br>Dans la vie de tous les jours, si je me prom&#232;ne en ville et que j'ai envie d'un caf&#233; ou d'une boisson rafra&#238;chissante, j'entre dans une brasserie et j'interpelle un serveur.</span><span><br class="kix-line-break"></span><span>S'engagent alors des &#233;changes, qui suivent un protocole assez convenu dans une langue commune.</span><span><br class="kix-line-break"></span><span>D&#232;s que je lui ai pass&#233; ma commande, il s'empresse de me faire savoir qu'il a compris et vient me servir &#224; condition &#233;videmment qu'il ait &#224; sa disposition ce que je lui ai demand&#233;. </span><span><br class="kix-line-break"></span><span>Si je demande un pneu de v&#233;lo ou les </span></b><span><span>&#339;uvres </span></span><b id="docs-internal-guid-8177bca4-b149-e196-84aa-a291d4a4cdac"><span>compl&#232;tes de Karl Marx, ou simplement une marque de bi&#232;re qu'il ne poss&#232;de pas, il me r&#233;pondra gentiment qu'il ne peut pas r&#233;pondre &#224; ma demande.</span><span><br class="kix-line-break"></span><span>Dans tous les autres cas, il va s'empresser de me servir et d&#232;s qu'il aura fini, il sera &#224; nouveau disponible pour d'autres clients ou une nouvelle demande de ma part. </span><span><br class="kix-line-break"></span><span>En l'absence de clients, le serveur attend patiemment que quelqu'un l'interpelle.</span></b></p><p><b id="docs-internal-guid-8177bca4-b14f-8367-0ad0-6c49688057fe"><span>Sur Internet, les clients et les serveurs sont toujours des </span><span>programmes</span><span> qui s'ex&#233;cutent sur des </span><span>ordinateurs</span><span>. </span><span><br class="kix-line-break"></span><span>Nous avons d&#233;cid&#233; de repr&#233;senter les serveurs par des tours et les clients par des ordinateurs portables afin d'&#234;tre plus clairs, mais il va de soi que n'importe quel type d'ordinateur peut potentiellement jouer le r&#244;le de client ou de serveur. <br></span></b></p><p><br></p><p dir="ltr"><b id="docs-internal-guid-8177bca4-b286-0223-0d2c-d437653d419c"><span>Dans le cadre du web, les </span><span>clients</span><span> sont les </span><span>navigateurs</span><span> qui nous permettent d'acc&#233;der &#224; des sites constitu&#233;s de </span><span>ressources</span><span> h&#233;berg&#233;es par des </span><span>serveurs</span><span>.</span></b></p><b id="docs-internal-guid-8177bca4-b286-0223-0d2c-d437653d419c"><span>Ils respectent pour leurs &#233;changes un langage et des r&#232;gles communes qu'on appelle le protocole HTTP pour hypertext</span></b><span><span> <span class="">t</span></span></span><b id="docs-internal-guid-8177bca4-b286-0223-0d2c-d437653d419c"><b><span class="">ransfert</span></b><span> protocol. </span><span><br class="kix-line-break"></span><span>Chaque ressource fait l'objet d'un &#233;change </span><span>demande &#160;/ retour</span><span> entre le client et le serveur. </span><span><br class="kix-line-break"></span><span>Certaines demandes n'aboutissent pas, quand &#160;la ressource demand&#233;e n'existe pas par exemple. Ce sont les fameuses erreurs 404.<br><br></span></b><b><i><a href="%24@COURSEVIEWBYID*4796@%24#section-3"><span><span>retour</span></span></a></i></b><b id="docs-internal-guid-8177bca4-b286-0223-0d2c-d437653d419c"><span><br></span></b><b id="docs-internal-guid-8177bca4-b28b-8dab-c9ea-bf7cc366d4ad"><span><b id="docs-internal-guid-8177bca4-b286-0223-0d2c-d437653d419c"><span><br></span></b> </span></b><p></p>
  </body>
