<body>
    <i><b>Exemple</b></i><br>
<p align="left">
<span><span><span><span>Commen&#231;ons
par un exemple tr&#232;s simple pour comprendre le m&#233;canisme de base.</span></span></span></span></p>

<p align="left">
<span><span><span><span>Si
&#224; l'aide d'un client web tel que Firefox, je saisis l'adresse&#160;: http://culturenumerique.univ-lille3.fr/PageExemple</span></span></span></span><span><span><span></span></span></span><span><span><span><span><br>Que
se passe -t-il&#160;?</span></span></span></span><span><span><span><span><br>Mon
client interpr&#232;te ma saisie comme l'interrogation par le protocole
http du serveur situ&#233; sur la machine culturenumerique.univ-lille3.fr
pour lui demander la ressource /PageExemple</span></span></span></span></p>

<p align="left">
<span><span><span><span>Comme
nous l'avons vu pr&#233;c&#233;demment, l'adresse IP de ma machine sera
n&#233;cessaire pour communiquer avec le serveur. Mais
mon navigateur va &#233;galement r&#233;unir un certain nombre d'autres
informations disponibles sur ma machine (informations  que nous
verrons plus loin) et les joindre &#224; la requ&#234;te envoy&#233;e au serveur
qui h&#233;berge la ressource. </span></span></span></span><span><span><span><span><br>Le
serveur re&#231;oit cette requ&#234;te, la comprend car elle est formul&#233;e
selon les r&#232;gles d&#233;finies dans ce fameux protocole HTTP, </span></span></span><span><span><b>norme</b></span></span><span><span><span>
utilis&#233;e pour que les clients web et les serveurs web puissent
communiquer.</span></span></span></span></p><p align="left"><span><span><span><span><br></span></span></span></span></p><p align="left"><span><span><span><span>Une
part du succ&#232;s du web repose sur le fait que HTTP est  utilis&#233; par
TOUS les serveurs web et TOUS les clients WEB, quels qu'ils soient et
leur permet donc de dialoguer et de s&#160;'&#233;changer des
informations.</span></span></span></span></p><p align="left"><span><span><span><span>Le
serveur fait alors une copie de la ressource demand&#233;e et la renvoie
au client, celui-ci n'a plus qu'&#224; afficher le contenu de la
ressource dans la fen&#234;tre du navigateur.</span></span></span></span></p>


<p align="left">
<span><span><span><span>Notons
qu'une adresse du type&#160;:http://culturenumerique.univ-lille3.fr/PageExemple<br>s'appelle
une </span></span></span><span><span><b>URL</b></span></span><span><span><span>
pour Uniform Resource Locator, c'est-&#224;-dire en fran&#231;ais l'adresse
d'une ressource. Le
mot uniform sugg&#232;re une convention d'&#233;criture de ces adresses et
une uniformisation de l'&#233;criture de ces adresses. Il
est important de noter que cette URL contient &#224; la fois le </span></span></span><span><span><b>nom
du serveur</b></span></span><span><span><span>
(la machine culturenumerique.univ-lille3.fr dans notre exemple) qui
h&#233;berge la ressource </span></span></span><span><span><b>ET</b></span></span><span><span><span>
le </span></span></span><span><span><b>nom
de la ressource</b></span></span><span><span><span>
sur ce serveur (ici /PageExemple).</span></span></span></span></p>
<br><i><b>R&#233;capitulatif</b></i><br>
<p align="left">
<span><span><span><span>Retenons
dans un premier temps les notions suivantes&#160;:</span></span></span></span></p><ul><li><span><span><span><span>l</span></span></span></span><span><span><span><span>e
web permet &#224; des clients d'acc&#233;der &#224; des copies de ressources
h&#233;berg&#233;es sur des serveurs.</span></span></span></span></li><li>l<span><span><span><span>es
ressources sont toutes rep&#233;r&#233;es par des URLs.</span></span></span></span></li><li>
<p align="left">
	<span><span><span><span>les
	ressources de type texte sont d&#233;crites dans un langage normalis&#233;,
	le HTML qui permet de cr&#233;er des hyperliens pour faciliter notre
	navigation.</span></span></span></span></p></li><li>
<p align="left">
	<span><span><span><span>les
	programmes appel&#233;s serveurs (on ne les &#171;&#160;voit&#160;&#187; pas) et
	clients (les navigateurs) parlent tous la m&#234;me langue&#160;: le
	protocole HTTP.</span></span></span></span></p></li><li><span><span><span><span>c</span></span></span></span><span><span><span><span>omme
pour beaucoup de communications sur internet, ces &#233;changes entre
client et serveurs ne sont pas confidentiels, et le protocole ne peut
m&#234;me pas garantir que les clients et les serveurs sont bien ceux
qu'ils annoncent &#234;tre.</span></span></span></span></li></ul>Une
&#233;volution du protocole HTTP rem&#233;die &#224; ces probl&#232;mes en ajoutant
le cryptage des communications pour assurer la confidentialit&#233;, et
l'authentification des protagonistes dans ces &#233;changes.<span><span><span><span>C'est
le <b>protocole HTTPS</b>.</span></span></span></span>
<p>
</p>
<p align="left">
	<span><span><span><span>En
	conclusion, d&#232;s que vous transmettez des donn&#233;es confidentielles
	veillez bien &#224; la pr&#233;sence du petit verrou qui indique
	l'utilisation du protocole HTTPS.</span></span></span></span></p>
<br>
<p><br></p>
<br><br><br>
  </body>
