<body>
    
<p align="left">
<span><span><span><span>Allons
maintenant voir plus en d&#233;tail le fonctionnement&#160;; le langage
HTML a plusieurs caract&#233;ristiques tr&#232;s int&#233;ressantes. </span></span></span></span><br>
</p><p align="left">
<span><span><span><span>Nous
avons vu qu'il permettait d'introduire des hyperliens dans un
document, mais il poss&#232;de d'autres atouts. </span></span></span></span><br>
</p><p align="left">
<span><span><span><span>C'est
un langage de </span></span></span><span><span><b>description
de document</b></span></span><span><span><span>,
c'est &#224; dire qu'il permet d'expliquer comment le document est
construit et donc comment un logiciel comme un navigateur peut
l'afficher.</span></span></span></span></p><p align="left"><br>
</p><p align="left">
<span><span><span><span>Concr&#232;tement,
HTML permet d'ajouter au contenu texte des &#233;l&#233;ments de structure du
type&#160;:</span> <b>ce
paragraphe est un titre, celui-l&#224; est un sous-titre, cet autre est
une l&#233;gende, ce mot doit &#234;tre mis en exergue...</b></span></span></span></p>
<p align="left">
<span><span><span><span>Cette
distinction </span></span></span><span><span><b>contenu/structure</b></span></span><span><span><span>
est essentielle, elle est pr&#233;sente dans de nombreux domaines et nous
y reviendrons souvent. </span></span></span></span>
</p>
<p align="left">
<span><span><span><span>La
structure permet d'ajouter du sens aux parties de textes et &#224;
l'aide de r&#232;gles de pr&#233;sentation de rendre une page HTML
affichable sur de nombreux types d'&#233;crans. Le
navigateur </span></span></span><span><span><b>calcule</b></span></span><span><span><span>
alors la pr&#233;sentation adapt&#233;e, par exemple pour une tablette, un
smartphone ou un grand &#233;cran d'ordinateur.</span></span></span></span></p><p align="left">
<span><span><span><span>En
fran&#231;ais la traduction de HTML est : langage de balisage pour
documents hypertexte. <br></span></span></span></span><br>

</p>
<p align="left">
<span><span><span><span>Les
balises vont indiquer la </span></span></span><span><span><b>structure
du document</b></span></span><span><span><span>
en titres, paragraphes etc ainsi que des liens vers d'autres
ressources du Web. Les documents sont donc des textes
d&#233;crivant des documents hypertexte. Mais
que fait ensuite le client, le navigateur avec ce document hypertexte
qu'il vient de recevoir ? </span></span></span></span>
</p>
<p align="left">
<br>

</p>
<p align="left">
<span><span><span><span>Gr&#226;ce
&#224; la description faite du document et en fonction de ses capacit&#233;s
le navigateur va pouvoir recomposer le document et vous l'afficher. Les
pages web que votre navigateur affiche sont des textes avec le plus
souvent des images, formant un document complet.</span></span></span></span></p>
<p align="left">
<span><span><span><span>En
fait ce document est r&#233;alis&#233; par l'assemblage de nombreuses
ressources. En effet, le langage HTML permet &#233;galement de sp&#233;cifier
l'insertion d'images (ou d'autres ressources) &#224; diff&#233;rents endroits
d'un document.</span></span></span></span></p>
<p align="left">
<br>

</p>
<p align="left">
<span><span><span><span>Les
</span></span></span><span><span><b>images
ne sont pas &#224; proprement parler ins&#233;r&#233;es</b></span></span><span><span><span>
dans le document principal, mais un balisage indique qu'&#224; cet
endroit il faudra ins&#233;rer une image.</span></span></span></span></p><p align="left"><span><span><span><span><br></span></span></span></span></p>
<p align="left"></p>
  </body>
