<body>
    <p align="left">
<span><span><span><span>Rappelons
qu'une page affich&#233;e dans votre navigateur est en fait un
assemblage de nombreuses ressources. Il faut donc dans un premier
temps les rassembler.</span></span></span></span></p>
<p align="left">
<span><span><span><span>Une
image est une ressource au m&#234;me titre que les autres documents. Elle
est donc d&#233;sign&#233;e par une URL. Notez
bien que ce m&#233;canisme d'URLs permet de d&#233;signer des images dans
les pages web comme autant de ressources ind&#233;pendantes. En
cons&#233;quence, les images ne se trouvent pas forc&#233;ment sur le m&#234;me
serveur que le document principal.</span></span></span></span></p><p align="left"><span><span><span><span><br></span></span></span></span></p><p align="left"><span><span><span><span>Examinons
alors plus en d&#233;tail ce qui se passe lorsque je </span></span></span><span><span><b>clique
sur un lien</b></span></span><span><span><span>
qui pointe vers une ressource de type texte mais qui cette fois
contient des liens vers des images, ce que nous faisons tous les
jours et qui constitue l'essentiel des pages que nous consultons.</span></span></span> <span><span><span>Le
d&#233;but du processus est rigoureusement identique &#224; l'exemple
pr&#233;c&#233;dent, mais au moment du calcul du r&#233;sultat, (i.e. de
l'affichage de la page Web par le navigateur), le client rencontre
dans la description de sa page, un </span></span></span><span><span><b>lien
vers une ressource image</b></span></span><span><span><span>.
Il ne peut pas afficher cette image directement puisque </span></span></span><span><span><b>le
fichier n'est pas inclus</b></span></span><span><span><span>,
seul le </span></span></span><span><span><b>lien
vers cette ressource</b></span></span><span><span><span>
est sp&#233;cifi&#233;.</span></span></span></span></p>
<p align="left">
<span><span><span><span><br>Alors,
</span></span></span><span><span><b>sans
rien nous demander</b></span></span><span><span><span>,
il effectue une autre requ&#234;te (identique &#224; la pr&#233;c&#233;dente mais
avec l'url de l'image) pour obtenir cette ressource. La
r&#233;ponse &#224; cette requ&#234;te est une </span></span></span><span><span><b>copie
du fichier image</b></span></span><span><span><span>
indiqu&#233;. Le
client peut alors l'int&#233;grer &#224; l'affichage de la page.</span></span></span></span></p><p align="left"><span><span><span><span>Ce
processus se r&#233;p&#232;te autant de fois qu'il y a d'images dans le
document et ce, quelles que soient leurs tailles.</span></span></span></span></p><p align="left"><span><span><span><span><br></span></span></span></span></p><p align="left"><span><span><span><span>Cette remarque
prendra tout son sens lorsque nous nous int&#233;resserons aux traces que
nous laissons et &#224; la pr&#233;servation de notre vie priv&#233;e.</span></span></span></span></p>

  </body>
