<body>
    <i><b>Les cookies, une technique tr&#232;s utile...</b></i><br>Rappelons la
conclusion importante du chapitre pr&#233;c&#233;dent. <br><p align="left"><span>Une page web
telle que nous la voyons dans notre navigateur, notre client, est en
fait la composition de plusieurs ressources. <br>Chacune d'elles
fait l'objet d'une requ&#234;te de la part de notre client vers un
serveur. Plusieurs serveurs peuvent &#234;tre sollicit&#233;s pour obtenir
l'ensemble des ressources pr&#233;sentes dans une page web unique. Mais le web est finalement un peu plus que la consultation de
quelques ressources et pages web.</span></p><p align="left"><span>Aujourd'hui c'est un moyen
pour r&#233;aliser de nombreuses d&#233;marches administratives, ou pour
faire des achats, ou pour &#233;changer sur des r&#233;seaux sociaux. <br>Ce
sont des services aux usagers du web qui n&#233;cessitent pour les mettre
en place, un grand nombre d'&#233;changes de pages web, dans un ordre
bien pr&#233;cis, avec des contenus<strike> </strike>sp&#233;cifiques &#224;
chaque fois. </span></p><p align="left"><span>Prenons
l'exemple de l'inscription &#224; l'universit&#233;. Dans un sch&#233;ma tr&#232;s
simplifi&#233;, vous devez tour &#224; tour recevoir :</span>
</p><ul><li>
<span>&#233;tape 1 : la page qui permet
de lire la marche &#224; suivre</span><span><br></span></li><li><span>&#233;tape 2 : la page qui permet
d'indiquer &#224; quelle formation vous vous inscrivez</span><span><br></span></li><li><span>&#233;tape 3 : la page qui permet
de payer votre inscription</span><span><br></span></li><li><span>&#233;tape 4 : la page qui
comprend un  accus&#233; de r&#233;ception du paiement.</span></li></ul><p align="left">
<span>Ces &#233;tapes peuvent &#234;tre abandonn&#233;es, recommenc&#233;es... et le
serveur de l'universit&#233; qui prend en charge les inscriptions r&#233;pond
</span><b><span>en m&#234;me temps</span></b><span>
&#224; toutes les demandes, quelles que soient les &#233;tapes et les
&#233;tudiants. Il est donc n&#233;cessaire pour chacun des clients utilis&#233;s
par les (futurs) &#233;tudiants, de communiquer &#224; quelle &#233;tape ils sont
arriv&#233;s.</span><span><br></span></p><p align="left"><span>Les cookies
sont exactement con&#231;us pour cela. Un cookie contient une donn&#233;e qui
sera enregistr&#233;e par le client sur la machine du client &#224; la
demande du serveur. Dans notre exemple, le cookie pourrait contenir
un nombre entre 1 et 4 pour signifier la derni&#232;re &#233;tape effectu&#233;e. Le cookie sera
renvoy&#233; aux prochaines requ&#234;tes du client vers ce m&#234;me serveur. </span>
</p>
<p align="left">
<span>Une autre image est celle d'une
carte de fid&#233;lit&#233; de magasin, que nous avons dans notre poche et
que nous montrons &#224; notre commer&#231;ant lors de nos visites.</span><span><b> </b>Le cookie est la carte de fid&#233;lit&#233; et la donn&#233;e associ&#233;e
au cookie est notre num&#233;ro de client.</span></p><p align="left"><i><b>Les cookies tiers</b></i></p><p align="left">
</p><p align="left">
<span>Parfois
certains services propos&#233;s par un site sont d&#233;localis&#233;s.</span><span> C'est-&#224;-dire
qu'une partie des ressources d'une page sont en fait h&#233;berg&#233;es
sur un autre serveur, un serveur tiers.</span></p><p align="left"><span>Ce peut &#234;tre
le cas par exemple, d'un serveur qui "compte" les points
d'un joueur et se souvient entre 2 parties de son score. Ce type de
service peut &#234;tre utilis&#233; par de nombreux sites de jeux, qui
utilisent tous le m&#234;me serveur partenaire. Ce qui leur &#233;vite de
d&#233;velopper eux-m&#234;mes le service.</span> <span>Celui-ci peut
aussi utiliser des cookies.</span><span><br></span></p><p align="left"><span>Ce qui signifie qu'un serveur
tiers, qui n'est pas celui qui h&#233;berge le site principal dont
l'adresse est indiqu&#233;e dans la barre d'URL, stocke des cookies
sur notre machine. Son adresse
n'est pas visible et le d&#233;p&#244;t du cookie se fait donc &#224; l'insu de
l'utilisateur.<b> </b>Dans ce cas, on parle de <b>cookie tiers.</b></span></p>
<p align="left"><i><b><br>Utilisation des cookies</b></i></p><p align="left">
</p><p align="left"><span><b></b>On voit bien
que les techniques qui se sont d&#233;velopp&#233;es et qui continuent
d'&#233;voluer sur le Web sont puissantes et nous rendent beaucoup de
services. En revanche, leur utilisation dans certains cas peut poser
de graves questions de citoyennet&#233;. Bien souvent, la donn&#233;e
associ&#233;e au cookie est un num&#233;ro d'identification permettant au
serveur de retrouver dans ses bases des donn&#233;es propres &#224;
l'utilisateur.</span><span> Dans notre exemple de d&#233;marche
d'inscription, ce pourrait &#234;tre, l'&#233;tape &#224; laquelle il est
arriv&#233;, son nom, ses choix de formation...  </span>
<span>Il est tr&#232;s
important de comprendre qu'un tel num&#233;ro d'identification est un
moyen tr&#232;s commun utilis&#233; sur le web aussi bien que dans la vie non
num&#233;rique. </span>

</p><p align="left">
<span>C'est la technique utilis&#233;e
par la s&#233;curit&#233; sociale (avec le num&#233;ro de s&#233;curit&#233; sociale),
pour vous suivre toute notre vie dans nos d&#233;marches de couverture
sociale. </span>
</p>
<p align="left">
<span>C'est aussi ce qui se cache
derri&#232;re les cartes d'achat ou promotionnelles des magasins,
propos&#233;es avant tout pour nous suivre et assurer du marketing
direct. </span>
</p>
<p align="left">
<span>Donc<b> bien des num&#233;ros nous
identifient</b>. </span>
</p>
<p align="left">
<span>Mais d&#232;s lors que ces num&#233;ros
d'identification sont rapproch&#233;s ou unifi&#233;s, la technique devient
si puissante qu'on l'estime mena&#231;ante pour nos libert&#233;s. </span>
</p>
<p align="left">
<span>Si bien que par
exemple, le parlement a d&#251; l&#233;gif&#233;rer il y plus de 30 ans pour
emp&#234;cher ou limiter l'usage du num&#233;ro de s&#233;curit&#233; sociale dans
les autres administrations de l'&#233;tat. <b></b>Naturellement, avec l'av&#232;nement du num&#233;rique ce
rapprochement de num&#233;ros d'identification devient tr&#232;s facile
techniquement. Il convient de redoubler de vigilance...</span></p>
<p align="left"><span><br></span></p>
  </body>
