<body>
    <p>Il faut donc avoir conscience que la consultation d'une page laisse des <strong>traces</strong> sur mon disque dur et sur le r&#233;seau. <br>Toutes ces traces peuvent &#234;tre consid&#233;r&#233;es &#224; divers degr&#233;s comme des informations personnelles. </p>
<p>Celles qui r&#233;sident sur l&#8217;ordinateur que vous utilisez, qui peut appartenir &#224; votre employeur, &#224; l&#8217;universit&#233; ou &#224; un cybercaf&#233; sont techniquement lisibles par les administrateurs ou les propri&#233;taires de l&#8217;ordinateur.<br>Les traces qui sont laiss&#233;es &#224; travers les r&#233;seaux, puis sur des serveurs que vous consultez ou des serveurs tiers sont potentiellement exploitables par de nombreux acteurs.<br>Il ne s&#8217;agit pas de d&#233;noncer ces pratiques comme si elles &#233;taient des malversations.</p>
<p>La mise en cache nous permet de gagner du temps, l&#8217;historique est un outil pratique pour rechercher des informations vues r&#233;cemment, et les cookies sont indispensables au bon fonctionnement d&#8217;une tr&#232;s grande quantit&#233; de sites. <br>Par ailleurs, une bonne partie des sites que nous visitons n&#8217;existeraient plus si ils n&#8217;&#233;taient pas financ&#233;s par la publicit&#233;.<br>En revanche, il nous semble important que chacun ait <strong>conscience</strong> de ce qui se passe. <br>Aujourd&#8217;hui beaucoup croient surfer incognito d&#232;s lors qu&#8217;on ne voit pas leur &#233;cran sans penser qu&#8217;un simple clic sur le menu de l&#8217;historique peut r&#233;v&#233;ler bien des choses.<br>Une infime minorit&#233; des internautes a conscience que les pratiques de web-marketing agressives que nous venons de d&#233;crire sont abondamment utilis&#233;es.<br>Une question essentielle dont nous devons tous prendre conscience est celle de la pseudo-gratuit&#233; du web :</p>
<ul>
<li>Qui finance les services et les contenus qui sont &#224; notre disposition sur le web ?</li>
<li>La <strong>publicit&#233;</strong> est-elle le seul moyen de <strong>financement</strong> ?</li>
<li>Jusqu&#8217;o&#249; sommes-nous pr&#234;ts &#224; laisser les publicitaires nous cibler ?</li>
<li>Que consid&#233;rons-nous relever de la vie priv&#233;e et des donn&#233;es confidentielles ?</li>
<li>Les pratiques de ciblage comportemental vous paraissent-elles <strong>l&#233;gitimes</strong> d&#232;s lors que nous n&#8217;en sommes pas inform&#233;s ?</li>
</ul>
<p><br>On peut tous avoir des avis diff&#233;rents sur ces questions, et chacun devrait &#234;tre libre de surfer en connaissance de cause.<br>Aujourd&#8217;hui, pour une bonne part du web, on peut consid&#233;rer que : &#8220;<strong>SI C&#8217;EST GRATUIT, C&#8217;EST QUE LE PRODUIT C&#8217;EST VOUS</strong>&#8221;.<br>Vous avez n&#233;anmoins la possibilit&#233; de choisir les traces que vous &#234;tes pr&#234;ts &#224; laisser derri&#232;re vous. <br><br>Les activit&#233;s associ&#233;es &#224; ce module vont entre autre vous permettre de voir comment param&#233;trer votre navigateur pour <strong>faire vos propres choix</strong>.</p>
<p></p>
  </body>
