<body>
    <p><strong>Les normes et instituts de normes</strong><br>Pouvons-nous communiquer si nous ne comprenons pas la m&#234;me langue? Non, sauf bien s&#251;r si nous avons la chance d'avoir un interpr&#232;te et dans ce dernier cas la communication n'est pas aussi simple. La m&#234;me situation se retrouve dans les r&#233;seaux informatiques. <br><br>Pour faciliter les communications entre les machines, des normes ont &#233;t&#233; &#233;tablies. L'avantage de la norme si elle est bien document&#233;e, publique et libre d'acc&#232;s est que chacun, constructeur ou &#233;diteur de logiciel, peut la r&#233;aliser dans ses produits. <br><br>C'est le r&#244;le des instituts de normes, comme l'ISO qui regroupe la plupart des pays du monde, et de l'AFNOR en France, d'&#233;diter et diffuser ces normes. <br><br>De tr&#232;s nombreuses normes entrent en jeu dans le fonctionnement d'Internet et des r&#233;seaux informatiques. C'est le cas de du protocole de l&#8217;internet dans lequel on retrouve la d&#233;finition des adresses IP dont nous avons parl&#233;. C'est aussi le cas des protocoles et langages du Web dont nous parlerons bient&#244;t. L'existence de ces normes est une raison majeure du succ&#232;s plan&#233;taire du web. Sans elles, le web serait sans doute un archipel d'&#238;les isol&#233;es plut&#244;t qu'une toile.</p>
<p><strong>Pressions</strong><br>Mais imaginez maintenant un standard industriel brevet&#233; et prot&#233;g&#233; par une unique soci&#233;t&#233; &#224; la place d'une norme mondiale libre et ouverte. Cette soci&#233;t&#233; aurait un pouvoir consid&#233;rable. &#201;videmment, les enjeux &#233;conomiques du num&#233;rique &#233;tant si importants que de nombreuses tentations ont &#233;t&#233; observ&#233;es pour contourner les normes ou imposer son standard. C'est un peu le r&#244;le de chacun de veiller &#224; &#233;viter ces d&#233;rives et une &#233;ducation num&#233;rique contribue &#224; donner des armes aux citoyens pour comprendre ces enjeux et agir en cons&#233;quence.<br><strong>A voir</strong> "<em>Une contre-histoire d'internet</em>", de Sylvain Berg&#232;re. Retour sur les mouvements de d&#233;fense des libert&#233;s sur internet, apparus en r&#233;action &#224; la r&#233;gulation croissante du web : <a target="_blank" href="https://www.youtube.com/watch?v=tztUbIPb5oQ&amp;feature=youtu.be">https://www.youtube.com/watch?v=tztUbIPb5oQ&amp;feature=youtu.be</a></p>
<p><strong>Les structures politiques</strong><br>Au niveau d'internet, en plus des normes qui r&#233;gissent les moyens de communiquer les informations &#224; travers le r&#233;seau, il faut &#233;galement contr&#244;ler l'organisation du r&#233;seau. Nous pouvons illustrer cela en &#233;tudiant la structure politique mise en &#339;uvre pour attribuer les adresses IP et les noms.<br><br>Nous avons expliqu&#233; que lorsqu'une machine rejoint internet, elle rejoint d'abord un r&#233;seau local et l'autorit&#233; poss&#233;dant ce r&#233;seau local lui attribue un num&#233;ro IP. Ce num&#233;ro est choisi dans un ensemble de num&#233;ros dont un organisme de tutelle a confi&#233; la responsabilit&#233;. Cet organisme de tutelle a lui-m&#234;me un ensemble de num&#233;ros &#224; sa disposition et ainsi de suite. Au sommet de cette hi&#233;rarchie de responsabilit&#233;s, se trouve l'ICANN. <a target="_blank" href="http://upload.wikimedia.org/wikipedia/commons/9/95/Regional_Internet_Registries_world_map.svg">L&#8217;ICANN d&#233;l&#232;gue ensuite &#224; 5 structures correspondant &#224; 5 grandes r&#233;gions du monde</a>. Ceux-ci d&#233;l&#232;guent aux organisations locales dans lesquelles on retrouve en autres les soci&#233;t&#233;s qui vous louent les BOX ADSL. Il y en a plusieurs centaines en France.<br><br>Pour les noms de l'internet l'organisation politique est tr&#232;s similaire, hi&#233;rarchique &#233;galement avec au sommet encore une fois l'ICANN. On retrouve cette hi&#233;rarchie dans la fa&#231;on avec laquelle sont construit les noms. Par exemple la machine appel&#233;e www.univ-lille3.fr d&#233;signe une machine appel&#233;e www dans un domaine de nommage plus grand, univ-lille3.fr, qui comprend &#233;galement live3.univ-lille3.fr ou formations.univ-lille3.fr ... Le domaine univ-lille3.fr est lui m&#234;me dans un domaine plus grand encore le .fr. <br><br>L'universit&#233; g&#232;re les noms dans son domaine alors que l'AFNIC g&#232;re tous les noms en .fr.</p>
<p><strong>A qui appartient internet ?</strong><br>La structure politique que nous venons de d&#233;crire a son miroir technologique. En effet, l'ensemble machines qui assurent le service d'associer noms et adresses forme &#233;galement une hi&#233;rarchie. Comme nous l&#8217;avons vu dans une activit&#233; pr&#233;c&#233;dente, au sommet de cette hi&#233;rarchie se trouvent seulement 13 machines. Si elles s'arr&#234;taient, internet serait inutilisable. Des cyberattaques ont m&#234;me eu lieu plusieurs fois pour tenter de les mettre en panne... Ces 13 ordinateurs sont presque tous aux &#201;tats-Unis et appartiennent souvent &#224; des soci&#233;t&#233;s priv&#233;es. On est en droit de se demander une fois de plus &#224; qui donc appartient internet ?<br><br>L'organisation politique des noms et des IP est elle aussi souvent remise en cause car les institutions importantes comme l'ICANN sont de droit am&#233;ricain.<br>&#160;&#160; &#160;<br>La plupart des c&#226;bles qui sillonnent la plan&#232;te appartiennent &#233;galement &#224; des soci&#233;t&#233;s priv&#233;es. Aux &#201;tats-Unis, Comcast, le plus gros op&#233;rateur est en passe de racheter le second (Time Warner Cable).<br><br>Et les routeurs dont nous avons parl&#233; sont tr&#232;s souvent fabriqu&#233;s par l'entreprise Cisco, une entreprise am&#233;ricaine....<br><br>&#192; tout niveau, des situations de monopole peuvent appara&#238;tre et avec elles, le risque de perdre des libert&#233;s pour l'usager : libert&#233; de choix, libert&#233; de communiquer.</p>
<p><strong>Une soci&#233;t&#233; de surveillance g&#233;n&#233;ralis&#233;e<br></strong>Nous avons vu que les informations que nous communiquons passent par des routeurs. Ceux-ci peuvent assurer des fonctions de filtrage des contenus et de journalisation (ou m&#233;morisation de l'historique des &#233;changes). En France, les fournisseurs d'acc&#232;s &#224; internet, dont l'universit&#233;, sont tenus de pouvoir r&#233;pondre &#224; des enqu&#234;tes provenant de juges : qui a consult&#233; ce site tel jour &#224; telle heure ? Donc, &#224; l'universit&#233;, au travail ou chez vous, une m&#233;morisation est faite.<br>Toutefois m&#233;morisation ne signifie pas syst&#233;matiquement surveillance ou espionnage. La <a target="_blank" href="http://www.cnil.fr/">CNIL </a>par exemple, et bien s&#251;r la justice, doivent prot&#233;ger les citoyens contre ces abus. Mais leurs moyens ne sont pas toujours &#224; la hauteur de leurs missions... Et les affaires comme PRISM ont montr&#233; que cette question d&#233;passe largement le cadre Fran&#231;ais.</p>
<p></p>
  </body>
