{
    "directories_to_ims": [
        "auto-evaluation",
        "devoirs",
        "cours",
        "correction",
        "videos",
        "media",
        "webcontent"
    ],
    "lom_metadata": {
        "category": "Divers",
        "language": "en",
        "title": "Internet: technologies, usages, société"
    },
    "sections": [
        {
            "subsections": [
                {
                    "source_file": "webcontent/1-1-cours_webcontent.html",
                    "sub_src": "\n\n[Informatique et numérique](https://player.vimeo.com/video/122104210){: .lien_video }\n\nÀ l'origine, les ordinateurs étaient réservés aux informaticiens, ou\nplutôt comme cette discipline naissait à peine, aux mathématiciens et\nélectroniciens qui les créaient. En anglais un ordinateur se nomme\n*computer* , dont la traduction exacte est *calculateur*.\n\nFondamentalement les ordinateurs ne font que des calculs, ils ne\nsavent pas manipuler autre chose que des nombres, qui plus est des\nnombres représentés sous forme binaire c'est-à-dire avec des 0 et\ndes 1. En effet, comme toutes les machines électriques la seule\ninformation qu'ils *comprennent* est de la forme, *y'a du courant* ou\n*y'a pas de courant*.\n\nOr, aujourd'hui, nous utilisons tous des ordinateurs tous les jours,\nnon pas pour faire des calculs mais pour tout un tas d'activités\ndiverses et variées qu'elles soient professionnelles, liées à nos\nloisirs ou à notre vie quotidienne. Et pourtant, ces ordinateurs ne\nsont toujours que des machines qui font des calculs. Il a donc fallu\ntrouver des techniques pour traduire/coder le texte, le son, les\nimages avec des nombres. C'est ce qu'on appelle la numérisation. On\ndit souvent que notre monde est analogique (ou continu) et que le\nmonde des machines est numérique (ou digital). Les scanners, appareils\nphoto numériques, enregistreurs mp3 par exemple sont des dispositifs\nqui permettent de passer du monde analogique des hommes au monde\nnumérique des machines, c'est-à-dire de numériser les informations\nsous forme de nombres que les ordinateurs vont pouvoir manipuler.\n\nNous vivons dans un monde où le numérique a pris beaucoup de place :\ninternet, la radio, la télévision, la téléphonie, la photographie et\nbien d'autres choses que nous ne soupçonnons pas sont entièrement\nnumériques et donc manipulables par des ordinateurs au sens large, par\nexemple, des tablettes, des smartphones, les box adsl … en fait toutes\nles machines qui fonctionnent avec des processeurs, (nous reviendrons\nsur ce terme).\n\nCela représente des enjeux de société très importants. le numérique a\nouvert des possibilités gigantesques en terme de gain de temps, de\nfacilité de traitement, de nouvelles fonctionnalités, d'accès aux\ninformations, aux archives etc. mais en même temps de nouvelles\nquestions sont apparues : où sont stockées les données, qui y a accès,\nsont-elles en sécurité, sommes-nous dépendants de machines, de\nlogiciels, de sociétés commerciales.\n\nPour que ces questions ne restent pas dans les mains des\ninformaticiens, il est nécessaire que chacun fasse l'effort de\ncomprendre les bases, les fondements de ces technologies qui nous\nentourent. Le citoyen du XXIème siècle a besoin d'une véritable\nculture numérique qui ne se limite pas à l'utilisation de FaceBook ou\nd'un traitement de texte. C'est ce que nous allons développer dans ces\ncours...\n\n",
                    "title": "1.1 Cours",
                    "type": "webcontent",
                    "videos": [
                        {
                            "video_link": "https://player.vimeo.com/video/122104210",
                            "video_title": "Informatique et numérique"
                        }
                    ]
                },
                {
                    "source_file": "auto-evaluation/1-2-quizz_auto-evaluation.html",
                    "sub_src": "\n::Pourquoi représenter avec des nombres ?::\n[html]<p>Pourquoi faut-il représenter les textes, images, son,\netc.  par des nombres dans un ordinateur ?</p>\n{\n ~<p>C'est un choix industriel.</p>#<p>Non, les industriels n'avaient pas le choix.</p>\n~<p>Les ordinateurs ont été inventés par des\nmathématiciens.</p>#<p>Non, les mathématiciens savent manipuler\nautre-chose que des nombres, et les ordinateurs sont le fruit de\nl'interaction entre de nombreuses sciences.</p> \n=<p>Tout ordinateur\nest fondamentalement une machine qui calcule avec des\nnombres.</p>#<p>Oui, comme un ordinateur ne manipule que des nombres,\ntout doit être représenté sous forme de nombres pour qu'un ordinateur\npuisse le manipuler.</p> \n####<p>Un ordinateur ne manipule que des\nnombres, tout doit donc être représenté sous forme de nombres pour\nqu'il puisse le manipuler.</p> }\n\n::Numérisation::\n[html]<p>Que signifie \"<em>numérisation</em>\" ?</p>{\n=<p>L'opération qui consiste à représenter sous forme de nombres une\ninformation quelle qu'elle soit.</p>#<p>Oui !</p> ~<p>L'opération qui\nconsiste à citer tous les nombres (1, 2, 3, 4, ….).</p>#<p>Non, citer\ntous les nombres c'est compter...</p> ####<p>La numérisation est\nl'opération qui consiste à représenter sous forme de nombres une\ninformation, quelle qu'elle soit.</p> }\n\n::Où sont les processeurs ?::\n[html]<p>Parmi ces objets, quels sont ceux équipés de\nprocesseur(s) \\:</p>{ ~%16.66667%<p>tablettes</p>\n~%16.66667%<p>smartphones</p> ~%16.66667%<p>box ADSL</p>\n~%16.66667%<p>lecteur mp3</p> ~%16.66667%<p>ordinateur</p>\n~%16.66667%<p>calculatrice</p> ~<p>aucun</p>#<p>Tous !</p> ####<p>Tous\nces objets sont équipés de micro-processeurs !</p> }\n",
                    "title": "1.2 Quizz",
                    "type": "auto-evaluation",
                    "videos": []
                },
                {
                    "source_file": "devoirs/1-3-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Le numérique concerne tout le monde:: \nQuels étudiants sont concernés par\nle numérique ?\nLe numérique concerne évidemment les étudiants en informatique et plus\ngénéralement les étudiants des filières scientifiques.  Mais vous qui\nêtes inscrit dans une université de sciences humaines et sociales,\nêtes-vous concerné ?\nChoisissez au moins 3 des domaines suivants et faites des recherches\npour voir en quoi ils sont impactés par le numérique.\n- dans les médias, dans la santé, en histoire, en sociologie, en\n- linguistique, en art et culture, dans l’enseignement, en\n- archéologie.\nFaites une synthèse en quelques lignes de vos recherches en précisant\nles domaines auxquels vous vous êtes intéressés. Indiquez les liens\ndes sites sur lesquels vous avez trouvé ces informations.\nLa liste est non exhaustive et vous pouvez vous intéresser à d'autres\ndomaines...\n",
                    "title": "1.3 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                },
                {
                    "source_file": "correction/1-4-le-numerique-concerne-tout-le-monde-correction_correction.html",
                    "sub_src": "\n\nCes recherches ont dû vous convaincre, si c'était nécessaire, que le numérique **n’est pas réservé** aux informaticiens, il concerne tout le monde, toutes les disciplines.\nS'agissant plus particulièrement des **sciences humaines**, la prise en compte du numérique a fait évoluer les champs disciplinaires pour faire apparaître ce qu'on appelle les **humanités numériques** ( *digital humanities* en anglais). \n\nVoici quelques exemples que nous vous proposons :\n\n* Dans les **médias** : nouveau sous-métier de journalisme : les **data-journalistes**\n * [data-visualisation](http://www.lemonde.fr/data-visualisation/)\n * [journalisme de données](http://fr.wikipedia.org/wiki/Journalisme_de_données)\n* Dans la **santé** : (imagerie, dossier numérique du patient, ...)\n  * [simulation](https://interstices.info/jcms/c_21525/simulation-de-loperation-de-la-cataracte)\n* En **histoire, sociologie, linguistique** : *fouille de données*\n   * [fouille de données](http://www.youtube.com/watch?feature=player_embedded&v=tp4y-_VoXdA)\n* En **art et culture** :\n\t* [exple L3](http://)\n* Dans l’**enseignement** : (outils numérique d’accompagnement scolaire, MOOC,...)\n   * [FUN](https://www.france-universite-numerique-mooc.fr/cours/)  \n* En fouille archéologique :  une réalisation prestigieuse réalisée à Lille3 : \n * [vase qui parle](http://)\n\nN’hésitez pas à proposer d’autres exemples dans le forum de discussion.\n\n",
                    "title": "1.4 Le numérique concerne tout le monde [correction]",
                    "type": "correction",
                    "videos": []
                },
                {
                    "source_file": "devoirs/1-5-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Le numérique au quotidien::\nDu numérique partout autour de nous, tous les jours ...\nLes microprocesseurs, les ordinateurs ont envahi notre quotidien. Pour chacun des domaines suivants, cherchez des exemples où le numérique a permis des évolutions notables :\n    - Domotique\n    - Transports\n    - Vêtements\n    - Médical / paramédical\nAprès avoir effectué vos recherches, copier dans la fenêtre de rendu 1 lien pour au moins 3 des 4 thèmes proposés (un lien par thème).\n",
                    "title": "1.5 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                },
                {
                    "source_file": "correction/1-6-le-numerique-au-quotidien-correction_correction.html",
                    "sub_src": "\nQuelques exemples que nous vous proposons au cas où vous n'auriez rien trouvé, ...\n\nLa **domotique** est un domaine en pleine expansion qui vise à équiper numériquement notre maison :\n\n- [nest](https://nest.com/fr/)\n- [domotique](http://fr.wikipedia.org/wiki/Domotique)\n\nPour les **transports**, on peut s'intéresser aux voitures, les ordinateurs de bord sont depuis longtemps présents dans les autos, de plus en plus ils sont responsables de notre sécurité :\n\n- [electrostabilisateur]( http://fr.wikipedia.org/wiki/electrostabilisateur_programmé)\n- [ordinateur de bord](http://fr.wikipedia.org/wiki/Ordinateur_de_bord)\n\nLes **chaussures** : gadget ou réelle innovation ? Ce genre d’objet est de plus en plus présents dans nos vies :\n\n - [chaussures](http://www.linternaute.com/science/technologie/deja-demain/07/chaussure-intelligente/chaussure-intelligente.shtml)\n\nLes **lentilles pour la vue** ?\n\n - [lentilles](http://www.zdnet.fr/actualites/google-apres-les-lunettes-connectees-les-lentilles-pour-le-diabete-39797148.htm)\n\n",
                    "title": "1.6 le numérique au quotidien [correction]",
                    "type": "correction",
                    "videos": []
                },
                {
                    "source_file": "devoirs/1-7-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Le numérique dans la société::\n[markdown]\nLe numérique, un enjeu pour les **citoyens du XXIème siècle** ...\nLe numérique nous concerne tous en tant que citoyen. Il permet de nouvelles choses en automatisant des procédures et en donnant accès à des données jusqu'ici inexploitables. Mais numérique n'est évidemment pas systématiquement synonyme de progrès. Il faut toujours réfléchir aux **finalités** des applications développées. Nous vous invitons à vous **documenter** et à réfléchir aux questions suivantes :\n - Dans la **gestion de l‘énergie**: qu’est-ce que la **troisième révolution industrielle** et pourquoi le numérique y contribue-t-il ?\n- En **politique et média** : Qu’est-ce que la **vérification par les faits** (*fact-checking* en anglais) ? En quoi le numérique l’a rendu possible / facile ?\n- En **citoyenneté** : Que signifie **vote électronique** et en quoi cela pose-t-il des questions essentielles ? Trouver au moins un *avantage* et un *inconvénient*.\nAprès avoir fait vos recherches, répondez aux questions posées en **quelques lignes** et en indiquant les **liens** où vous avez trouvé ces informations.\n{####[markdown]\nVoici quelques liens que nous vous proposons mais que vous avez sûrement trouvés par vous-même :\n- À propos de la troisième révolution industrielle :\n  - [3eme revolution industrielle](http://fr.wikipedia.org/wiki/Troisième_révolution_industrielle)\n  - [pasdecalais](http://www.latroisiemerevolutionindustrielleennordpasdecalais.fr)\n- En **politique et média** : Qu’est-ce que la vérification par les faits (fact-checking en anglais) ? En quoi le numérique l’a rendu possible / facile ?\n  - [vérification par les faits](http://fr.wikipedia.org/wiki/Vérification_par_les_faits)   \n- En **citoyenneté** : Que signifie vote électronique et en quoi cela pose-t-il des questions essentielles ? Trouver au moins un avantage et un inconvénient.     \n  - [arguments] (http://fr.wikipedia.org/wiki/Vote_électronique#Arguments_en_faveur)\n}\n",
                    "title": "1.7 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                }
            ],
            "title": "1 Informatique et numérique"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/2-1-cours_webcontent.html",
                    "sub_src": "\n\n  [Historique](https://player.vimeo.com/video/122104231){: .lien_video }\n\n\nLes premiers ordinateurs ont été conçus et réalisés vers la fin de la\nseconde guerre mondiale. Il était déjà possible de leur faire réaliser\ndes calculs complexes inaccessibles à la main. Ils sont alors capables\nde manipuler des informations représentées sous une forme\nnumérique. Grâce à la numérisation de textes, d'images, de sons etc,\nles ordinateurs sont devenus des machines de traitement automatique de\nl'information. En français, le mot ordinateur s'est imposé en 1956.\n\nLes premières machines sont réalisées avec des composants\nrudimentaires comme des relais électriques et des lampes à\nvide. Ceux-ci seront par la suite remplacés par des transistors. Elles\nsont très volumineuses et lourdes, consomment énormément d'énergie.\n\nMais surtout, leur utilisation est complexe car il est nécessaire\nd'écrire les programmes qu'elles exécutent dans un langage très\ntechnique propre à chacune d'elles : un langage machine. De ce fait,\nleur diffusion et leur commercialisation sont très limitées. Deux\ninventions majeures vont lever ces difficultés : les langages\ninformatiques et la miniaturisation. C'est à la fin des années 50 que\nles premiers langages informatiques de programmation apparaissent. Ce\nsont des langages artificiels, c'est-à-dire inventés par l'homme,\nfacilement lisibles et intelligibles.\n\nUn programme spécifique appelé *compilateur* ou *interprète* se charge\nde traduire un texte écrit dans ce langage de programmation en langage\nmachine. Les conséquences sont importantes : la programmation devient\naccessible à un plus grand nombre d'individus, et l'écriture d'un\nprogramme n'est plus spécifique à une machine. C'est le début du\nmétier de programmeur.\n\nLe changement d'ordinateur pour une autre version plus rapide ou plus\npuissante est facilité et moins coûteux car les programmes ne doivent\npas être réécrits.\n\nLa deuxième évolution majeure, la miniaturisation, se déroule au début\ndes années 70. Elle est réalisée par l'intégration des transistors et\nde tous les composants électroniques réalisant les calculs dans un\nordinateur, dans un seul petit boîtier appelé microprocesseur. C'est\nIntel, entreprise fondée entre autres par Gordon Moore qui réalise\ncette performance technologique. Aujourd'hui des boîtiers de quelques\nmillimètres peuvent contenir plusieurs milliards de transistors. La\nminiaturisation permet l'augmentation des performances et la baisse de\nla consommation d'énergie.\n\nGordon Moore est également connu pour avoir énoncé une prédiction sur\nce processus de miniaturisation. *Le nombre de transistors intégrés\ndans les microprocesseurs doublera tous les 2 ans*. Cette affirmation\nconnue sous *la loi de Moore* se vérifie depuis plus de 40 ans. On\nl'interprète dans le grand public comme *la puissance des ordinateurs\ndouble tous les 2 ans*.\n\nCe qui signifie en pratique que lorsque vous achetez un ordinateur,\nmoins de 2 ans après vous pouvez trouver un autre modèle 2 fois plus\npuissant au même prix.\n\n",
                    "title": "2.1 Cours",
                    "type": "webcontent",
                    "videos": [
                        {
                            "video_link": "https://player.vimeo.com/video/122104231",
                            "video_title": "Historique"
                        }
                    ]
                },
                {
                    "source_file": "auto-evaluation/2-2-quizz_auto-evaluation.html",
                    "sub_src": "\n::(Q1/2)::[html]<p>De quand datent les premiers ordinateurs ?</p>{\n~<p>Au XVIIe siècle</p> ~<p>Juste avant la Révolution française</p>\n=<p>A la fin de la seconde guerre mondiale</p> ~<p>Dans les années\n1980</p> ~<p>Avant la première guerre mondiale</p> ####<p>C'est à la\nfin de la seconde guerre mondiale que les premiers ordinateurs sont\napparus.</p> }\n\n::(Q2/2)::[html]<p>Que dit la loi de Moore ?</p>{ ~<p>Que s'il existe au\nmoins deux façons de faire quelque chose et qu'au moins l'une de ces\nfaçons peut entraîner une catastrophe, il se trouvera forcément\nquelqu'un quelque part pour emprunter cette voie.</p>#<p>Non, ça c'est\nla loi de Murphy.</p> =<p>Que la puissance d'un ordinateur double tous\nles 2 ans environ.</p>#<p>Exact !</p> ####<p>La puissance d'un\nordinateur double environ tous les 2 ans.</p> }\n",
                    "title": "2.2 Quizz",
                    "type": "auto-evaluation",
                    "videos": []
                },
                {
                    "source_file": "auto-evaluation/2-3-quizz_auto-evaluation.html",
                    "sub_src": "\n// question: 165000 name: 1.2.2 Quizz (Q1/2) ::1.2.2 Quizz\n::(Q1/2)::[html]<p>Entre mon ordinateur et l'ordinateur de mon père qui\nont 12 ans d'écart, quelle est la différence de puissance à laquelle\non peut s'attendre ?</p>{ ~<p>Ils sont tous les deux aussi puissants,\nça n'a pas changé en 12 ans.</p>#<p>Il faut revoir la vidéo !</p>\n~<p>Mon ordinateur est environ 20 fois plus puissant.</p>#<p>Bien plus\nque ça...</p> =<p>Mon ordinateur est environ 60 fois plus\npuissant</p>#<p>Tout à fait !</p> ~<p>Mon ordinateur est environ 150\nfois plus puissant.</p>#<p>Quand même pas tant que ça !</p> ####<p>2\nans \\: x 2<br />4 ans \\: x 4<br />6 ans \\: x 8<br />8 ans \\: x1 6<br\n/>10 ans \\: x 32 <br /><strong>12 ans \\: x 64</strong></p>\\n<p>En\nd'autres mots un traitement qui prenait <strong>30 min</strong> avec\nl'ordinateur de mon père s'effectue en <strong>28 s</strong> sur le\nmien !</p> }\n\n\n// question: 165001 name: 1.2.2 Quizz (Q2/2) ::1.2.2 Quizz\n::(Q2/2)::[html]<p>D'où vient le mot \"bug\" ?<br />Il est malheureusement\ncourant d'être confronté à des programmes “bugués”, c'est à dire des\nprogrammes qui ne font pas ce qu'ils sont sensés faire.<br />Mais\nsavez-vous d'où vient le terme “bug” ?</p>\n{ =<p>En anglais, “bug” signifie insecte. Un insecte s'était glissé dans le\nmécanisme d'un des premiers ordinateurs, ce qui avait fait griller un\nrelais et provoqué une panne.</p>#<p><span style\\=\"color\\:\n\\#000000;\">En effet, il s'agissait d'une mite.<br /></span></p>\n~<p>“Bug” était le surnom d'un des premiers programmeurs chez\nMicrosoft, il était réputé pour commettre beaucoup\nd'erreurs.</p>#<p>Non, cherchez bien, c'est sur le web !</p> \n~<p>“Bug” est la version en verlan de “GUB” (Grande Unité Binaire), un projet\nd'ordinateur qui n'a jamais fonctionné.</p>#<p>Non, cherchez bien,\nc'est sur le web !</p> \n~<p>“Bug” est le diminutif de Bugatti, la marque de la première voiture de luxe de Bill Gates, le fondateur de\nMicrosoft. Cette voiture serait tombée 13 fois en panne en un an…</p>#<p>Non, cherchez bien, c'est sur le web !</p> \n~<p>L'équipe des fondateurs d'Apple étaient des fans du dessin animé “Bugs Bunny”. Ils\navaient pris l'habitude d'appeler “Bugs” leurs erreurs de\nprogrammation.</p>#<p>Non, cherchez bien, c'est sur le web !</p>\n####<p><span style\\=\"color\\: \\#000000;\">Le premier bug a été causé par\nune mite \\:</span></p>\\n<p><span style\\=\"color\\: \\#000000;\"><img\nsrc\\=\"https\\://ged.univ-lille3.fr/nuxeo/site/dav/EspacePublicWWW/images/culture-numerique/illustrations-questions/S2/TheFirstBug_1947.jpg\"\nalt\\=\"premier bug\" width\\=\"300\" height\\=\"213\" /></span></p>\\n<p><span\nstyle\\=\"color\\: \\#000000;\"> </span></p> }\n",
                    "title": "2.3 Quizz",
                    "type": "auto-evaluation",
                    "videos": []
                },
                {
                    "source_file": "devoirs/2-4-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Des personnages importants::\nTout ne s'est pas fait en un jour, ...\nVous connaissez sans doute des personnages importants de l’activité économique liée à l’informatique. Mais de nombreux **chercheurs** et **ingénieurs** ont contribué au **développement** des **idées** et des **machines**.\nNous vous proposons de faire une recherche sur **4 personnes**, dont 2 **femmes** qui ont largement contribué, chacune à leur façon,  à l'essor de l'informatique :\n- [Ada Lovelace] (http://fr.wikipedia.org/wiki/Ada_Lovelace)\n- [Grace Hopper] (http://fr.wikipedia.org/wiki/Grace_Hopper)\n- [Alan Turing] (http://fr.wikipedia.org/wiki/Alan_Turing)\n- [John Von Neuman] (http://fr.wikipedia.org/wiki/John_von_Neumann)\nPar ailleurs, l'un de ces personnages est étroitement lié à une machine : **ENIGMA**. Vous chercherez également ce qu'est cette machine et à quoi elle servait. Tous deux, **l'homme** et la **machine**, sont les héros du film *The imitation Game* sorti sur les écrans français en janvier 2015.\nAprès avoir effectué vos recherches sur ces personnes et cette machine, rédigez une présentation en **quelques lignes** en les resituant chronologiquement.\n",
                    "title": "2.4 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                },
                {
                    "source_file": "webcontent/2-5-personnages-importants-correction_webcontent.html",
                    "sub_src": "\n### Ada Lovelace\n![Ada Lovelace](media/adalovelace.jpg){: .imggauche}\n\n*Ada Lovelace* est une **mathématicienne**, fille du poète Lord Byron qui travaille au milieu du **XIXeme** avec Charles **Babbage** sur un projet que nous pourrions qualifier de **premier ordinateur**.\n\nCe projet n'aboutira finalement pas dans un succès commercial mais aura contribué à produire les **bases de l'informatique**.\nLe rôle d'Ada Lovelace dans ce projet a été tel qu'elle a été depuis qualifiée de *première programmeuse*.\n\t\n### Alan Turing\n![Alan Turing](media/alanturing.jpg)\t\nDans les **années 1930**, les travaux du **mathématicien** *Alan Turing* sont déterminants pour définir d'abord ce qu'est une **machine programmable** universelle, et ensuite pour dessiner les frontières de ce qu'il est possible de calculer à l'aide d'une telle machine. Turing a également eu une action déterminante pendant la **seconde guerre mondiale**. Il conçoit des machines capables de **décrypter** les messages allemands codés par la machine **Enigma**. Ses découvertes permirent, selon plusieurs historiens, de raccourcir la capacité de résistance du régime nazi de deux ans.\n\nSi la vie de cet homme exceptionnel au destin tragique vous intéresse nous vous conseillons les deux liens suivants :\n\n- [Alan Turing 1](http://future.arte.tv/fr/alan-turing)\n- [Alan Turing 2](http://videotheque.inria.fr/videotheque/doc/758)\n\nVous y découvrirez entre autre une hypothèse sur l'origine du logo de la pomme croquée d'`Apple`. \n\t\t\n### John Von Neumann \t\n![John Von Neumann](media/johnVonNeumann.jpg)\n\nDans les **années 40**, **John Von Neumann** propose une **architecture** pour une machine programmable.\n\nPar architecture, il faut entendre comme dans l'habitat, une description précise de son organisation qui permet d'expliquer son fonctionnement et la construire effectivement. Notre ordinateur moderne apparaît. \n\n![architecture Von Neumann](media/VonNeumannArchitecture_fr.png)\n\n\"Von Neumann Architecture\",\nschéma par Chris Martin, source sous licence CC-BY-SA 3.0\n\n\nDans ce monde numérique qui évolue si vite, il est remarquable que **deux notions fondamentales**, à savoir ce qu'il est *possible de calculer* par machine programmable défini par Turing, et cette *architecture* de machine dite de Von Neumann soient toujours celles qui régissent le fonctionnement de nos **ordinateurs d'aujourd'hui**.\n\n### Grace Hopper\n![Grace Hopper](media/Grace_Hopper_and_UNIVAC.jpg)\n\n\"Grace Murray Hopper au clavier de l'UNIVAC, vers 1960.\",\nSmithsonian Institution, Source, photo sous licence CC-BY 2.0.\t\nC’est à la **fin des années 50** que les premiers **langages** informatiques de programmation apparaissent. Ce sont des langages artificiels, c'est-à-dire inventés par l'homme, facilement lisibles et intelligibles. Un programme spécifique appelé *compilateur* ou *interprète* se charge de traduire un texte écrit dans ce langage de programmation en langage machine. Les conséquences sont importantes : la **programmation** devient accessible à un plus grand nombre d'individus, et l'écriture d'un programme n'est plus spécifique à une machine. C'est le début du **métier de programmeur**.\n\nGrace Hopper a inventé le **premier compilateur**. Elle est aussi à l'origine du langage `Cobol` qui a été énormément utilisée dans l'informatique de gestion. On la voit ici (photo ci-contre) au clavier de l'`UNIVAC`, vers 1960.\n\n",
                    "title": "2.5 Personnages importants - Correction",
                    "type": "webcontent",
                    "videos": []
                },
                {
                    "source_file": "devoirs/2-6-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::La vitesse des ordinateurs::\nLe **microprocesseur** qui réalise les calculs dans un ordinateur déclenche ses opérations à intervalles de temps régulier. C'est **l'horloge** qui a ce rôle de définir la cadence de travail du processeur et donc sa **vitesse de calcul**.  La fréquence d'horloge se mesure en kiloHertz (kHz, milliers de fois par seconde), en MégaHertz (Mhz, millions de fois par seconde) ou en GigaHertz (GHz, milliard de fois par seconde). Cela correspond au nombre maximal d’opérations élémentaires qu’un ordinateur peut effectuer **en une seconde**. Nous vous proposons de faire quelques recherches pour prendre conscience des *ordres de grandeur* et des évolutions sur les 70 dernières années.\nEn vous aidant par exemple de :\n- [http://fr.wikipedia.org/wiki/Histoire_des_ordinateurs](http://fr.wikipedia.org/wiki/Histoire_des_ordinateurs)\nretrouver la **date** d'apparition et la **fréquence** d'horloge (en khz, Mhz ou Ghz) de ces machines emblématiques de leur époque :\n    - l’ENIAC \n    - Apple I\n    - IBM PC\n    - Ipad (premier modèle)\n    - smartphone Samsung Galaxy S4\nEssayez de **tracer un diagramme** ou une courbe pour **représenter** cette **évolution**. Que constatez-vous ?\n{}\n",
                    "title": "2.6 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                },
                {
                    "source_file": "webcontent/2-7-la-vitesse-des-ordinateurs-correction_webcontent.html",
                    "sub_src": "\n\n**L'ENIAC**\n![ENIAC](media/ENIAC.gif)\n\nL’un des tout premiers ordinateurs, l’`ENIAC` a été réalisé en **1946**. Il avait une vitesse d’horloge de **100khz**, ce qui signifie qu’il était capable de faire **100 000 opérations élémentaires par seconde**. Ces opérations étaient par exemple des additions sur des nombres simples. Les actions complexes que l’`ENIAC` réalisait étaient *décomposées* en une multitude d'opérations élémentaires. C’est toujours le cas pour tous les programmes informatiques.\n\nCes caractéristiques techniques peuvent nous paraître ridicules mais elles correspondent à calculer en **3s** ce que des mathématiciens sont capables de faire *à la main* en **3 jours**.\n\n------------------\n\nEn **1976**, sort l’`Apple I` avec une fréquence d’horloge de **1 Mhz **(1 Million d’opérations élémentaires par seconde). En trente ans, la puissance a été **multipliée par 10 **alors que l’encombrement est passé de la taille d’une maison (30 tonnes, 170 m2) à celui d’une machine qui tient sur une table.\n\n------------------\n\nL’`IBM-PC` quant à lui apparaît en **1981** et *tourne* à une vitesse de **4,77Mhz**. La vitesse a donc été multipliée par presque 5 en 5 ans.\n\n------------------\n\nEn **2010**, une des premières tablettes, l’`IPAD` est proposé sur le marché avec un processeur travaillant à 1Ghz, soit **1 milliards d’opérations élémentaires par seconde**. Notons que ces opérations élémentaires sont de plus en plus complexes, ce qui accentue encore l’augmentation de la puissance des machines. 1Ghz correspond à 200 fois 5Mhz, l’IPAD est donc plus de **200 fois plus puissant** que les premiers PC.\n\n------------------\n\nEn **2013**, le `Samsung Galaxy S4` est un *smartphone* qui tient dans la main et dans la poche et qui a une fréquence d’horloge supérieure à **2Ghz**. On pourrait ajouter que ces machines ont plusieurs processeurs qui travaillent ensemble ce qui démultiplie là encore leurs capacités, …\n\n![loi de Moore](media/graph_puissance_small.jpg)\n\nComme nous l’avons précisé dans la question, la vitesse des processeurs n’est pas le seul élément à prendre en compte, mais il donne une bonne idée de l’évolution de la puissance des machines.\n\nReprésenter cette évolution sur une courbe est particulièrement difficile, car la courbe monte tellement fort qu’elle *sort* très rapidement de la feuille. Multiplier par 2 à chaque intervalle de temps régulier définit une courbe **exponentielle**, caractéristique de la *loi de Moore* qui prédit cette évolution. Peu de technologies ont des évolutions aussi spectaculaires.\n\nNotons, que cette loi *empirique* (constatée, mais pas démontrée) s'arrêtera forcément un jour, la vitesse ne pouvant être infinie. Beaucoup de gens ont d'ailleurs prédit qu'à telle ou telle date, la loi ne se vérifierait plus, ... or, pour l'instant ça tient toujours, ...\n\n",
                    "title": "2.7 la vitesse des ordinateurs [Correction]",
                    "type": "webcontent",
                    "videos": []
                },
                {
                    "source_file": "devoirs/2-8-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::D'où vient le PC ?::\n[markdown]\n![Francois Gernelle](media/FrancoisGernelle.jpg)\n**L'Ordinateur personnel**\nHistoriquement, les premiers ordinateurs étaient de **très grosses machines**, occupant des salles entières et dédiées à des traitements de gestion, appelés *MainFrame*. La **miniaturisation** a entraîné l’apparition de nouveaux ordinateurs pouvant simplement être posés sur des **bureaux**. C’est la naissance de la *deuxième ère* de l’informatique.\nC’est au début des années **70**,  qu’un français, **François Gernelle** (photo),  a breveté l'idée d’**ordinateur personnel**.\nMais c'est au début des années **80**, qu'une grande entreprise américaine du secteur informatique, `IBM` commence une production massive d’un **autre modèle** d’ordinateurs personnels qui lui assure un **succès commercial** important et qui marque le secteur pendant des années. Depuis, on dit souvent que le premier ordinateur personnel a été celui fabriqué par `IBM`: le **PC** (*Personnal Computer*).\nÀ l'aide de ressources telles que :\n- [http://fr.wikipedia.org/wiki/IBM_PC](http://fr.wikipedia.org/wiki/IBM_PC)\nfaites des recherches sur l'`IBM - PC` pour répondre aux questions suivantes\n    - En quelle **année** est-il apparu ?\n    - Quelle **quantité** en a-t-on fabriqué ?\n    - Quelle était la taille de son **Disque dur** ?\n    - Pourquoi le `PC` d’`IBM` est-il resté dans l’histoire ?\n{}\n",
                    "title": "2.8 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                },
                {
                    "source_file": "webcontent/2-9-dou-vient-le-pc-correction_webcontent.html",
                    "sub_src": "\n### Le PC de 1981 à aujourd'hui\n\nL'`IBM-PC` a fait son apparition en **1981**. Plusieurs millions d'exemplaires ont été vendu à travers la monde. Le premier modèle ne possédait **pas de disque dur**, seulement des lecteurs de disquettes. Par la suite, d'autres modèles toujours plus puissants et sophistiqués ont vu le jour. À chaque fois les nouveaux modèles étaient compatibles avec les anciens, cela signifie que les programmes qui fonctionnaient sur les anciens modèles pouvaient être réutilisés avec les nouveaux.\n\n`IBM` s'est associé avec `Microsoft` qui fournissait le système d'exploitation qui s'appelait alors `MS-DOS`. Celui-ci a évolué en même temps que les capacité des machines. La dernière génération connue s'appelle ... `Windows 10` !\n\nGrâce à son **architecture ouverte** (i.e. la \"description des schémas de fonctionnement\" a été diffusée), de nombreuses autres marques ont fabriqué des machines comparables en respectant des **normes** et en installant également les systèmes de `Microsoft`. On les a appelé des **compatibles PC**. Aujourd'hui, on a l'habitude de parler de `PC` et `IBM` n'a plus qu'une très petite part de ce marché. En revanche `Microsoft` reste hégémonique pour le système d'exploitation `Windows`. \n\nIl faut néanmoins savoir que d'autres systèmes peuvent être installés sur les `PC`, en particulier `Linux`, qui est un système d'exploitation **rapide**, **fiable** et **puissant** qui est par certains aspects bien meilleur que `Windows`. Malheureusement, les accords commerciaux entre les constructeurs de machines et `Microsoft` rendent assez compliqués l'achat d'un `PC` équipé de `Linux`. En pratique, un PC équipé de `Linux` à la place de `Windows` est quasi introuvable dans le commerce grand public.\n\nPour l'anecdote, le texte que vous êtes en train de lire a été rédigé sur un PC sous `Linux`.\n\n### Qui l’eut cru ?\n\nEn **1984** sort la troisième génération de PC : le `PC/AT`\n\nextrait de wikipedia : [http://fr.wikipedia.org/wiki/IBM_PC](http://fr.wikipedia.org/wiki/IBM_PC)\n\n*La machine fut jugée suffisamment puissante — selon les critères de l'époque — pour être interdite à l'exportation vers les pays de l'Est, alors sous embargo technologique (COCOM). IBM en refusa aussi pendant deux ans la vente à prix réduit au personnel, arguant qu'un particulier ne pouvait pas avoir besoin d'une telle puissance ni d'une telle capacité disque (30 Mo), qui la destinaient plutôt aux petites et moyennes entreprises.*\n\n",
                    "title": "2.9 D'où vient le PC ? [Correction]",
                    "type": "webcontent",
                    "videos": []
                },
                {
                    "source_file": "devoirs/2-10-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Les interfaces Homme - Machine::\nUne branche de la **science informatique** est l'étude des **interactions** entre l’homme et la machine. De ce point de vue, de nombreuses avancées ont été réalisées depuis 1945. Elles sont liées à  la fois, à des **progrès** technologiques, à des efforts **d’ingénieurs** et à des succès **commerciaux**, mais aussi à des avancées dans les **idées**.\nLe numérique n'a pas toujours été aussi facile d'accès qu'aujourd'hui, ... Nous vous proposons de faire quelques recherches pour appréhender l'évolution des interfaces.\n- Que doit-on à Douglas **Engelbart** ?\n- Qu'est-ce que le  “**Palo Alto Research Center** “ ? Qu’y fait-on ?\n- Qu’est-ce que l’ordinateur **Lisa** ?\n   - Qu’a-t-il apporté de nouveau ?\n   - Qui l’a fabriqué ?\n   - En quelle année est-il apparu ?\nPar ailleurs, les ordinateurs prennent des formes nouvelles et se combinent avec d'autres objets du quotidien, ...\n- Qu’appelle-t-on **l’informatique ubiquitaire** ou *informatique omniprésente* ?\n   - quel objet en est le meilleur représentant ?\nAprès avoir effectué vos recherches, répondez aux questions.\n{}\n",
                    "title": "2.10 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                },
                {
                    "source_file": "webcontent/2-11-evolution-des-interfaces-homme-machine-correction_webcontent.html",
                    "sub_src": "\n### Les interfaces ont démocratisé l'accès au numérique\n\nUne branche de la **science informatique** est l'étude des interactions entre l’homme et la machine.\nDe ce point de vue, de nombreuses avancées ont été réalisées depuis 1945. Elles sont liées à  la fois à des progrès technologiques, des efforts d’ingénieurs et des succès commerciaux, mais aussi des avancées dans les idées.\n\n**Douglas Engelbart** par exemple,  était un grand spécialiste des interfaces homme-machine. Il a créé le premier **prototype de souris** (ci-contre) en **1968**. Il avait imaginé également les interfaces graphiques qui apparaîtront plus tard. En attendant, les écrans n'affichaient que du texte, ligne par ligne et les commandes étaient entrées avec un clavier. Les **cartes perforées** étaient également très utilisées pour ne pas avoir à re-saisir les programmes à chaque utilisation.\n\t\n![Le premier prototype de souris](media/Douglas_Engelbart's_prototype_mouse.jpg)\n\n\"Le premier prototype de souris, développé par Douglas Engelbart\"\nPhoto par Michael Hicks, source sous licence CC-BY 2.0.\n\t[Pour en savoir plus sur Doug Engelbart.](http://www.silicon.fr/in-memoriam-doug-engelbart-pere-de-la-souris-87561.html) \n\nC'est également au **P.A.R.C**. qu'est apparue la notion d'informatique **ubiquitaire** qui est considérée comme la **troisième ère de l'informatique**. La première étant celle des *gros systèmes* (MainFrame), la deuxième apparue dans les années 80, celle des *ordinateurs personnels* (PC et Mac). L'emblème de cette informatique ubiquitaire est le **smartphone**, un ordinateur très puissant qui ne nous quitte presque plus, et qui nous permet d'être connecté en permanence.\nOn parle aussi, d'informatique *omniprésente* ou *d'intelligence ambiante.*\n\nLes **objets connectés**, de plus en plus présents, participent également à cette évolution. Cette omniprésence de l'accès à l'information a un fort impact sur la société, modifie les habitudes de travail et de vie privée.\n\n![Lisa](media/Apple_Lisa_2.jpg)\n\nLe Lisa, photo par Marcin Wichary,\nsource sous licence CC-BY 2.0.\n\nEn **1983**, Apple achète pour 40 000$, une licence pour le brevet de la souris, et sort le premier ordinateur personnel équipé d'une souris et d'une interface graphique : le **Lisa**. Il va révolutionner le marché des ordinateurs personnels qui débutait (2 ans après le premier PC). Parmi les concepteurs du Lisa, on retrouvera **Steve Jobs**, un autre visionnaire qui fera la carrière qu'on connaît chez `Apple`.\n\n",
                    "title": "2.11 Évolution des interfaces homme-machine - [Correction]",
                    "type": "webcontent",
                    "videos": []
                }
            ],
            "title": "2 Historique informatique"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/3-1-cours_webcontent.html",
                    "sub_src": "\n\n  [Naissance d'internet](https://player.vimeo.com/video/122104260){: .lien_video }\n\nDans les années soixante, il existait aux États-Unis de gros centres\nde calcul abritant de très gros ordinateurs. Ceux-ci étaient reliés\nentre eux par des câbles qui leur permettaient de transporter\nl'information numérique : des réseaux informatiques (network en\nanglais souvent abrégé en net).\n\nEn période de guerre froide, les US avaient peur de voir leurs centres\nbombardés ou une ligne qui reliait 2 centres coupée. Il fallait\npouvoir communiquer entre des centres stratégiques et pouvoir\nbénéficier à distance des résultats des supercalculateurs même en cas\nd'attaque nucléaire. Ils ont demandé aux chercheurs de proposer un\nsystème qui serait tolérant aux pannes… ou aux bombes.\n\nL'idée a été de multiplier les centres et d'interconnecter les réseaux\nde chaque centre. Pour protéger l'ensemble, la proposition a été de\nmultiplier les chemins entre centres. Ainsi si un centre explosait ou\nqu'une ligne était coupée, les autres centres pourraient encore\ncommuniquer entre eux en passant par d'autres chemins : ce fut la\nnaissance d'ARPANET (1971).\n\nCe système a tout de suite rencontré un grand succès. Il a ensuite\névolué vers INTERNET, nom qu'on lui a donné au début des années 80\npour signifier qu'il s'agit d'une interconnexion de réseaux.\n\nSelon le vieil adage *tous les chemins mènent à Rome/, le système de\ncommunication permet d'échanger des données entre 2 points en passant\npar n'importe quel chemin à l'intérieur d'internet.*\n\n\n",
                    "title": "3.1 Cours",
                    "type": "webcontent",
                    "videos": [
                        {
                            "video_link": "https://player.vimeo.com/video/122104260",
                            "video_title": "Naissance d'internet"
                        }
                    ]
                },
                {
                    "source_file": "auto-evaluation/3-2-quizz_auto-evaluation.html",
                    "sub_src": "\n::signification d'Internet::\n[html]<p>Que signifie internet ?</p>{ \n~<p>Il s'agit de la contraction des mots anglais \\: \"<em>international</em>\" et \"<em>network</em>\" (réseau international).</p>#<p>Ça aurait pu, mais non !</p> \n=<p>Il s'agit de la contraction des mots \"<em>interconnection</em>\" et\n\"<em>networks</em>\" (interconnexion de réseaux).</p>#<p>Exactement\n!</p> \n~<p> Les lettres du mot I.N.T.E.R.N.E.T sont les initiales des\nnoms de ses 8 fondateurs.</p>#<p>Pas du tout !</p> \n####<p>Internet est la contraction des deux mots anglais \"interconnection\" et \"networks\", qui signifie \"interconnexion de réseaux\".</p> }\n\n\n::Âge d'internet::\n[html]<p>Quelle est la date de la création d'internet ? (date\nla plus proche)</p>{ \n~<p>1789</p>#<p>Vraiment ?</p>\n~<p>1918</p>#<p>N'est-ce pas un peu tôt ?</p> \n~<p>1945</p>#<p>N'est-ce pas un peu tôt ?</p> \n=<p>1970</p>#<p>Oui, c'est cela.</p>\n~<p>1990</p>#<p>Non, c'est trop récent...</p> \n~<p>2005</p>#<p>Aussi tard ?</p> \n####<p>C'est aux environs de <strong>1970</strong> qu'a été\ncréé internet.</p> }\n\n\n::Robustesse d'Internet::\n[html]<p>Pourquoi internet est-il qualifié de réseau robuste\nou tolérant aux pannes ?</p>\n{ ~<p>Parce qu'il est fabriqué avec des\nmatériaux très résistants.</p>#<p>Et non, ce n'est pas uniforme...</p>\n~<p>Parce que beaucoup de salariés sont à sa disposition pour le\nréparer rapidement si nécessaire.</p>#<p>Vous êtes sûr ?</p> \n=<p>Parce que, de par sa conception, il peut fonctionner en mode *dégradé*, c'est à dire que même si des lignes ou des machines sont en panne, d'autres chemins peuvent être utilisés pour véhiculer les\ninformations.</p>#<p>Tout à fait !</p> \n####<p>Parce qu'il peut fonctionner en mode \"dégradé\"...</p> }\n\n",
                    "title": "3.2 Quizz",
                    "type": "auto-evaluation",
                    "videos": []
                },
                {
                    "source_file": "devoirs/3-3-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Qui a inventé Internet ?::\nOn a parfois une représentation erronée du rôle des différents pays dans la **création** d'Internet. Faites quelques recherches sur les **deux personnages** suivants pour rétablir un juste équilibre.\n- Qui est **Vinton « Vint » Gray Cerf** ? Comment est-il parfois surnommé ?\n- Qui est **Louis Pouzin** ? Qu’était le projet **Cyclades** ?\nAprès vous être documenté sur ces deux personnages importants, rédigez une courte réponse qui résume ce que vous avez appris.\n{}\n",
                    "title": "3.3 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                },
                {
                    "source_file": "webcontent/3-4-qui-a-invente-internet-correction_webcontent.html",
                    "sub_src": "\n \n### Vinton Gray Cerf\n![Vinton Cerf](media/vintoncerf.jpg)\n\nDr. Vint Cerf, photo de Veni Markovski,\nsource sous licence CC-BY 3.0.\n\t\n*Extrait de Wikipédia*\n\n`Vinton « Vint » Gray Cerf, né le 23 juin 1943 à New Haven, Connecticut, États-Unis, est un ingénieur américain, chercheur et co-inventeur avec Bob Kahn du protocole TCP/IP. Il est considéré comme l'un des pères fondateurs d'Internet.`\n\nIl est souvent appelé le \"père d'Internet\".\n\t\n### Louis Pouzin\n![louis Pouzin](media/louispouzin.jpg)\n\nLouis POUZIN, Photo de Jérémie BERNARD,\nsource sous licence CC-BY-SA 3.0.\n\t\n*Extrait de Wikipedia*\n\n`Cyclades était un projet expérimental français ayant pour but de créer un réseau global de télécommunication utilisant la commutation de paquets. Créé en 1971, conçu par Louis Pouzin, il fut abandonné en 1978. Ses concepts ont influencé les travaux de développement de l'Internet en inspirant sa suite de protocoles.`\n\nSi vous voulez écouter son **avis** sur ce qu'est devenu Internet, voici une vidéo très intéressante :  \n[Louis Pouzin Youtube](https://youtu.be/p70Go9IS1h4)\n\n",
                    "title": "3.4 Qui a inventé Internet ? - Correction",
                    "type": "webcontent",
                    "videos": []
                },
                {
                    "source_file": "devoirs/3-5-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Qui a accès à internet ?::\nEn utilisant les ressources suivantes (et d’autres) :\n- [http://fr.wikipedia.org/wiki/Histoire_d'Internet](http://fr.wikipedia.org/wiki/Histoire_d'Internet)\n- [http://www.blogdumoderateur.com/chiffres-internet/](http://www.blogdumoderateur.com/chiffres-internet/)\nChercher les réponses aux questions suivantes\n- **Combien** y avait-il dans le monde d’ordinateurs connectés :\n        en 1984, en 1987, en 1989, aujourd'hui :\n- en quelle année a-t-on passé la barre du **Million d’utilisateurs** ? \n- Quelle **proportion** de la population mondiale **n’a pas accès** à Internet ?\n- À l’inverse, quelle proportion a accès à Internet en **France** ? \n  - Est-ce supérieur ou inférieur à la moyenne **européenne** ?\n  - Est-ce supérieur ou inférieur à la proportion des **USA** ?\n- En **1 mn**, dans le monde :\n        Combien de recherche **Google** ?\n        Combien de **mails** sont envoyés ?\n        Combien de contenus partagés sur **Facebook** ?\nAprès avoir effectué vos recherches, répondez à ces questions.\n{}\n",
                    "title": "3.5 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                },
                {
                    "source_file": "webcontent/3-6-qui-a-acces-a-internet-correction_webcontent.html",
                    "sub_src": "\nL'accès à Internet a considérablement évolué en quelques années. Néanmoins, de grandes **inégalités** persistent encore.\n\nLe nombre d'ordinateurs connectés permet de faire une approximation du nombre de personnes qui utilisent internet.\n\nIl y avait **1000 machines connectées en 1984**, 3 ans plus tard 10 fois plus, c'est à dire **10 000 en 1987**. Cela a encore été multiplié par 10 dans les 2 années qui suivirent, soit **100 000 machines en 1989**. Puis le **million** d'utilisateurs a été franchi en **1992**.\n\n22 ans plus tard, nous en sommes à presque **3 milliards d'utilisateurs** à travers le monde.\n\nIl n'existe certainement rien d'autre à travers l'histoire qui ait connu une telle **évolution** !\n\nEt pourtant, la population mondiale est supérieure à 7 Milliards, ce qui nous permet de nous rendre compte que **plus de la moitié de la population mondiale** n'a toujours **pas accès** à internet !\n\nEn **France** en 2014, **83%** de la population est connectée, un taux supérieur à la moyenne européenne et supérieur aussi à celui des États-unis.\n\nEnfin, pour tenter de mesurer l'ampleur des informations échangées sur internet, regardons ce qui ce passe en moyenne chaque minute :\n\n- 4 millions de recherches Google\n- 200 millions de mails envoyés \n- 2,46 millions de contenus partagés sur Facebook\n\n",
                    "title": "3.6 Qui a accès à internet ?  [Correction]",
                    "type": "webcontent",
                    "videos": []
                }
            ],
            "title": "3 Naissance d'Internet"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/4-1-cours_webcontent.html",
                    "sub_src": "\n\n  [Comment ça marche ?](https://player.vimeo.com/video/122104315){: .lien_video }\n\nRegardons un peu plus précisément comment fonctionne internet. Trois\ningrédients importants interviennent dans le système ; le premier est\nl'adresse `IP` qui permet de fournir un nom et une adresse à chaque\nmachine.  Chaque ordinateur connecté à internet a un numéro unique (un\npeu comme un numéro de téléphone, mais bien plus long !). Ce numéro\ndépend de l'endroit où l'ordinateur se trouve dans internet et permet\ndonc de trouver un chemin dans l'interconnexion de réseaux. On appelle\nce numéro l'adresse `IP`. De façon très simplifiée, l'adresse `IP`\ncomporte une partie identifiant un réseau dans cette interconnexion et\nune autre partie identifiant la machine au sein de ce réseau.\n\nPour échanger des informations d'un ordinateur vers un autre, celui\nqui *envoie* l'information doit donc connaître l'adresse `IP` du\ndestinataire, et pour obtenir une réponse, l'émetteur doit\nimpérativement fournir dans chaque message envoyé sa propre adresse\n`IP`. Tous les messages échangés sur Internet sont donc de la forme :\n`n°IP destinataire / information / n°IP émetteur`.\n\nLe deuxième ingrédient concerne le *Routage* des messages sur le\nréseau.  Si les ordinateurs émetteur et destinataire sont dans le même\nréseau, le principe est simple : l'ordinateur émetteur envoie son\nmessage sur ce réseau et chaque ordinateur du réseau le lit. Les\ndestinataires peuvent alors s'intéresser aux messages qui leurs sont\ndestinés.  Si le destinataire n'est pas dans le même réseau, la\ntransmission ne peut plus se faire directement à l'ordinateur du\ndestinataire. L'émetteur envoie le message à une machine connectée à\nla fois à ce réseau et à un ou plusieurs autres réseaux. Cette machine\nest une passerelle/routeur qui réalise effectivement\nl'interconnexion. Le routeur renvoie alors le message vers les autres\nréseaux pour poursuivre son chemin. Et ce processus se répète jusqu'à\nce que le message arrive à destination.\n\n\nEnfin le troisième ingrédient concerne le nommage des machines.  En\neffet, ce sont des femmes et des hommes qui utilisent ces\nmachines. Pour désigner un destinataire, personne ne manipule\ndirectement des adresses `IP` qui sont des numéros bien plus longs que\nles numéros de téléphone. Dans notre interface avec le monde\nd'internet nous connaissons plutôt des noms comme `www.univ-lille3.fr`\nou encore `www.service-public.fr`. Le lien entre adresses `IP` et noms\nse fait par le biais des *serveurs de noms* qui, à la manière d'une\nliste de contacts dans notre téléphone, stockent un ensemble de nom et\nd'adresses `IP`.\n\nTrès concrètement, regardons par exemple ce qui se passe lorsque je\nveux consulter la page d'accueil de Lille 3.  tout d'abord, je clique\nsur un lien vers le site de l'université. Ce lien contient le nom de\nla machine capable de me fournir la page d'accueil :\n`www.univ-lille3.fr`. Mon ordinateur va donc contacter un serveur de\nnoms pour connaître l'adresse `IP` de cette machine. Une fois que\ncette adresse `IP` est connue, il peut communiquer avec\n`www.univ-lille3.fr` et envoyer à cette machine un message qui demande\nle contenu de cette page d'accueil. Le message contient bien entendu\nl'adresse `IP` de mon ordinateur, ainsi la machine peut me répondre en\nrenvoyant le contenu qui m'intéresse. Il ne reste plus alors à mon\nordinateur qu'à afficher ce contenu.\n\n",
                    "title": "4.1 Cours",
                    "type": "webcontent",
                    "videos": [
                        {
                            "video_link": "https://player.vimeo.com/video/122104315",
                            "video_title": "Comment ça marche ?"
                        }
                    ]
                },
                {
                    "source_file": "auto-evaluation/4-2-quizz_auto-evaluation.html",
                    "sub_src": "\n// question: 165016 name: 1.4.1 Quizz (Q1/3) ::1.4.1 Quizz\n::(Q1/3)::[html]<p>A quoi sert une adresse IP ?</p>{ =<p>À identifier\nles machines connectées de façon unique.</p>#<p>Oui !</p> ~<p>À\ndifférencier les gros ordinateurs et les plus petits.</p>#<p>Comment\nça ?</p> ~<p>À envoyer des mails automatiquement.</p>#<p>Pas du\ntout...</p> ####<p>Une adresse IP (Internet Protocol) sert à\nidentifier de façon unique les machines connectées.</p> }\n\n\n// question: 165027 name: 1.4.1 Quizz (Q2/3)_NEW ::1.4.1 Quizz\n::(Q2/3)::[html]<p>A l'aide de quel équipement réalise-t-on\nl'interconnexion de réseaux ?</p>{ ~<p>Une adresse IP</p>#<p>Vous\ndevriez revoir la vidéo !</p> ~<p>Un serveur de noms</p>#<p>Non, il ne\ns'agit d'un serveur de noms.</p> =<p>Un routeur</p>#<p>Exact !</p>\n####<p>C'est à l'aide d'un routeur, encore nommé passerelle qu'on\nréalise l'interconnexion de réseaux.</p> }\n\n\n// question: 165018 name: 1.4.1 Quizz (Q3/3) ::1.4.1 Quizz\n::(Q3/3)::[html]<p>Qu'est-ce qu'un serveur de noms ?</p>{ ~<p>Un site\nweb qui aide à choisir un prénom pour ses enfants.</p>#<p>C'est une\nblague !</p> ~<p>Un logiciel (pirate) qui permet de trouver les mots\nde passe d'autres utilisateurs.</p>#<p>Pas vraiment...</p> =<p>Une\nmachine qui contient une table d'équivalence entre des noms de\nmachines et leur adresse IP.</p>#<p>Oui, c'est exact !</p> ####<p>Un\nserveur de noms est une machine qui contient une table d'équivalence\nentre des noms de machines et leur adresse IP.</p> }\n",
                    "title": "4.2 Quizz",
                    "type": "auto-evaluation",
                    "videos": []
                },
                {
                    "source_file": "devoirs/4-3-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Combien y-a-t-il d'adresses IP ?::\n[markdown]\n**Plus assez d'adresses IP ?**\nLes fondateurs d'Internet n'envisageaient sûrement pas le succès phénoménal qu'il a rencontré. Aussi, le système de numérotation des adresses IP n'a pas été prévu suffisamment large pour répondre au nombre d'utilisateurs grandissant. Nous sommes depuis quelques années arrivés à un stade de **pénurie d'adresses IP**. La norme a dû évoluer, ...\nAujourd'hui deux normes cohabitent en attendant que tous les anciens systèmes s'adaptent à la nouvelle. Ces deux normes portent le nom de `IPV4` et `IPV6`.\nFaites quelques recherches sur ces normes pour répondre aux 2 questions suivantes :\n- Dans la norme IP version 4 `IPV4`, un numéro est composé de 4 nombres entre 0 et 255. Avec cette norme, y a-t-il plus de numéro IP possibles que d'êtres humains sur terre ?\n- Nouvelle norme IP version 6 `IPV6`. Combien pourrait-on avoir de numéros IPV6 différents par millimètre carré de la surface de la terre ?\n{}\n",
                    "title": "4.3 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                },
                {
                    "source_file": "webcontent/4-4-combien-y-a-t-il-dadresses-ip-correction_webcontent.html",
                    "sub_src": "\n### `IP V4` : nombre d'adresses *vs* nombre d'êtres humains\n\nLa population mondiale est supérieure à 7 Milliards, or le système `IPV4` ne peut représenter que 4 milliards (4 294 967 296 = (2^^32^ )) d'adresses, ce qui est largement insuffisant.\nL'apparition entre autre des \"objets connectés\" et des appareils mobiles fait exploser la demande et on entrevoit que cette demande va considérablement augmenter dans un avenir proche.\n\n### `IP V6`, on voit les choses en grand\n\nHeureusement, la nouvelle norme IPV6 est quand à elle beaucoup plus généreuse :\n\n*Extrait wikipedia* : [http://fr.wikipedia.org/wiki/IPv6](http://fr.wikipedia.org/wiki/IPv6)\n\n`l'augmentation de 2^^32 (soit environ 4,3×109) à 2128 (soit environ 3,4×1038) du nombre d'adresses disponibles.\nPour épuiser la totalité de ce stock d'adresses, il faudrait placer 667 millions de milliards d'appareils connectés sur chaque millimètre carré de la surface de la Terre`\n\nCette fois on peut espérer tenir avec ce système un bon moment.\n\n### Le numérique compte en binaire :\n\nNous n'avons pas encore vu comment on code les informations en binaire. Pour tous ceux d'entre vous qui n'ont pas de culture scientifique, cela peut paraître abstrait. On peut quand même remarquer que les résultats ci-dessus s'expliquent en calculant de la façon suivante :\n\n- IPV4 utilise des adresses codées sur 32 bits, le nombre de combinaisons est alors 2^32.\n- alors que IPV6 code les adresses sur 128 bits, ce qui fait 2128 adresses possibles.\n\n",
                    "title": "4.4 Combien y-a-t-il d'adresses IP ? [Correction]",
                    "type": "webcontent",
                    "videos": []
                },
                {
                    "source_file": "devoirs/4-5-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Les serveurs de noms::\n[markdown]\nLes serveurs de noms (*DNS* en anglais) : un maillon fragile de l'édifice ...\nLa **norme** qui régit le fonctionnement des serveurs de noms propose une organisation pyramidale des machines. Les machines au sommet de cette pyramide sont les **serveurs racine de DNS** (*Domain Name System*, en français : système de nom de domaine).\nÀ partir de cette ressource : \n[http://fr.wikipedia.org/wiki/Serveur_racine_du_DNS] (http://fr.wikipedia.org/wiki/Serveur_racine_du_DNS),\nfaites les recherches nécessaires pour répondre aux questions suivantes :\n- Si ces machines **s'arrêtaient**, la traduction des adresses IP en nom et vice-versa s'arrêterait. **À votre avis**, quel serait l’impact de cet arrêt ?\n- **Combien** existe-t-il de serveurs racine de DNS ?\n- **Qui** possède ces machines : des états, des organisations, des sociétés privées ?\n- **Où** se trouvent-elles majoritairement ?\n- **Que** s’est-il passé en 2002 et 2007 ?\n{}\n",
                    "title": "4.5 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                },
                {
                    "source_file": "correction/4-6-les-serveurs-de-noms-correction_correction.html",
                    "sub_src": "\n### Les serveur racines de DNS\n\nSi les serveurs racines de DNS **s'arrêtaient**, alors progressivement les millions de serveurs de noms répartis sur la planète qui en dépendent deviendraient obsolètes et la **correspondance** entre les noms des machines, que nous utilisons et les adresses IP **ne fonctionnerait plus**. En d'autres termes **internet s'arrêterait**.\n\nOr, il n'existe que **13** serveurs racines, ils sont détenus (sécurisés et entretenus) par des **états**, des sociétés **commerciales** **privées** ou des **organisations**. Les machines qui hébergent ces serveurs sont majoritairement situées sur le **sol américain** et donc soumis au **droit américain**, alors que l'ensemble de la planète en dépend.\n\nBeaucoup de gens pensent que cela constitue un problème, un bien commun universel aux mains de quelques-uns, soumis aux lois d'un seul pays, peut-on, doit-on faire confiance à des sociétés privées pour prendre les décisions qui concernent la gestion, la sécurité et le bon fonctionnement d'éléments aussi cruciaux que les serveurs racines de DNS. Certains militent pour une vision plus démocratique avec des décisions partagées.\n\nVous êtes maintenant en capacité de comprendre ces questions pour vous forger votre propre opinion.\n\nCes serveurs racines sont des points faible du système, si l'un d'entre eux devient indisponible, alors c'est un 13ème de la charge qui qui doit être réparti sur les douze autres. Vu le nombre gigantesque de requêtes effectuées en permanence, cela peut ralentir l'ensemble du réseau à l'échelle de la planète.\n\nC'est ce qui s'est passé en **2002** et en **2007**, lorsque des serveurs racines ont été la cible de **cyber attaques**.\n\n*cf* [http://fr.wikipedia.org/wiki/Serveur_racine_du_DNS#Attaque_de_2002](http://fr.wikipedia.org/wiki/Serveur_racine_du_DNS#Attaque_de_2002).\n\n",
                    "title": "4.6 Les serveurs de noms [correction]",
                    "type": "correction",
                    "videos": []
                },
                {
                    "source_file": "devoirs/4-7-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Panne générale::\n[markdown]\nDans le petit schéma ci-dessous, un nuage représente un réseau local. Les petits carrés sont des routeurs ou des ordinateurs. \n![routeurs](media/exoInternet.svg)\nSupposons que les communications dans chaque réseau local fonctionnent correctement. L'ordinateur A doit échanger des données avec l’ordinateur B. \n- Indiquer le groupe minimal de routeurs qui devraient tomber en panne pour empêcher la communication entre A et B ?\n- Dans le cas des câbles, quel ensemble minimal de câbles devraient être coupés pour empêcher la communication entre A et B ? \n- Lister tous les chemins possibles (sans boucle) qui permettent de relier A à B.\n{\n####  Si les routeurs C et D tombent en panne le réseau local de A est déconnecté et A ne peut plus communiquer avec B. \nLa même chose se produit si les routeurs H et I tombent en panne. \nSi F et I tombent en panne, alors les communications passent encore par D, E, K et H.\nLes câbles entre C-F, C-I, D-E, de la même façon isolent le réseau de A.\nA-C-I-B ; A-C-F-I-B ; A-C-F-H-B ; A-C-F-E-K-H-B ; A-D-E-K-H-B ; A-D-E-F-H-B ; A-D-E-F-I-B\n}\n",
                    "title": "4.7 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                }
            ],
            "title": "4 Comment ça marche?"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/5-1-cours_webcontent.html",
                    "sub_src": "\n  [Se connecter à Internet] ( https://player.vimeo.com/video/122104376 ){:.lien_video}\n\nExaminons les conséquences de l'organisation d'Internet lorsqu'on veut\ns'y connecter ...\n\n### Rejoindre un réseau local\nL'ordinateur, le smartphone ou la tablette qui doit accéder à Internet\ndoit d'abord rejoindre un réseau. Nous verrons un peu plus loin les\ndifférents moyens de se connecter à un réseau que ce soit par le wifi,\nun câble ou le réseau de téléphonie mobile.\n\n### Obtenir les 3 informations nécessaires\nDe plus, nous avons vu que pour communiquer avec d'autres machines,\nnotre ordinateur a besoin de trois informations importantes : le\nnuméro `IP`, l'adresse du routeur qui relie ce réseau à Internet, et\nl'adresse du serveur de noms. Ces trois informations sont fournies à\nnotre machine immédiatement après qu'elle ait rejoint le réseau. C'est\nune machine particulière dans le réseau local qui fournit ces\ninformations et donc une autorité locale qui décide de ces\nattributions. Par exemple chez vous, c'est votre box ADSL sous votre\nresponsabilité qui s'en charge. La box elle-même, qui est un\nordinateur presque comme les autres, reçoit ces 3 informations de\nvotre fournisseur d'accès à Internet (FAI) quand elle démarre. Avec la\n4G c'est une machine chez votre opérateur mobile qui est sollicitée…\n\n### Pas de garantie de confidentialité\nAutre remarque importante, le principe d'internet repose sur un envoi\nde proche en proche des messages transmis entre émetteur et\ndestinataire à travers les ordinateurs (routeurs) qui réalisent\nl'interconnexion. Dans ce mode de fonctionnement, il n'y a de garantie\nni de la confidentialité ni de l'intégrité des messages. Chaque\nordinateur participant à la transmission peut lire et modifier les\ndonnées échangées. Si l'on veut transmettre des données sensibles, il\nfaut donc mettre en œuvre des procédures spécifiques additionnelles\npour assurer l'authenticité et/ou la confidentialité des données\ntransmises. Par exemple, pour transmettre des mots de passe ou des\nnuméros de carte bleue, il est nécessaire de crypter les messages pour\nles rendre indéchiffrables par des curieux.\n\n### Filtrage et suivi possible\nUne autre conséquence du fonctionnement d'internet, est que des\nfiltres peuvent être mis en place sur des routeurs pour empêcher\ncertains messages d'être transmis. Ces filtres peuvent se limiter à\ncontrôler les adresses des destinataires pour empêcher de contacter\ncertaines machines. Ils ont par exemple été mis en œuvre dans des pays\nvoulant s'isoler ou censurer quelques services comme twitter, ou\nencore wikileaks...  Les filtres peuvent également concerner les\ncontenus des messages comme dans le cas des filtres parentaux sur les\nbox ADSL (qui incluent une fonction de routeur). Les entreprises et\norganisations emploient aussi cette possibilité pour garder les traces\ndes connexions et répondre ainsi à la contrainte légale de pouvoir\nretrouver les protagonistes d'un échange illicite.\n\n### Impossibilité d'éviter la copie\nLa dernière remarque porte sur l'emploi trompeur du mot\n/envoi/. Lorsqu'une machine *envoie* un message, elle réalise en\nréalité une copie du message sur le réseau. Libre alors à elle de\nsupprimer ou conserver la version originelle du message. C'est une\nsituation que l'on rencontre régulièrement dans le monde *numérique/\net qui rend difficile la lutte contre les copies illicites.* Mais nous\naurons l'occasion d'en reparler plus tard.\n\nMais finalement, pourquoi avoir conçu et suivi cette organisation\ncomplexe d'interconnexion de réseaux? En fait, un très grand réseau où\ntoutes les machines seraient directement reliées est impossible à\nconcevoir. Il faudrait multiplier les câbles et même dans une solution\nsans fil, à l'image d'une discussion à plusieurs personnes, au delà\nd'une certaine limite les discussions des uns couvrent inévitablement\ncelle des autres à tel point qu'on ne peut plus discuter! Les réseaux\nlocaux avec des discussions locales ne peuvent donc fonctionner que\njusqu'à une certaine taille au delà de laquelle une structuration par\ninterconnexion devient obligatoire.\n\n",
                    "title": "5.1 Cours",
                    "type": "webcontent",
                    "videos": [
                        {
                            "video_link": " https://player.vimeo.com/video/122104376 ",
                            "video_title": "Se connecter à Internet"
                        }
                    ]
                },
                {
                    "source_file": "auto-evaluation/5-2-quizz_auto-evaluation.html",
                    "sub_src": "\n::rejoindre le réseau::\n[html]<p>Lorsqu'un ordinateur rejoint un réseau, que doit-il\nobtenir pour rejoindre internet ?</p>{ \n~%33.33333%<p>Une adresseIP.</p>#<p>Oui, entre autres...</p> \n~<p>Un nom de code.</p>#<p>Et non...</p> ~<p>Une autorisation de l'État ?</p>#<p>Vraiment ?</p>\n~%33.33333%<p>L'adresse d'un serveur de noms.</p>#<p>C'est bien l'un\ndes éléments.</p> \n~%33.33333%<p>L'adresse d'un routeur.</p>#<p>Oui, mais pas seulement.</p> ~<p>L'accès à un moteur de recherche.</p>#<p>Pas du tout.</p> \n####<p>En fait, il doit obtenir 3 éléments \\: une adresse IP, l'adresse d'un serveur de noms et l'adresse d'un routeur.</p> }\n\n::le routeur::\n[html]<p>Pourquoi la machine qui assure l'interconnexion avec\nles autres réseaux d'internet (le routeur) est-elle une place de choix\npour y installer des fonctions de filtrage ?</p>{ \n=<p>Parce que toutes les informations passent par là.</p>#<p>C'est exact !</p> \n~<p>Parce que c'est la machine la plus puissante.</p>#<p>Et bien, non.</p>\n~<p>Parce qu'elle est en général bien cachée.</p>#<p>Pas du\ntout...</p> \n####<p>Parce que toutes les informations transitent par elle.</p> }\n",
                    "title": "5.2 Quizz",
                    "type": "auto-evaluation",
                    "videos": []
                },
                {
                    "source_file": "devoirs/5-3-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Utiliser les serveurs de noms::\n[markdown]\nIl existe des *outils* dans votre ordinateur pour interroger les serveurs de noms et faire donc la *conversion* entre `adresses IP` et `noms`. Ils sont intégrés par exemple dans le navigateur web et la plupart des outils qui utilisent internet. Même s’il est possible de les utiliser directement, ils sont assez techniques.\nNous vous proposons d’utiliser plutôt un **service** disponible sur internet à travers le navigateur : [http://www.monip.fr](http://www.monip.fr)\nSelon ce site ;\n  - quelle est votre adresse IP ?\n  - où vous trouvez-vous ?\nD’après ce site, où se trouvent les machines suivantes :\n  - [www.wikipedia.org](www.wikipedia.org)\n  - [www.facebook.com](www.facebook.com)\n  - [www.google.com](www.google.com)\nQuelle est l’adresse IP de la machine qui porte le nom [www.grappa.univ-lille3.fr](www.grappa.univ-lille3.fr) ?\n**Copiez** l’adresse IP que vous venez de  trouver dans la **barre d’adresse de votre navigateur.** Dans un autre onglet, **copiez** le **nom** : www.grappa.univ-lille3.fr dans la barre d’adresse.\n- Que constatez vous ?\nUne fois validé votre rendu, vous pourrez consulter la correction pour vous auto-évaluer, ...\n{}\n",
                    "title": "5.3 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                },
                {
                    "source_file": "webcontent/5-4-utiliser-les-serveurs-de-noms-correction_webcontent.html",
                    "sub_src": "\n### Votre propre IP\n\nGrâce à [http://www.monip.fr](http://www.monip.fr) vous avez trouvé votre adresse IP, elle est évidemment différente pour chacun d'entre nous.\n\nSi vous recommencez depuis une autre machine ou avec la même machine connectée différemment (wifi domicile ou wifi eduroam, connexion filaire à l'université ou eduroam université, connexion wifi ou connexion 3G/4G) vous obtiendrez à chaque fois un résultat **différent**.\n\nPour ce qui est de la **localisation**, vous avez sûrement obtenu une adresse géographiquement proche de la votre, celle-ci est en fait l'*adresse du  routeur du fournisseur d'accès* du réseau auquel vous êtes connecté.\n\nVous pouvez également constater que vos informations personnelles telles que :\n\n- le navigateur que vous utilisez,\n- la langue utilisée,\n- la taille de votre écran, ... \n\nont été **repérés** par le site www.monip.fr et vous sont renvoyés dans la liste des informations.\n\n### Wikipedia, facebook et google\n\nVous avez dû trouver que la localisation de wikipedia est aux *Pays-Bas*, près *d'Amsterdam*. C'est en effet là que se trouve la copie la plus proche.\n\nD'autres répliques de la célèbre encyclopédie existent également en *Floride* et en *Corée du  Sud*.\n\n`Facebook` est hébergé à *Kensington*, dans *l'Ohio* aux *États-Unis*, c'est là que les *données* de tous les utilisateurs sont stockées.\nAlors que `Google` se trouve à *Mountain View* en *Californie*.\n\nToutes les **lois** concernant la sécurisation de nos données et les respect de **notre vie privée** pour ces 2 sites sont donc des lois **américaines**.\n\n### www.monip.fr\net oui, ce site est une version traduite en français d'un site Allemand.\n\n### www.grappa.univ-lille3.fr\nl'adresse **IP** de l'équipe de recherche Grappa est : `194.254.132.190`\n\nSi vous copiez cette adresse dans dans la barre d’adresse de votre navigateur, vous tombez exactement sur la **même page** que si vous allez sur [www.grappa.univ-lille3.fr](www.grappa.univ-lille3.fr).\nCela ne doit pas vous surprendre si vous avez compris l'objet de cette séquence.\n\n```\n::La charte informatique de l'université::\n[markdown]\nPour utiliser les *services numériques* de l'université, vous avez signé une **charte informatique** lors de votre inscription :\nQuel paragraphe de la charte [http://www.univ-lille3.fr/portail/charte-informatique/](http://www.univ-lille3.fr/portail/charte-informatique/) met en lumière la question du suivi des informations des utilisateurs.\nSi vous vous connectez avec la **4G** depuis l’université, devez-vous respecter cette charte ? Et avec votre smartphone et une connexion wifi ?  \n{#### 1/ Quel paragraphe de la charte [http://www.univ-lille3.fr/portail/charte-informatique/](http://www.univ-lille3.fr/portail/charte-informatique/) met en lumière la question du filtrage et du suivi ?\n*Les engagements de l'Université*\n`Réglementairement, l'Université recueille et conserve les informations sur les accès à ses services numériques. L'Université peut être obligée de fournir ces informations lors d'une enquête judiciaire.`\n2/ Si vous vous connectez avec la **4G** depuis l’université, devez-vous respecter cette charte ? Et avec votre smartphone et une connexion wifi ?  \nOUI et OUI, les services numériques en particulier ceux accessibles depuis **l’ENT** sont soumis à cette charte **quel que soit le mode de connexion**. En revanche, si vous vous connectez en 4G à d’autres sites que ceux de l’université tout en étant physiquement dans les batiments de l’établissement, aucune information ne sera collectée par l’université.\n}\n```\n\n",
                    "title": "5.4 Utiliser les serveurs de noms [Correction]",
                    "type": "webcontent",
                    "videos": []
                }
            ],
            "title": "5 Que se passe-t-il quand on se connecte à Internet?"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/6-1-cours_webcontent.html",
                    "sub_src": "\n\n    [Les supports physiques](https://player.vimeo.com/video/122104443){: .lien_video }\n    \n    [Connexions nomades](https://player.vimeo.com/video/122104499){: .lien_video }\n\nInternet et plus généralement les réseaux informatiques peuvent\nutiliser plusieurs types de supports pour transporter l'information\nnumérique. On distinguera les supports physiques, les câbles qui\npeuvent être électriques ou optiques et les ondes électromagnétiques\ncomme le Wifi, le bluetooth ou les réseaux de téléphonie mobiles. Nous\nallons voir qu'une connaissance minimale de ces technologies va nous\npermettre de mieux comprendre les enjeux qu'ils cachent.\n\n### Le débit\nTout d'abord nous devons introduire la notion de débit. Si on prend\nl'image d'un robinet d'eau, on voit bien qu'un robinet avec un gros\ntuyau me permettra de remplir mon seau beaucoup plus vite qu'avec un\npetit robinet qui ne laisse passer qu'un léger filet d'eau. Le débit\ndans ce cas est une quantité d'eau par seconde.  La problématique est\nla même pour le réseau Internet. Nous avons vu précédemment que les\ninformations numériques étaient ramenées à des suites de bits (des 0\net des1). Le débit sera donc pour les réseaux en nombre de bits par\nseconde. Comme cette information circule très vite on parlera en fait\nde milliers de bits par seconde (kb/s), de millions de bits par\nseconde (Mb/s) voire de milliards de bits par seconde (Gb/s).  À titre\nindicatif, voici quelques ordres de grandeur, un document texte d'une\ndizaine de pages se code avec quelques kbits, un fichier mp3 de\nmusique de quelques minutes se compte en Mbits alors qu'un film d'une\nheure correspond à plusieurs Gbits.\n\n### Les supports et les normes relatives à leur utilisation\nNous allons dans la suite présenter les différents supports utilisés\ndans les réseaux. Ils ont connu de fortes évolutions depuis les débuts\nd'internet. Parfois cette évolution est purement matérielle comme\nl'apparition de la fibre optique, d'autres fois l'évolution consiste\nen une meilleure utilisation du support. L'utilisation du support est\ndécrite dans un ensemble de normes comme par exemple la 3G ou la 4G\nqui tous deux utilisent le support des ondes. Aussi la présentation\nsuivante s'appuie à la fois sur les deux notions de norme et de\nsupport.\n\n### Les câbles\nS'agissant des câbles on distingue les câbles électriques et les\nfibres optiques qui transportent la lumière. Ces dernières sont\névidemment beaucoup plus rapides et sont utilisées prioritairement\nquand c'est possible. C'est le cas par exemple de la plupart des\ncâbles sous-marins qui traversent les océans pour relier les\ncontinents, certains ont des débits supérieurs à 100Gb/s.  Des câbles\nélectriques spécifiques pour les réseaux informatiques peuvent\négalement être très rapides mais sur des courtes distances.  C'est en\ngénéral la solution retenue pour connecter les ordinateurs d'un réseau\nlocal dans les entreprises. C'est aussi le cas pour les ordinateurs à\nvotre disposition dans les salles informatiques de l'université.\n\nEn revanche, ce n'est pas le cas de la plupart du réseau français qui\nrelie la majorité des foyers du pays. Les lignes qu'on appelle ADSL,\nsont en fait les câbles de l'ancien réseau téléphonique qui a été\nconstruit à l'origine pour transporter la voix du téléphone et non des\ninformations numériques à très grande vitesse. Cela explique que les\nconnexions dont nous disposons à domicile sont de qualité moyenne et\nne permettent pas le très haut débit, sauf à passer par une fibre\noptique, c'est ce que proposent désormais beaucoup de fournisseurs\nd'accès dans certains quartiers.\n\nÉvidemment, le câblage de toutes les zones habitées avec de la fibre\noptique représente un enjeu social et économique considérable. Alors\nque les lignes de téléphone sont présentes sur l'ensemble du\nterritoire, seules les grandes agglomérations sont couvertes par\nl'équipement en fibres optiques. Cela représente un grand facteur\nd'inégalité...\n\n### Les ondes\nDepuis le XIXème siècle, les hommes ont réussi à s'échanger des\ninformations via les ondes électromagnétiques. La radio puis la\ntélévision ont copieusement utilisé ce principe qui utilise un système\nd'antennes émettrices et réceptrices. Nous savons transporter de la\nmême façon des informations numériques. À chaque réseau son antenne,\ncertains appareils sont équipés d'une antenne Wifi, d'une antenne\nBluetooth et pour les téléphones d'une antenne de réseau de données\nmobiles.  Ces différentes technologies sont essentiellement utilisées\npour nos connexions nomades, c'est-à-dire avec des appareils mobiles\ntels que des ordinateurs portables, des tablettes ou des\nsmartphones. Fondamentalement, elles permettent toutes la même chose,\nc'est à dire un accès complet à Internet.\n\n \n### Les connexions nomades\n\n\nOn se retrouve régulièrement à devoir choisir parmi plusieurs moyens\npour se connecter à internet avec nos appareils nomades. Les arguments\nqui entrent dans ce choix sont très variés. On pense bien entendu au\ncoût. Par exemple, l'utilisation du wifi de l'université est\ngratuite. Les accès internet par le biais d'une box sont généralement\ninclus dans un forfait illimité, en revanche le coût de l'utilisation\nd'internet à l'aide de connexions 2G/3G/4G peut rapidement exploser.\n\nUn autre élément déterminant est la disponibilité de la connexion. En\neffet, selon les endroits où l'on se trouve, le réseau mobile peut\nêtre indisponible ou de très faible qualité, inversement il n'y a pas\ntoujours un accès Wifi à notre portée. Notons que si l'on se déplace\nde plus de quelques mètres, il devient quasi-impossible de rester\nconnecté à un réseau wifi qui a une portée assez faible. Les réseaux\nde téléphonie mobiles autorisent par contre une connexion permanente\nsur des longues distances à pied ou en voiture par exemple.\n\nDepuis les années 90, le réseau de téléphonie mobile permet le\ntransfert de données numériques.\n\nMais les normes et les techniques évoluent et sont de plus en plus\nrapides. Les premières générations proposaient des débits très faibles\nqui ne permettaient pas par exemple le transfert d'images ou de\nmusique dans des temps raisonnables. Nous en sommes à la quatrième\ngénération de la technologie, la 4G offre maintenant des débits qui\ndépassent parfois ceux des connexions wifi.\n\n### La rapidité du réseau\nToutefois, la qualité du lien qui relie votre appareil électronique au\nréseau n'est pas le seul responsable du débit. Réfléchissons à ce qui\nfait que ma liaison est lente ou rapide. Tout d'abord il faut se\nrappeler que les débits indiqués par les constructeurs ou les\nopérateurs sont toujours théoriques et correspondent au maximum\npossible dans les meilleures conditions. En pratique, ces conditions\nsont rarement réunies et les débits peuvent être considérablement\nralentis en fonction de plusieurs facteurs :\n\n- le premier facteur que l'on peut citer est l'éloignement, celui-ci joue aussi bien pour les connexions par onde que pour les connexions par câble. Par exemple, les accès ADSL sont très différents selon qu'on a la chance d'habiter près d'un noeud de raccordement aux abonnés (qui contient les machines des fournisseurs d'accès) ou si on en est plus éloigné, les débits peuvent alors être 10 ou 20 fois plus rapides, … pour le même prix d'abonnement.\n- De même, si on s'éloigne au fond du jardin avec son portable, la connexion wifi à notre box va considérablement perdre en qualité, jusqu'à ne plus être accessible.\n- un autre facteur important est le nombre d'utilisateurs du réseau, quelle que soit la technologie utilisée, on peut voir les autoroutes de l'information comme de vraies autoroutes, lorsqu'il y a beaucoup de voitures le trafic est ralenti, de la même façon, si une connexion wifi par exemple est partagée par plusieurs utilisateurs, le débit sera reparti entre eux et aucun d'entre eux n'aura accès au débit maximum\n- l'encombrement du réseau est encore un autre facteur, les routeurs peuvent être vus comme les péages des autoroutes, ce sont des goulots d'étranglement qui bouchonnent lorsque beaucoup de demandes arrivent en même temps\n- enfin, il arrive que l'actualité fasse que certains sites soient sollicités au même moment par des milliers ou des millions d'utilisateurs, le site ne pouvant répondre à tout le monde en même temps, le temps de réponse pour chacun se trouve considérablement ralentie.\n\nAinsi, il est très fréquent de constater que la vitesse de\ntransmission des données varie dans le temps ; varie selon les\nendroits ou les moyens avec lesquels on se connecte à Internet ou\nencore varie selon les sites que l'on visite ou les services que l'on\ndemande. Comme nous venons de le voir, la vitesse d'une connexion\ndépend de nombreux facteurs. Difficile donc de savoir d'où vient un\nralentissement quand il intervient. Mais parfois, le simple changement\ndu mode de connexion utilisé peut faire des miracles. Soyez agiles !!!\n\n",
                    "title": "6.1 Cours",
                    "type": "webcontent",
                    "videos": [
                        {
                            "video_link": "https://player.vimeo.com/video/122104443",
                            "video_title": "Les supports physiques"
                        },
                        {
                            "video_link": "https://player.vimeo.com/video/122104499",
                            "video_title": "Connexions nomades"
                        }
                    ]
                },
                {
                    "source_file": "auto-evaluation/6-2-quizz_auto-evaluation.html",
                    "sub_src": "\n::les supports de connexion::\n[html]<p>Quels supports sont utilisés pour la transmission de\ndonnées et qui peut donc servir pour une connexion internet ?</p>\n{\n~<p>L'eau dans un tuyau.</p>#<p>Pas à notre connaissance, mais\npourquoi pas ?</p> \n~%20%<p>L'électricité dans les câbles téléphonique.</p>#<p>Oui, l'ADSL</p> \n~%20%<p>L'électricité dans les câbles spécialisés.</p>#<p>Oui, l'électricité dans les câbles des prises électriques (Voir \\:\nhttp\\://fr.wikipedia.org/wiki/Courants_porteurs_en_ligne)</p>\n~%20%<p>La lumière dans les fibres optiques.</p>#<p>Oui, aussi.</p>\n~%20%<p>Les ondes électromagnétiques dans l'air.</p>#<p>Oui, Wifi,\nbluetooth, réseau téléphonique 2G, 3G, 4G, etc.</p>\n~%20%<p>L'électricité dans les câbles des prises électriques.</p>#<p>Oui, voir \\:\nhttp\\://fr.wikipedia.org/wiki/Courants_porteurs_en_ligne</p>\n####<p>Tout, sauf l'eau, évidemment !</p> }\n\n\n::vitesse de connexion::\n[html]<p>Qu'est-ce qui joue sur la vitesse d'une connexion ?</p>\n{ \n~%25%<p>Le débit maximal admissible du lien qui me raccorde au\nréseau local.</p>#<p>Oui, c'est l'un des paramètres.</p> \n~%25%<p>Le nombre d'utilisateurs de ce lien.</p>#<p>Exact, c'est l'un des paramètres.</p> \n~%25%<p>Le nombre de messages qui passent par les\nmêmes routeurs que les miens.</p>#<p>Oui, c'est un paramètre.</p>\n~%25%<p>Le nombre de requêtes arrivant sur la machine avec qui je\ndésire échanger des messages.</p>#<p>Oui.</p> \n~<p>L'âge de l'utilisateur.</p>#<p>Sans commentaire !</p> \n####<p>Le débit maximal admissible du lien, le nombre d'utilisateurs de ce lien, le nombre de requêtes mais aussi le nombre de messages qui passent par les mêmes routeurs que les miens.</p> }\n\n\n::eduroam::\n[html]<p>Pour utiliser le wifi à Lille 3 je dois \\:</p>\n{\n=<p>Avoir un compte Lille 3 ou un compte dans une autre\nuniversité.</p>#<p>Exact !</p> \n~<p>Payer un abonnement.</p>#<p>Absolument pas, c'est gratuit.</p> ~<p>Aller en cours.</p>#<p>Aucun rapport !</p> \n~<p>Utiliser un smartphone produit en France.</p>#<p>Aucun rapport !</p> ~<p>Signer la charte graphique de Lille 3.</p>#<p>Non mais signer la charte <em><strong>informatique</strong> </em>Lille 3 est obligatoire...</p>\n####<p>Avoir un compte Lille 3 valide ou un compte dans une autre\nuniversité.</p> }\n",
                    "title": "6.2 Quizz",
                    "type": "auto-evaluation",
                    "videos": []
                },
                {
                    "source_file": "devoirs/6-3-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Wifi ou Données mobiles ?::\n[markdown]\nLes possesseurs de **tablette** ou de **smartphone** peuvent se connecter à Internet via le **Wifi** ou le **réseau téléphonique** (*données mobiles 3G/4G*). Vaut-il mieux se connecter avec l’un ou avec l’autre ?\nLa réponse dépend de trois paramètres :\n    - la **disponibilité** de ces modes de connexions (s’il n’y a pas de réseau wifi, il sera difficile de vous connectez en wifi…)\n    - le **prix** de la connexion\n    - la **rapidité** de la connexion\nImaginons plusieurs situations concrètes :\n1/  je suis chez moi avec un *smartphone*, le domicile est équipée d’une *Box adsl* qui fournit un accès *Wifi*. Ai-je intérêt à me connecter :\n        - avec le réseau de données mobiles (3G ou 4G)\n        - via le Wifi de la maison\n2/ Je suis à *l’université* et je veux me connecter avec mon *smartphone*. Ai-je intérêt à me connecter :\n        - avec le wifi de l’université (réseau eduroam)\n        - avec mon forfait 3G/4G\n3/ Je suis en *voiture* (ce n’est pas moi qui conduis) et je veux consulter mes *emails* ou faire une *recherche* sur le net avec mon *smartphone*, ai-je intérêt à me connecter :\n        - en wifi\n        - avec le réseau de données mobiles de mon opérateur téléphonique\n**Classez** ces modes de connexion du plus lent au plus rapide.\n    `3G`\n    `4G`\n    `H+`\n    `E (Edge)` \nAprès avoir **réfléchi** et effectué les **recherches** nécessaires, répondez  aux questions posées.\n",
                    "title": "6.3 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                },
                {
                    "source_file": "webcontent/6-4-wifi-ou-donnees-mobiles-correction_webcontent.html",
                    "sub_src": "\n### Wifi ou données mobiles : Comment choisir ?\n\n1/ Chez moi avec un **smartphone**, j'ai intérêt à me connecter avec le **wifi** de la **Box adsl**.\nEn effet, la connexion Wifi a déjà été payée dans le cadre de l’abonnement ADSL, la connexion du smartphone ou de la tablette n’engendre donc pas de frais supplémentaires.\nPar contre la connexion au réseau 3G/4G est décomptée du forfait qui est souvent limité.\n\n2/ **L’université** a investi dans le réseau wifi `eduroam`pour proposer ce service aux usagers, il est donc *gratuit* et n’entraîne aucun frais de connexion.\nEn revanche comme dans l’exemple précédent, les forfaits *données mobiles* des abonnements téléphoniques sont souvent limités et/ou chers.\nLe réseau Wifi de l'université s'appelle eduroam et tous les usagers peuvent s'y connecter.\n\n3/ En **voiture**, si ce n’est pas moi qui conduit, je peux me connecter à Internet en utilisant la connexion **3G/4G**.\nElle permet de rester connecté sur de grandes distances. La couverture en agglomération et dans les zones de forte densité démographique est en général assez bonne pour l'ensemble des opérateurs,\nen revanche dans les zones plus reculées, il est parfois difficile de *trouver du réseau*. Et là tous les opérateurs n'ont pas la même couverture.\n\nLa courte portée des antennes Wifi ne permet pas d'utiliser ce mode connexion lors de déplacements importants.\n\n### Le saviez-vous ? - Le relai Wifi\n\nOn trouve dans certaines villes des bus  proposant un accès Wifi.\nSi ceux-ci sont équipés d'une antenne de réception 4G, ils peuvent ensuite \"redistribuer\" la connexion en Wifi, à l'intérieur du véhicule.\n\nCela est également **possible** avec des **smartphones** récents. Sur le principe décrit ci-dessus, un smartphone peut se connecter à un réseau 3G/4G et ensuite se comporter comme une borne wifi à laquelle peuvent se connecter d'**autres périphériques**.\nCela est très pratique pour se connecter avec un ordinateur là où seules des connections 3G/4G seraient disponibles ... mais attention à la facture ! \n\n### Les normes et leurs sigles\n\n- Les modes de connexion du plus lent au plus rapide.\n\n    - E (Edge) aussi appelé 2G, lent. Ce mode de connexion permet à peine de lire ses mails. Il ne permet pas une navigation fluide sur le Web.\n    - 3G (3ème génération) permet de faire des recherches et de surfer sans trop attendre.\n    - H+, est une amélioration de la 3G. il est plus rapide que le wifi si les connexions sont optimales. Et l'accès à la musique en ligne où aux vidéos peut être envisagé.\n    - 4G, plus rapide que le wifi si les connexions sont optimales. À condition bien sûr que cette connexion soit de bonne qualité (\"plusieurs petites briques\"), l'accès à Internet est alors très fluide, et les jeux en ligne, les vidéos en streaming ou le téléchargement de gros fichiers devient possible.\n\nNotez bien que pour pouvoir bénéficier d'une connexion 4G, il faut :\n\n - que cette connexion soit disponible là où vous vous trouvez,\n - que votre smartphone soit équipé d'une antenne 4G, c'est loin d'être le cas sur tous les modèles y compris sur des appareils récents.\n\n",
                    "title": "6.4 Wifi ou données mobiles ? - [Correction]",
                    "type": "webcontent",
                    "videos": []
                },
                {
                    "source_file": "devoirs/6-5-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Les débits::\n[markdown]\n**Pouvoir évaluer les ordres de grandeur**\nLe **débit** est une des mesures caractérisant la **qualité** d’une connexion. Il mesure la quantité d’information que l’on peut transmettre à chaque seconde. Pour mesurer le débit d’une connexion, il faut d’abord savoir ce qu’est un bit. Un bit est l’élément d'information de base manipulé par un ordinateur qui ne peut prendre comme valeur que 0 ou 1. Toutes les données dans un ordinateur sont codées en une suite de bits. Transmettre des données numérisées c’est donc transmettre des bits.\nGénéralement le débit est mesuré en bit par seconde `bit/s` ou ses variantes : (kilo-bit par seconde `kbit/s`, mille bits par seconde,  mega-bit par second `Mbit/s`, un million de bits par seconde, giga-bit par seconde `Gbit/s`, un milliard de bits par seconde)\nDu débit, dépend notamment le *temps* nécessaire pour télécharger un morceau de musique ou la qualité d’une vidéo lue en continu.\nLe nombre de bits que l'on peut stocker sur un DVD Blu-ray double couche est 50 gigaoctets (Go), soit 400 gigabits, car un octet est une séquence de 8 bits. Calculer le temps de transmission d'un DVD Blu-ray double couche complet dans les cas suivants:\n    - l'ADSL à 10Mb/s\n    - La fibre à 1Gb/s\n    - Le wifi à 50Mb/s\n    - La 3G à 384 Kb/s\n    - La 4G à 150Mb/s\n{\n####Un DVD Blu-ray double couche a une capacité de 50 gigaoctets (Go), soit 400 gigabits 400 gigabits (Gb), soit encore 400 000 megabits (Mb). Un octet étant une séquence de 8 bits, la capacité s'écrit également 400 000 000 kilobits (Kb).\nPour obtenir le temps, il faut bien-sûr diviser cette quantité, dans la bonne unité par le débit considéré.\nOn obtient:\n    - ADSL à 10Mb/s : 400 000/10 = 40 000 secondes soit un peu plus de 11 heures\n    - Fibre à 1 Gb/s : 400/1 = 400 secondes un peu plus de 6 minutes\n    - Wifi à 50 Mb/s : un peu plus de 2 heures\n    - 3G à 384 Kb/s : 400 000 000/384 soit 1041666 secondes un peu plus de 12 jours\n    - 4G à 150 Mb/s : 400 000 / 150 un peu plus de 44 minutes.\nIl est donc très rare qu'on échange des vidéos sous le format de ces Blu-ray sur internet et c'est en général des vidéos de moindre qualité qui sont disponibles pour le téléchargement ou la lecture en flux (streaming).\n}\n",
                    "title": "6.5 Exercice d'approfondissement",
                    "type": "devoirs",
                    "videos": []
                },
                {
                    "source_file": "webcontent/6-6-le-saviez-vous_webcontent.html",
                    "sub_src": "\n### l'ADSL et ses débits\n#### Ça va plus vite dans un sens que dans l'autre\n\nLes lignes ADSL que nous utilisons souvent à domicile, ne sont pas “symétriques”, c’est d’ailleurs ce que signifie leur nom,\n\n*extrait de wikipedia* \n\n[http://fr.wikipedia.org/wiki/Asymmetric_Digital_Subscriber_Line](http://fr.wikipedia.org/wiki/Asymmetric_Digital_Subscriber_Line)  :\n\n`Le sigle anglais ADSL signifie Asymmetric Digital Subscriber Line, qui se traduit fonctionnellement par « [liaison] numérique [à débit] asymétrique [sur] ligne d'abonné »1. La terminologie française officielle recommande l'expression « liaison numérique asymétrique »2, mais le sigle « ADSL » reste le plus largement utilisé dans le langage courant.`\n\nComme son nom l'indique, la technologie ADSL fournit un débit asymétrique. Le flux de données est plus important dans un sens de transmission que dans l'autre. Le débit de données montant d'une communication ADSL (upload) est plus faible que le débit descendant (download), dans un rapport qui varie généralement entre 5 et 20.\n\nEn France, le lancement commercial de l'ADSL a été effectué par France Telecom Interactive en 1999 “\n\nEn pratique, nous utilisons surtout Internet à domicile pour “récupérer” des données plutôt que pour en envoyer.\nLe sens du “téléchargement” (download) est donc privilégié par rapport à “l’upload.” Le débit est plus important lorsqu'on \"reçoit\" des données que quand on en envoie.\n\nEn conséquence, il ne faut pas être étonné si l’envoi d’un mail avec une grosse pièce jointe est très long tandis que la réception d’un mail identique sera beaucoup plus rapide. Cela peut aisément s'expérimenter en s’envoyant un mail avec une pièce jointe de quelques MO.\n\n",
                    "title": "6.6 Le saviez-vous ? ",
                    "type": "webcontent",
                    "videos": []
                }
            ],
            "title": "6 Les supports physiques de transmission de l'information"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/7-1-cours_webcontent.html",
                    "sub_src": "\n[Internet : Qui décide ?](https://player.vimeo.com/video/122104174){: .lien_video }\n\n### Les normes et instituts de normes\nPouvons-nous communiquer si nous ne comprenons pas la même langue?\nNon, sauf bien sûr si nous avons la chance d'avoir un interprète et\ndans ce dernier cas la communication n'est pas aussi simple. La même\nsituation se retrouve dans les réseaux informatiques.\n\nPour faciliter les communications entre les machines, des normes ont\nété établies. L'avantage de la norme si elle est bien documentée,\npublique et libre d'accès est que chacun, constructeur ou éditeur de\nlogiciel, peut la réaliser dans ses produits.\n\nC'est le rôle des instituts de normes, comme l'ISO qui regroupe la\nplupart des pays du monde, et de l'AFNOR en France, d'éditer et\ndiffuser ces normes.\n\nDe très nombreuses normes entrent en jeu dans le fonctionnement\nd'Internet et des réseaux informatiques. C'est le cas de du protocole\nde l'internet dans lequel on retrouve la définition des adresses `IP`\ndont nous avons parlé. C'est aussi le cas des protocoles et langages\ndu Web dont nous parlerons bientôt. L'existence de ces normes est une\nraison majeure du succès planétaire du web. Sans elles, le web serait\nsans doute un archipel d'îles isolées plutôt qu'une toile.\n\n### Pressions\nMais imaginez maintenant un standard industriel breveté et protégé par\nune unique société à la place d'une norme mondiale libre et\nouverte. Cette société aurait un pouvoir considérable. Évidemment, les\nenjeux économiques du numérique étant si importants que de nombreuses\ntentations ont été observées pour contourner les normes ou imposer son\nstandard. C'est un peu le rôle de chacun de veiller à éviter ces\ndérives et une éducation numérique contribue à donner des armes aux\ncitoyens pour comprendre ces enjeux et agir en conséquence.\n\nÀ voir \"Une contre-histoire d'internet\", de Sylvain Bergère. Retour\nsur les mouvements de défense des libertés sur internet, apparus en\nréaction à la régulation croissante du web :\nhttps://www.youtube.com/watch?v=tztUb=IP=b5oQ&feature=youtu.be\n\n### Les structures politiques\nAu niveau d'internet, en plus des normes qui régissent les moyens de\ncommuniquer les informations à travers le réseau, il faut également\ncontrôler l'organisation du réseau. Nous pouvons illustrer cela en\nétudiant la structure politique mise en œuvre pour attribuer les\nadresses `IP` et les noms.\n\nNous avons expliqué que lorsqu'une machine rejoint internet, elle\nrejoint d'abord un réseau local et l'autorité possédant ce réseau\nlocal lui attribue un numéro `IP`. Ce numéro est choisi dans un\nensemble de numéros dont un organisme de tutelle a confié la\nresponsabilité. Cet organisme de tutelle a lui-même un ensemble de\nnuméros à sa disposition et ainsi de suite. Au sommet de cette\nhiérarchie de responsabilités, se trouve l'ICANN. L'ICANN délègue\nensuite à 5 structures correspondant à 5 grandes régions du\nmonde. Ceux-ci délèguent aux organisations locales dans lesquelles on\nretrouve en autres les sociétés qui vous louent les BOX ADSL. Il y en\na plusieurs centaines en France.\n\nPour les noms de l'internet l'organisation politique est très\nsimilaire, hiérarchique également avec au sommet encore une fois\nl'ICANN. On retrouve cette hiérarchie dans la façon avec laquelle sont\nconstruit les noms. Par exemple la machine appelée\n`www.univ-lille3.fr` désigne une machine appelée `www` dans un domaine\nde nommage plus grand, `univ-lille3.fr`, qui comprend également\n`live3.univ-lille3.fr` ou `formations.univ-lille3.fr` ... Le domaine\n`univ-lille3.fr` est lui même dans un domaine plus grand encore le\n`.fr`.\n\nL'université gère les noms dans son domaine alors que l'AFNIC gère\ntous les noms en `.fr`.\n\n### À qui appartient internet ?\nLa structure politique que nous venons de décrire a son miroir\ntechnologique. En effet, l'ensemble machines qui assurent le service\nd'associer noms et adresses forme également une hiérarchie. Comme nous\nl'avons vu dans une activité précédente, au sommet de cette hiérarchie\nse trouvent seulement 13 machines. Si elles s'arrêtaient, internet\nserait inutilisable. Des cyberattaques ont même eu lieu plusieurs fois\npour tenter de les mettre en panne... Ces 13 ordinateurs sont presque\ntous aux États-Unis et appartiennent souvent à des sociétés\nprivées. On est en droit de se demander une fois de plus à qui donc\nappartient internet ?\n\nL'organisation politique des noms et des `IP` est elle aussi souvent\nremise en cause car les institutions importantes comme l'ICANN sont de\ndroit américain.\n\nLa plupart des câbles qui sillonnent la planète appartiennent\négalement à des sociétés privées. Aux États-Unis, Comcast, le plus\ngros opérateur est en passe de racheter le second (Time Warner Cable).\n\nEt les routeurs dont nous avons parlé sont très souvent fabriqués par\nl'entreprise Cisco, une entreprise américaine....\n\nÀ tout niveau, des situations de monopole peuvent apparaître et avec\nelles, le risque de perdre des libertés pour l'usager : liberté de\nchoix, liberté de communiquer.\n\n### Une société de surveillance généralisée\nNous avons vu que les informations que nous communiquons passent par\ndes routeurs. Ceux-ci peuvent assurer des fonctions de filtrage des\ncontenus et de journalisation (ou mémorisation de l'historique des\néchanges). En France, les fournisseurs d'accès à internet, dont\nl'université, sont tenus de pouvoir répondre à des enquêtes provenant\nde juges : qui a consulté ce site tel jour à telle heure ? Donc, à\nl'université, au travail ou chez vous, une mémorisation est faite.\n\nToutefois mémorisation ne signifie pas systématiquement surveillance\nou espionnage. La CNIL par exemple, et bien sûr la justice, doivent\nprotéger les citoyens contre ces abus. Mais leurs moyens ne sont pas\ntoujours à la hauteur de leurs missions... Et les affaires comme PRISM\nont montré que cette question dépasse largement le cadre Français.\n\n",
                    "title": "7.1 Cours",
                    "type": "webcontent",
                    "videos": [
                        {
                            "video_link": "https://player.vimeo.com/video/122104174",
                            "video_title": "Internet : Qui décide ?"
                        }
                    ]
                },
                {
                    "source_file": "auto-evaluation/7-2-quizz_auto-evaluation.html",
                    "sub_src": "\n// question: 165024 name: 1.8.1 (Q1/3) ::1.8.1\n::(Q1/3)::[html]<p>Comment s'appelle l'organisme qui gère les noms de\ndomaine et les adresses IP ?</p>{ =<p>Au niveau mondial \\:</p> ->\nICANN =<p>Au niveau de la France \\:</p> -> AFNIC = -> CNIL\n####<p>ICANN pour le niveau mondial et l'AFNIC pour la France.</p> }\n\n// question: 165028 name: 1.8.1 (Q2/3)_NEW ::1.8.1\n::(Q2/3)_NEW::[html]<p>L'ISO est l'organisation internationale de\nnormalisation.</p>{TRUE#<p>Il faut revoir la vidéo...</p>#<p>Exact\n!</p>####<p>Vrai, l'ISO est bien l'organisation internationale de\nnormalisation (International Organization for Standardization).<br\n/><br /></p>}\n\n// question: 165029 name: 1.8.1 (Q3/3) Noms pleinement qualifiés_NEW\n::(Q3/3) Noms pleinement qualifiés_NEW::[html]<p>Comment s'écrit\nle nom d'une machine C, située dans un domaine B, lui même dans un\ndomaine général A ?</p>{ ~<p>ABC</p> ~<p>ACB</p> =<p>CBA</p>\n~<p>CAB</p> ~<p>BAC</p> ~<p>BCA</p> ####<p>C.B.A \\: le nom de la\nmachine, puis le nom du domaine de 1er niveau et enfin le nom du\ndomaine général.</p> }\n",
                    "title": "7.2 Quizz",
                    "type": "auto-evaluation",
                    "videos": []
                },
                {
                    "source_file": "webcontent/7-3-le-saviez-vous_webcontent.html",
                    "sub_src": "\n### Comment la Chine censure Internet ?\n\nLe terme **DNS** (*déjà vu dans ce module*) désigne le système (et les machines) qui assurent le service de nommage dans internet, c'est-à-dire l'association entre les *noms de domaine* et adresses *IP*. Les machines qui assurent la distribution de ces informations sont les fameux *serveurs de noms* que nous avons vu précédemment.\n\nLe contrôle du DNS est un enjeu politique fort. Wikipedia relate un exemple de tension qui a eu lieu en 2006 :\n\n*Le système DNS alternatif chinois lancé le 1er septembre 2006 utilise son propre DNS racine et ne passe plus par les serveurs de noms de domaines de l'ICANN. Par exemple, les domaines .com.cn et .net.cn apparaissent aux résidents chinois sous la forme .com et .net. ; cela créé alors dans la pratique deux réseaux Internet distincts : l'un est chinois, l'autre est mondial. Quant à un site chinois, il ne pourra être accessible du reste du monde que s'il en fait la demande auprès des autorités chinoises, qui publieront alors son nom dans les DNS officiels chinois qui eux sont reliés au DNS racine de l'ICANN.*\n\nÀ première vue, la mise en place d'un DNS chinois peut prêter à sourire, l'effet le plus directement visible est que certains sites de nom de domaine nom.net.cn sont visibles (sur le réseau internet chinois) avec comme nom nom.net ; l'impact est uniquement visuel et psychologique.\n\nEn faisant appel à vos connaissances du fonctionnement d'internet, vous pouvez tout de même remarquer deux conséquences induites par cette action des autorités chinoises : \n\n- il y a dorénavant deux internet. Ou, en d'autres termes, un même nom de domaine ne correspond plus au même service suivant le lieu où l'on se trouve : google.com pourrait correspondre dans une partie du monde à la firme américaine bien connue et en Chine à une autre organisation.\n- La deuxième conséquence est fortement liée à la première. Auparavant, c'est l'organisation *VeriSign* qui contrôlait tous noms de domaine en .com et en .net. À présent certains noms de domaines de cette forme ne demandent plus d'autorisation et ne paient plus de droits à *VeriSign*. C'est donc une perte de pouvoir et une perte de revenus pour VeriSign.\n\nUne petite remarque pour finir. Rappelez-vous que le DNS sert *uniquement* à traduire un nom en adresse IP. Si vous connaissez directement l'adresse IP d'une machine qui vous intéresse, bloquer le DNS ne vous empêchera pas d'y accéder. Pour vous interdire tout accès à cette machine, il faut filtrer vos messages sur un certain nombre de routeurs permettant d'y accéder. L'autorité de **contrôle des routeurs** est donc tout aussi importante que l'autorité de **contrôle des serveurs DNS**.\n\n",
                    "title": "7.3 Le saviez-vous ? ",
                    "type": "webcontent",
                    "videos": []
                },
                {
                    "source_file": "auto-evaluation/7-4-quizz_auto-evaluation.html",
                    "sub_src": "\n::L’ICANN et la CNIL::\n[markdown]\nInternet n'est pas un monde totalement libre et sans loi comme on pourrait être tenté de le croire. De grands acteurs internationaux et nationaux participent de la régulation d'internet. Nous vous proposons ici d'en découvrir deux.\nEn utilisant les ressources suivantes (et d’autres) :\n    - [http://fr.wikipedia.org/wiki/Domain_Name_System](http://fr.wikipedia.org/wiki/Domain_Name_System)\n    - [http://fr.wikipedia.org/wiki/Internet_Corporation_for_Assigned_Names_and_Numbers](http://fr.wikipedia.org/wiki/Internet_Corporation_for_Assigned_Names_and_Numbers)\n    - [http://www.cnil.fr/](http://www.cnil.fr/)\n    - [http://www.cnil.fr/fileadmin/documents/La_CNIL/publications/CNIL_RA2012_web.pdf](http://www.cnil.fr/fileadmin/documents/La_CNIL/publications/CNIL_RA2012_web.pdf)\ncherchez les réponses aux questions suivantes :\n**domaines de premier niveau**\n        - Qu'est un domaine de premier niveau ?\n        - Donnez quelques exemples.\n        - Qui les gère ?\n        - Qu'en pensez-vous ?\n**la CNIL**\n        - Quel est le rôle de la CNIL ?\n        - Avec combien d'employés remplit-elle ses missions ?\n        - Qu'en pensez-vous ?\n{\n####**Domaines de premier niveau**\nLes domaines de premier niveau sont les plus élevés dans la hiérarchie des noms de domaines. Ce sont notamment les domaines identifiants un pays ( `.fr, .de, .uk`...) ou les domaines `.org` pour les organisations et `.com` pour les sites à caractère commercial. Chacun de ces domaines est géré par une organisation propre, mais c'est un organisme unique, *l'ICANN*, qui délègue cette gestion aux autres organismes.\n**La CNIL**\nLa CNIL (*Commission Nationale de l'Informatique et des Libertés*) est l'instance française chargée de veiller au respect des libertés et de la vie privée sur internet. À ce titre, elle régule notamment l'usage des données personnelles et traces que tout un chacun laisse lorsqu'il utilise internet.\nAu 20 juillet 2013, la CNIL était composée de 17 membres et 174 agents. \n}\n\n",
                    "title": "7.4 Quizz",
                    "type": "auto-evaluation",
                    "videos": []
                }
            ],
            "title": "7 Société : qui décide sur Internet?"
        }
    ]
}