{
    "directories_to_ims": [
        "auto-evaluation",
        "devoirs",
        "webcontent",
        "videos",
        "media"
    ],
    "lom_metadata": {
        "category": "Divers",
        "language": "en",
        "title": ""
    },
    "sections": [
        {
            "subsections": [
                {
                    "source_file": "webcontent/1-1-cours_webcontent.html",
                    "sub_src": "\n\n[Informatique et numérique](https://player.vimeo.com/video/122104210){: .lien_video }\n\nÀ l'origine, les ordinateurs étaient réservés aux informaticiens, ou\nplutôt comme cette discipline naissait à peine, aux mathématiciens et\nélectroniciens qui les créaient. En anglais un ordinateur se nomme\n*computer* , dont la traduction exacte est *calculateur*.\n\nFondamentalement les ordinateurs ne font que des calculs, ils ne\nsavent pas manipuler autre chose que des nombres, qui plus est des\nnombres représentés sous forme binaire c'est-à-dire avec des 0 et\ndes 1. En effet, comme toutes les machines électriques la seule\ninformation qu'ils *comprennent* est de la forme, *y'a du courant* ou\n*y'a pas de courant*.\n\nOr, aujourd'hui, nous utilisons tous des ordinateurs tous les jours,\nnon pas pour faire des calculs mais pour tout un tas d'activités\ndiverses et variées qu'elles soient professionnelles, liées à nos\nloisirs ou à notre vie quotidienne. Et pourtant, ces ordinateurs ne\nsont toujours que des machines qui font des calculs. Il a donc fallu\ntrouver des techniques pour traduire/coder le texte, le son, les\nimages avec des nombres. C'est ce qu'on appelle la numérisation. On\ndit souvent que notre monde est analogique (ou continu) et que le\nmonde des machines est numérique (ou digital). Les scanners, appareils\nphoto numériques, enregistreurs mp3 par exemple sont des dispositifs\nqui permettent de passer du monde analogique des hommes au monde\nnumérique des machines, c'est-à-dire de numériser les informations\nsous forme de nombres que les ordinateurs vont pouvoir manipuler.\n\nNous vivons dans un monde où le numérique a pris beaucoup de place :\ninternet, la radio, la télévision, la téléphonie, la photographie et\nbien d'autres choses que nous ne soupçonnons pas sont entièrement\nnumériques et donc manipulables par des ordinateurs au sens large, par\nexemple, des tablettes, des smartphones, les box adsl … en fait toutes\nles machines qui fonctionnent avec des processeurs, (nous reviendrons\nsur ce terme).\n\nCela représente des enjeux de société très importants. le numérique a\nouvert des possibilités gigantesques en terme de gain de temps, de\nfacilité de traitement, de nouvelles fonctionnalités, d'accès aux\ninformations, aux archives etc. mais en même temps de nouvelles\nquestions sont apparues : où sont stockées les données, qui y a accès,\nsont-elles en sécurité, sommes-nous dépendants de machines, de\nlogiciels, de sociétés commerciales.\n\nPour que ces questions ne restent pas dans les mains des\ninformaticiens, il est nécessaire que chacun fasse l'effort de\ncomprendre les bases, les fondements de ces technologies qui nous\nentourent. Le citoyen du XXIème siècle a besoin d'une véritable\nculture numérique qui ne se limite pas à l'utilisation de FaceBook ou\nd'un traitement de texte. C'est ce que nous allons développer dans ces\ncours...\n\n",
                    "title": "1.1 Cours",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/1-2-quizz_auto-evaluation.html",
                    "sub_src": "\n\n::Pourquoi représenter avec des nombres ?::\n[html]<p>Pourquoi faut-il représenter les textes, images, son,\netc.  par des nombres dans un ordinateur ?</p>\n{\n ~<p>C'est un choix industriel.</p>#<p>Non, les industriels n'avaient pas le choix.</p>\n~<p>Les ordinateurs ont été inventés par des\nmathématiciens.</p>#<p>Non, les mathématiciens savent manipuler\nautre-chose que des nombres, et les ordinateurs sont le fruit de\nl'interaction entre de nombreuses sciences.</p> \n=<p>Tout ordinateur\nest fondamentalement une machine qui calcule avec des\nnombres.</p>#<p>Oui, comme un ordinateur ne manipule que des nombres,\ntout doit être représenté sous forme de nombres pour qu'un ordinateur\npuisse le manipuler.</p> \n####<p>Un ordinateur ne manipule que des\nnombres, tout doit donc être représenté sous forme de nombres pour\nqu'il puisse le manipuler.</p> }\n\n::Numérisation)::\n[html]<p>Que signifie \"<em>numérisation</em>\" ?</p>{\n=<p>L'opération qui consiste à représenter sous forme de nombres une\ninformation quelle qu'elle soit.</p>#<p>Oui !</p> ~<p>L'opération qui\nconsiste à citer tous les nombres (1, 2, 3, 4, ….).</p>#<p>Non, citer\ntous les nombres c'est compter...</p> ####<p>La numérisation est\nl'opération qui consiste à représenter sous forme de nombres une\ninformation, quelle qu'elle soit.</p> }\n\n::Où sont les processeurs ?::\n[html]<p>Parmi ces objets, quels sont ceux équipés de\nprocesseur(s) \\:</p>{ ~%16.66667%<p>tablettes</p>\n~%16.66667%<p>smartphones</p> ~%16.66667%<p>box ADSL</p>\n~%16.66667%<p>lecteur mp3</p> ~%16.66667%<p>ordinateur</p>\n~%16.66667%<p>calculatrice</p> ~<p>aucun</p>#<p>Tous !</p> ####<p>Tous\nces objets sont équipés de micro-processeurs !</p> }\n",
                    "title": "1.2 Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "devoirs/1-3-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Le numérique dans tous les domaines:: \nQuels étudiants sont concernés par\nle numérique ?\nLe numérique concerne évidemment les étudiants en informatique et plus\ngénéralement les étudiants des filières scientifiques.  Mais vous qui\nêtes inscrit dans une université de sciences humaines et sociales,\nêtes-vous concerné ?\nChoisissez au moins 3 des domaines suivants et faites des recherches\npour voir en quoi ils sont impactés par le numérique.\n    dans les médias, dans la santé, en histoire, en sociologie, en\n    linguistique, en art et culture, dans l’enseignement, en\n    archéologie.\n\nFaites une synthèse en quelques lignes de vos recherches en précisant\nles domaines auxquels vous vous êtes intéressés. Indiquez les liens\ndes sites sur lesquels vous avez trouvé ces informations.\n\nLa liste est non exhaustive et vous pouvez vous intéresser à d'autres\ndomaines...\n",
                    "title": "1.3 Exercice d'approfondissement",
                    "type": "devoirs"
                },
                {
                    "source_file": "correction/1-4-le-numerique-concerne-tout-le-monde-correction_correction.html",
                    "sub_src": "\n\nCes recherches ont dû vous convaincre, si c'était nécessaire, que le numérique **n’est pas réservé** aux informaticiens, il concerne tout le monde, toutes les disciplines.\nS'agissant plus particulièrement des **sciences humaines**, la prise en compte du numérique a fait évoluer les champs disciplinaires pour faire apparaître ce qu'on appelle les **humanités numériques** (/digital humanities/ en anglais). \n\nVoici quelques exemples que nous vous proposons :\n\n* Dans les **médias** : nouveau sous-métier de journalisme : les **data-journalistes**\n * [data-visualisation](http://www.lemonde.fr/data-visualisation/)\n * [journalisme de données](http://fr.wikipedia.org/wiki/Journalisme_de_données)\n* Dans la **santé** : (imagerie, dossier numérique du patient, ...)\n  * [simulation](https://interstices.info/jcms/c_21525/simulation-de-loperation-de-la-cataracte)\n* En **histoire, sociologie, linguistique** : *fouille de données*\n   * [fouille de données](http://www.youtube.com/watch?feature=player_embedded&v=tp4y-_VoXdA)\n* En **art et culture** :\n\t* [exple L3](http://)\n* Dans l’**enseignement** : (outils numérique d’accompagnement scolaire, MOOC,...)\n   * [FUN](https://www.france-universite-numerique-mooc.fr/cours/)  \n* En fouille archéologique :  une réalisation prestigieuse réalisée à Lille3 : \n * [vase qui parle](http://)\n\nN’hésitez pas à proposer d’autres exemples dans le forum de discussion.\n\n",
                    "title": "1.4 Le numérique concerne tout le monde [correction]",
                    "type": "correction"
                },
                {
                    "source_file": "devoirs/1-5-exercice-dapprofondissement_devoirs.html",
                    "sub_src": "\n::Le numérique au quotidien::\nDu numérique partout autour de nous, tous les jours ...\nLes microprocesseurs, les ordinateurs ont envahi notre quotidien. Pour chacun des domaines suivants, cherchez des exemples où le numérique a permis des évolutions notables :\n    - Domotique\n    - Transports\n    - Vêtements\n    - Médical / paramédical\nAprès avoir effectué vos recherches, copier dans la fenêtre de rendu 1 lien pour au moins 3 des 4 thèmes proposés (un lien par thème).\n",
                    "title": "1.5 Exercice d'approfondissement",
                    "type": "devoirs"
                },
                {
                    "source_file": "correction/1-6-le-numerique-au-quotidien-correction_correction.html",
                    "sub_src": "\nQuelques exemples que nous vous proposons au cas où vous n'auriez rien trouvé, ...\n\nLa **domotique** est un domaine en pleine expansion qui vise à équiper numériquement notre maison :\n\n- [nest](https://nest.com/fr/)\n- [domotique](http://fr.wikipedia.org/wiki/Domotique)\n\nPour les **transports**, on peut s'intéresser aux voitures, les ordinateurs de bord sont depuis longtemps présents dans les autos, de plus en plus ils sont responsables de notre sécurité :\n\n- [electrostabilisateur]( http://fr.wikipedia.org/wiki/electrostabilisateur_programmé)\n- [ordinateur de bord](http://fr.wikipedia.org/wiki/Ordinateur_de_bord)\n\nLes **chaussures** : gadget ou réelle innovation ? Ce genre d’objet est de plus en plus présents dans nos vies :\n\n - [chaussures](http://www.linternaute.com/science/technologie/deja-demain/07/chaussure-intelligente/chaussure-intelligente.shtml)\n\nLes **lentilles pour la vue** ?\n\n - [lentilles](http://www.zdnet.fr/actualites/google-apres-les-lunettes-connectees-les-lentilles-pour-le-diabete-39797148.htm)\n\n ```activité-avancée\n::Le numérique dans la société::\n[markdown]\nLe numérique, un enjeu pour les **citoyens du XXIème siècle** ...\nLe numérique nous concerne tous en tant que citoyen. Il permet de nouvelles choses en automatisant des procédures et en donnant accès à des données jusqu'ici inexploitables. Mais numérique n'est évidemment pas systématiquement synonyme de progrès. Il faut toujours réfléchir aux **finalités** des applications développées. Nous vous invitons à vous **documenter** et à réfléchir aux questions suivantes :\n - Dans la **gestion de l‘énergie**: qu’est-ce que la **troisième révolution industrielle** et pourquoi le numérique y contribue-t-il ?\n- En **politique et média** : Qu’est-ce que la **vérification par les faits** (*fact-checking* en anglais) ? En quoi le numérique l’a rendu possible / facile ?\n- En **citoyenneté** : Que signifie **vote électronique** et en quoi cela pose-t-il des questions essentielles ? Trouver au moins un *avantage* et un *inconvénient*.\nAprès avoir fait vos recherches, répondez aux questions posées en **quelques lignes** et en indiquant les **liens** où vous avez trouvé ces informations.\n{####[markdown]\nVoici quelques liens que nous vous proposons mais que vous avez sûrement trouvés par vous-même :\n - À propos de la troisième révolution industrielle :\n  - [3eme revolution industrielle](http://fr.wikipedia.org/wiki/Troisième_révolution_industrielle)\n  - [pasdecalais](http://www.latroisiemerevolutionindustrielleennordpasdecalais.fr)\n - En **politique et média** : Qu’est-ce que la vérification par les faits (fact-checking en anglais) ? En quoi le numérique l’a rendu possible / facile ?\n  - [vérification par les faits](http://fr.wikipedia.org/wiki/Vérification_par_les_faits)   \n - En **citoyenneté** : Que signifie vote électronique et en quoi cela pose-t-il des questions essentielles ? Trouver au moins un avantage et un inconvénient.     \n  - [arguments] http://fr.wikipedia.org/wiki/Vote_électronique#Arguments_en_faveur)\n}\n ```\n\n",
                    "title": "1.6 le numérique au quotidien [correction]",
                    "type": "correction"
                }
            ],
            "title": "Informatique et numérique"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/2-1-cours_webcontent.html",
                    "sub_src": "\n\n  [Historique](https://player.vimeo.com/video/122104231){: .lien_video }\n\n\nLes premiers ordinateurs ont été conçus et réalisés vers la fin de la\nseconde guerre mondiale. Il était déjà possible de leur faire réaliser\ndes calculs complexes inaccessibles à la main. Ils sont alors capables\nde manipuler des informations représentées sous une forme\nnumérique. Grâce à la numérisation de textes, d'images, de sons etc,\nles ordinateurs sont devenus des machines de traitement automatique de\nl'information. En français, le mot ordinateur s'est imposé en 1956.\n\nLes premières machines sont réalisées avec des composants\nrudimentaires comme des relais électriques et des lampes à\nvide. Ceux-ci seront par la suite remplacés par des transistors. Elles\nsont très volumineuses et lourdes, consomment énormément d'énergie.\n\nMais surtout, leur utilisation est complexe car il est nécessaire\nd'écrire les programmes qu'elles exécutent dans un langage très\ntechnique propre à chacune d'elles : un langage machine. De ce fait,\nleur diffusion et leur commercialisation sont très limitées. Deux\ninventions majeures vont lever ces difficultés : les langages\ninformatiques et la miniaturisation. C'est à la fin des années 50 que\nles premiers langages informatiques de programmation apparaissent. Ce\nsont des langages artificiels, c'est-à-dire inventés par l'homme,\nfacilement lisibles et intelligibles.\n\nUn programme spécifique appelé *compilateur* ou *interprète* se charge\nde traduire un texte écrit dans ce langage de programmation en langage\nmachine. Les conséquences sont importantes : la programmation devient\naccessible à un plus grand nombre d'individus, et l'écriture d'un\nprogramme n'est plus spécifique à une machine. C'est le début du\nmétier de programmeur.\n\nLe changement d'ordinateur pour une autre version plus rapide ou plus\npuissante est facilité et moins coûteux car les programmes ne doivent\npas être réécrits.\n\nLa deuxième évolution majeure, la miniaturisation, se déroule au début\ndes années 70. Elle est réalisée par l'intégration des transistors et\nde tous les composants électroniques réalisant les calculs dans un\nordinateur, dans un seul petit boîtier appelé microprocesseur. C'est\nIntel, entreprise fondée entre autres par Gordon Moore qui réalise\ncette performance technologique. Aujourd'hui des boîtiers de quelques\nmillimètres peuvent contenir plusieurs milliards de transistors. La\nminiaturisation permet l'augmentation des performances et la baisse de\nla consommation d'énergie.\n\nGordon Moore est également connu pour avoir énoncé une prédiction sur\nce processus de miniaturisation. *Le nombre de transistors intégrés\ndans les microprocesseurs doublera tous les 2 ans*. Cette affirmation\nconnue sous *la loi de Moore* se vérifie depuis plus de 40 ans. On\nl'interprète dans le grand public comme *la puissance des ordinateurs\ndouble tous les 2 ans*.\n\nCe qui signifie en pratique que lorsque vous achetez un ordinateur,\nmoins de 2 ans après vous pouvez trouver un autre modèle 2 fois plus\npuissant au même prix.\n\n",
                    "title": "2.1 Cours",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/2-2-quizz_auto-evaluation.html",
                    "sub_src": "\n// question: 164998 name: 1.2.1 Quizz (Q1/2) ::1.2.1 Quizz\n(Q1/2)::[html]<p>De quand datent les premiers ordinateurs ?</p>{\n~<p>Au XVIIe siècle</p> ~<p>Juste avant la Révolution française</p>\n=<p>A la fin de la seconde guerre mondiale</p> ~<p>Dans les années\n1980</p> ~<p>Avant la première guerre mondiale</p> ####<p>C'est à la\nfin de la seconde guerre mondiale que les premiers ordinateurs sont\napparus.</p> }\n\n\n// question: 164999 name: 1.2.1 Quizz (Q2/2) ::1.2.1 Quizz\n(Q2/2)::[html]<p>Que dit la loi de Moore ?</p>{ ~<p>Que s'il existe au\nmoins deux façons de faire quelque chose et qu'au moins l'une de ces\nfaçons peut entraîner une catastrophe, il se trouvera forcément\nquelqu'un quelque part pour emprunter cette voie.</p>#<p>Non, ça c'est\nla loi de Murphy.</p> =<p>Que la puissance d'un ordinateur double tous\nles 2 ans environ.</p>#<p>Exact !</p> ####<p>La puissance d'un\nordinateur double environ tous les 2 ans.</p> }\n",
                    "title": "2.2 Quizz",
                    "type": "auto-evaluation"
                },
                {
                    "source_file": "auto-evaluation/2-3-quizz_auto-evaluation.html",
                    "sub_src": "\n// question: 165000 name: 1.2.2 Quizz (Q1/2) ::1.2.2 Quizz\n(Q1/2)::[html]<p>Entre mon ordinateur et l'ordinateur de mon père qui\nont 12 ans d'écart, quelle est la différence de puissance à laquelle\non peut s'attendre ?</p>{ ~<p>Ils sont tous les deux aussi puissants,\nça n'a pas changé en 12 ans.</p>#<p>Il faut revoir la vidéo !</p>\n~<p>Mon ordinateur est environ 20 fois plus puissant.</p>#<p>Bien plus\nque ça...</p> =<p>Mon ordinateur est environ 60 fois plus\npuissant</p>#<p>Tout à fait !</p> ~<p>Mon ordinateur est environ 150\nfois plus puissant.</p>#<p>Quand même pas tant que ça !</p> ####<p>2\nans \\: x 2<br />4 ans \\: x 4<br />6 ans \\: x 8<br />8 ans \\: x1 6<br\n/>10 ans \\: x 32 <br /><strong>12 ans \\: x 64</strong></p>\\n<p>En\nd'autres mots un traitement qui prenait <strong>30 min</strong> avec\nl'ordinateur de mon père s'effectue en <strong>28 s</strong> sur le\nmien !</p> }\n\n\n// question: 165001 name: 1.2.2 Quizz (Q2/2) ::1.2.2 Quizz\n(Q2/2)::[html]<p>D'où vient le mot \"bug\" ?<br />Il est malheureusement\ncourant d'être confronté à des programmes “bugués”, c'est à dire des\nprogrammes qui ne font pas ce qu'ils sont sensés faire.<br />Mais\nsavez-vous d'où vient le terme “bug” ?<br /><br /></p>{ =<p>En\nanglais, “bug” signifie insecte. Un insecte s'était glissé dans le\nmécanisme d'un des premiers ordinateurs, ce qui avait fait griller un\nrelais et provoqué une panne.</p>#<p><span style\\=\"color\\:\n\\#000000;\">En effet, il s'agissait d'une mite.<br /></span></p>\n~<p>“Bug” était le surnom d'un des premiers programmeurs chez\nMicrosoft, il était réputé pour commettre beaucoup\nd'erreurs.</p>#<p>Non, cherchez bien, c'est sur le web !</p> ~<p>“Bug”\nest la version en verlan de “GUB” (Grande Unité Binaire), un projet\nd'ordinateur qui n'a jamais fonctionné.</p>#<p>Non, cherchez bien,\nc'est sur le web !</p> ~<p>“Bug” est le diminutif de Bugatti, la\nmarque de la première voiture de luxe de Bill Gates, le fondateur de\nMicrosoft. Cette voiture serait tombée 13 fois en panne en un\nan…</p>#<p>Non, cherchez bien, c'est sur le web !</p> ~<p>L'équipe des\nfondateurs d'Apple étaient des fans du dessin animé “Bugs Bunny”. Ils\navaient pris l'habitude d'appeler “Bugs” leurs erreurs de\nprogrammation.</p>#<p>Non, cherchez bien, c'est sur le web !</p>\n####<p><span style\\=\"color\\: \\#000000;\">Le premier bug a été causé par\nune mite \\:</span></p>\\n<p><span style\\=\"color\\: \\#000000;\"><img\nsrc\\=\"https\\://ged.univ-lille3.fr/nuxeo/site/dav/EspacePublicWWW/images/culture-numerique/illustrations-questions/S2/TheFirstBug_1947.jpg\"\nalt\\=\"premier bug\" width\\=\"300\" height\\=\"213\" /></span></p>\\n<p><span\nstyle\\=\"color\\: \\#000000;\"> </span></p> }\n",
                    "title": "2.3 Quizz",
                    "type": "auto-evaluation"
                }
            ],
            "title": "Historique informatique"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/3-1-cours_webcontent.html",
                    "sub_src": "\n\n  [Naissance d'internet](https://player.vimeo.com/video/122104260){: .lien_video }\n\nDans les années soixante, il existait aux États-Unis de gros centres\nde calcul abritant de très gros ordinateurs. Ceux-ci étaient reliés\nentre eux par des câbles qui leur permettaient de transporter\nl'information numérique : des réseaux informatiques (network en\nanglais souvent abrégé en net).\n\nEn période de guerre froide, les US avaient peur de voir leurs centres\nbombardés ou une ligne qui reliait 2 centres coupée. Il fallait\npouvoir communiquer entre des centres stratégiques et pouvoir\nbénéficier à distance des résultats des supercalculateurs même en cas\nd'attaque nucléaire. Ils ont demandé aux chercheurs de proposer un\nsystème qui serait tolérant aux pannes… ou aux bombes.\n\nL'idée a été de multiplier les centres et d'interconnecter les réseaux\nde chaque centre. Pour protéger l'ensemble, la proposition a été de\nmultiplier les chemins entre centres. Ainsi si un centre explosait ou\nqu'une ligne était coupée, les autres centres pourraient encore\ncommuniquer entre eux en passant par d'autres chemins : ce fut la\nnaissance d'ARPANET (1971).\n\nCe système a tout de suite rencontré un grand succès. Il a ensuite\névolué vers INTERNET, nom qu'on lui a donné au début des années 80\npour signifier qu'il s'agit d'une interconnexion de réseaux.\n\nSelon le vieil adage *tous les chemins mènent à Rome/, le système de\ncommunication permet d'échanger des données entre 2 points en passant\npar n'importe quel chemin à l'intérieur d'internet.*\n\n\n",
                    "title": "3.1 Cours",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/3-2-quizz_auto-evaluation.html",
                    "sub_src": "\n// question: 165014 name: 1.3.1 (Q2/3) ::1.3.1 (Q2/3)::[html]<p>Que\nsignifie internet ?</p>{ ~<p>Il s'agit de la contraction des mots\nanglais \\: \"<em>international</em>\" et \"<em>network</em>\" (réseau\ninternational).</p>#<p>Ça aurait pu, mais non !</p> =<p>Il s'agit de\nla contraction des mots \"<em>interconnection</em>\" et\n\"<em>networks</em>\" (interconnexion de réseaux).</p>#<p>Exactement\n!</p> ~<p> Les lettres du mot I.N.T.E.R.N.E.T sont les initiales des\nnoms de ses 8 fondateurs.</p>#<p>Pas du tout !</p> ####<p>Internet est\nla contraction des deux mots anglais \"interconnection\" et \"networks\",\nqui signifie \"interconnexion de réseaux\".</p> }\n\n\n// question: 165013 name: 1.3.1 Quizz (Q1/3) ::1.3.1 Quizz\n(Q1/3)::[html]<p>Quelle est la date de la création d'internet ? (date\nla plus proche)</p>{ ~<p>1789</p>#<p>Vraiment ?</p>\n~<p>1918</p>#<p>N'est-ce pas un peu tôt ?</p> ~<p>1945</p>#<p>N'est-ce\npas un peu tôt ?</p> =<p>1970</p>#<p>Oui, c'est cela.</p>\n~<p>1990</p>#<p>Non, c'est trop récent...</p> ~<p>2005</p>#<p>Aussi\ntard ?</p> ####<p>C'est aux environs de <strong>1970</strong> qu'a été\ncréé internet.</p> }\n\n\n// question: 165015 name: 1.3.1 Quizz (Q3/3) ::1.3.1 Quizz\n(Q3/3)::[html]<p>Pourquoi internet est-il qualifié de réseau robuste\nou tolérant aux pannes ?</p>{ ~<p>Parce qu'il est fabriqué avec des\nmatériaux très résistants.</p>#<p>Et non, ce n'est pas uniforme...</p>\n~<p>Parce que beaucoup de salariés sont à sa disposition pour le\nréparer rapidement si nécessaire.</p>#<p>Vous êtes sûr ?</p> =<p>Parce\nque, de par sa conception, il peut fonctionner en mode “dégradé”,\nc'est à dire que même si des lignes ou des machines sont en panne,\nd'autres chemins peuvent être utilisés pour véhiculer les\ninformations.</p>#<p>Tout à fait !</p> ####<p>Parce qu'il peut\nfonctionner en mode \"dégradé\"...</p> }\n\n",
                    "title": "3.2 Quizz",
                    "type": "auto-evaluation"
                }
            ],
            "title": "Naissance d'Internet"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/4-1-cours_webcontent.html",
                    "sub_src": "\n\n  [Comment ça marche ?](https://player.vimeo.com/video/122104315){: .lien_video }\n\nRegardons un peu plus précisément comment fonctionne internet. Trois\ningrédients importants interviennent dans le système ; le premier est\nl'adresse `IP` qui permet de fournir un nom et une adresse à chaque\nmachine.  Chaque ordinateur connecté à internet a un numéro unique (un\npeu comme un numéro de téléphone, mais bien plus long !). Ce numéro\ndépend de l'endroit où l'ordinateur se trouve dans internet et permet\ndonc de trouver un chemin dans l'interconnexion de réseaux. On appelle\nce numéro l'adresse `IP`. De façon très simplifiée, l'adresse `IP`\ncomporte une partie identifiant un réseau dans cette interconnexion et\nune autre partie identifiant la machine au sein de ce réseau.\n\nPour échanger des informations d'un ordinateur vers un autre, celui\nqui *envoie* l'information doit donc connaître l'adresse `IP` du\ndestinataire, et pour obtenir une réponse, l'émetteur doit\nimpérativement fournir dans chaque message envoyé sa propre adresse\n`IP`. Tous les messages échangés sur Internet sont donc de la forme :\n`n°IP destinataire / information / n°IP émetteur`.\n\nLe deuxième ingrédient concerne le *Routage* des messages sur le\nréseau.  Si les ordinateurs émetteur et destinataire sont dans le même\nréseau, le principe est simple : l'ordinateur émetteur envoie son\nmessage sur ce réseau et chaque ordinateur du réseau le lit. Les\ndestinataires peuvent alors s'intéresser aux messages qui leurs sont\ndestinés.  Si le destinataire n'est pas dans le même réseau, la\ntransmission ne peut plus se faire directement à l'ordinateur du\ndestinataire. L'émetteur envoie le message à une machine connectée à\nla fois à ce réseau et à un ou plusieurs autres réseaux. Cette machine\nest une passerelle/routeur qui réalise effectivement\nl'interconnexion. Le routeur renvoie alors le message vers les autres\nréseaux pour poursuivre son chemin. Et ce processus se répète jusqu'à\nce que le message arrive à destination.\n\n\nEnfin le troisième ingrédient concerne le nommage des machines.  En\neffet, ce sont des femmes et des hommes qui utilisent ces\nmachines. Pour désigner un destinataire, personne ne manipule\ndirectement des adresses `IP` qui sont des numéros bien plus longs que\nles numéros de téléphone. Dans notre interface avec le monde\nd'internet nous connaissons plutôt des noms comme `www.univ-lille3.fr`\nou encore `www.service-public.fr`. Le lien entre adresses `IP` et noms\nse fait par le biais des *serveurs de noms* qui, à la manière d'une\nliste de contacts dans notre téléphone, stockent un ensemble de nom et\nd'adresses `IP`.\n\nTrès concrètement, regardons par exemple ce qui se passe lorsque je\nveux consulter la page d'accueil de Lille 3.  tout d'abord, je clique\nsur un lien vers le site de l'université. Ce lien contient le nom de\nla machine capable de me fournir la page d'accueil :\n`www.univ-lille3.fr`. Mon ordinateur va donc contacter un serveur de\nnoms pour connaître l'adresse `IP` de cette machine. Une fois que\ncette adresse `IP` est connue, il peut communiquer avec\n`www.univ-lille3.fr` et envoyer à cette machine un message qui demande\nle contenu de cette page d'accueil. Le message contient bien entendu\nl'adresse `IP` de mon ordinateur, ainsi la machine peut me répondre en\nrenvoyant le contenu qui m'intéresse. Il ne reste plus alors à mon\nordinateur qu'à afficher ce contenu.\n\n",
                    "title": "4.1 Cours",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/4-2-quizz_auto-evaluation.html",
                    "sub_src": "\n// question: 165016 name: 1.4.1 Quizz (Q1/3) ::1.4.1 Quizz\n(Q1/3)::[html]<p>A quoi sert une adresse IP ?</p>{ =<p>À identifier\nles machines connectées de façon unique.</p>#<p>Oui !</p> ~<p>À\ndifférencier les gros ordinateurs et les plus petits.</p>#<p>Comment\nça ?</p> ~<p>À envoyer des mails automatiquement.</p>#<p>Pas du\ntout...</p> ####<p>Une adresse IP (Internet Protocol) sert à\nidentifier de façon unique les machines connectées.</p> }\n\n\n// question: 165027 name: 1.4.1 Quizz (Q2/3)_NEW ::1.4.1 Quizz\n(Q2/3)_NEW::[html]<p>A l'aide de quel équipement réalise-t-on\nl'interconnexion de réseaux ?</p>{ ~<p>Une adresse IP</p>#<p>Vous\ndevriez revoir la vidéo !</p> ~<p>Un serveur de noms</p>#<p>Non, il ne\ns'agit d'un serveur de noms.</p> =<p>Un routeur</p>#<p>Exact !</p>\n####<p>C'est à l'aide d'un routeur, encore nommé passerelle qu'on\nréalise l'interconnexion de réseaux.</p> }\n\n\n// question: 165018 name: 1.4.1 Quizz (Q3/3) ::1.4.1 Quizz\n(Q3/3)::[html]<p>Qu'est-ce qu'un serveur de noms ?</p>{ ~<p>Un site\nweb qui aide à choisir un prénom pour ses enfants.</p>#<p>C'est une\nblague !</p> ~<p>Un logiciel (pirate) qui permet de trouver les mots\nde passe d'autres utilisateurs.</p>#<p>Pas vraiment...</p> =<p>Une\nmachine qui contient une table d'équivalence entre des noms de\nmachines et leur adresse IP.</p>#<p>Oui, c'est exact !</p> ####<p>Un\nserveur de noms est une machine qui contient une table d'équivalence\nentre des noms de machines et leur adresse IP.</p> }\n",
                    "title": "4.2 Quizz",
                    "type": "auto-evaluation"
                }
            ],
            "title": "Comment ça marche?"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/5-1-cours_webcontent.html",
                    "sub_src": "\n  [Se connecter à Internet](https://player.vimeo.com/video/122104376){: .lien_video }\n\nExaminons les conséquences de l'organisation d'Internet lorsqu'on veut\ns'y connecter ...\n\n### Rejoindre un réseau local\nL'ordinateur, le smartphone ou la tablette qui doit accéder à Internet\ndoit d'abord rejoindre un réseau. Nous verrons un peu plus loin les\ndifférents moyens de se connecter à un réseau que ce soit par le wifi,\nun câble ou le réseau de téléphonie mobile.\n\n### Obtenir les 3 informations nécessaires\nDe plus, nous avons vu que pour communiquer avec d'autres machines,\nnotre ordinateur a besoin de trois informations importantes : le\nnuméro `IP`, l'adresse du routeur qui relie ce réseau à Internet, et\nl'adresse du serveur de noms. Ces trois informations sont fournies à\nnotre machine immédiatement après qu'elle ait rejoint le réseau. C'est\nune machine particulière dans le réseau local qui fournit ces\ninformations et donc une autorité locale qui décide de ces\nattributions. Par exemple chez vous, c'est votre box ADSL sous votre\nresponsabilité qui s'en charge. La box elle-même, qui est un\nordinateur presque comme les autres, reçoit ces 3 informations de\nvotre fournisseur d'accès à Internet (FAI) quand elle démarre. Avec la\n4G c'est une machine chez votre opérateur mobile qui est sollicitée…\n\n### Pas de garantie de confidentialité\nAutre remarque importante, le principe d'internet repose sur un envoi\nde proche en proche des messages transmis entre émetteur et\ndestinataire à travers les ordinateurs (routeurs) qui réalisent\nl'interconnexion. Dans ce mode de fonctionnement, il n'y a de garantie\nni de la confidentialité ni de l'intégrité des messages. Chaque\nordinateur participant à la transmission peut lire et modifier les\ndonnées échangées. Si l'on veut transmettre des données sensibles, il\nfaut donc mettre en œuvre des procédures spécifiques additionnelles\npour assurer l'authenticité et/ou la confidentialité des données\ntransmises. Par exemple, pour transmettre des mots de passe ou des\nnuméros de carte bleue, il est nécessaire de crypter les messages pour\nles rendre indéchiffrables par des curieux.\n\n### Filtrage et suivi possible\nUne autre conséquence du fonctionnement d'internet, est que des\nfiltres peuvent être mis en place sur des routeurs pour empêcher\ncertains messages d'être transmis. Ces filtres peuvent se limiter à\ncontrôler les adresses des destinataires pour empêcher de contacter\ncertaines machines. Ils ont par exemple été mis en œuvre dans des pays\nvoulant s'isoler ou censurer quelques services comme twitter, ou\nencore wikileaks...  Les filtres peuvent également concerner les\ncontenus des messages comme dans le cas des filtres parentaux sur les\nbox ADSL (qui incluent une fonction de routeur). Les entreprises et\norganisations emploient aussi cette possibilité pour garder les traces\ndes connexions et répondre ainsi à la contrainte légale de pouvoir\nretrouver les protagonistes d'un échange illicite.\n\n### Impossibilité d'éviter la copie\nLa dernière remarque porte sur l'emploi trompeur du mot\n/envoi/. Lorsqu'une machine *envoie* un message, elle réalise en\nréalité une copie du message sur le réseau. Libre alors à elle de\nsupprimer ou conserver la version originelle du message. C'est une\nsituation que l'on rencontre régulièrement dans le monde *numérique/\net qui rend difficile la lutte contre les copies illicites.* Mais nous\naurons l'occasion d'en reparler plus tard.\n\nMais finalement, pourquoi avoir conçu et suivi cette organisation\ncomplexe d'interconnexion de réseaux? En fait, un très grand réseau où\ntoutes les machines seraient directement reliées est impossible à\nconcevoir. Il faudrait multiplier les câbles et même dans une solution\nsans fil, à l'image d'une discussion à plusieurs personnes, au delà\nd'une certaine limite les discussions des uns couvrent inévitablement\ncelle des autres à tel point qu'on ne peut plus discuter! Les réseaux\nlocaux avec des discussions locales ne peuvent donc fonctionner que\njusqu'à une certaine taille au delà de laquelle une structuration par\ninterconnexion devient obligatoire.\n\n",
                    "title": "5.1 Cours",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/5-2-quizz_auto-evaluation.html",
                    "sub_src": "\n// question: 165019 name: 1.5.1 Quizz (Q1/2) ::1.5.1 Quizz\n(Q1/2)::[html]<p>Lorsqu'un ordinateur rejoint un réseau, que doit-il\nobtenir pour rejoindre internet ?</p>{ ~%33.33333%<p>Une adresse\nIP.</p>#<p>Oui, entre autres...</p> ~<p>Un nom de code.</p>#<p>Et\nnon...</p> ~<p>Une autorisation de l'État ?</p>#<p>Vraiment ?</p>\n~%33.33333%<p>L'adresse d'un serveur de noms.</p>#<p>C'est bien l'un\ndes éléments.</p> ~%33.33333%<p>L'adresse d'un routeur.</p>#<p>Oui,\nmais pas seulement.</p> ~<p>L'accès à un moteur de\nrecherche.</p>#<p>Pas du tout.</p> ####<p>En fait, il doit obtenir 3\néléments \\: une adresse IP, l'adresse d'un serveur de noms et\nl'adresse d'un routeur.</p> }\n\n\n// question: 165020 name: 1.5.1 Quizz (Q2/2) ::1.5.1 Quizz\n(Q2/2)::[html]<p>Pourquoi la machine qui assure l'interconnexion avec\nles autres réseaux d'internet (le routeur) est-elle une place de choix\npour y installer des fonctions de filtrage ?</p>{ =<p>Parce que toutes\nles informations passent par là.</p>#<p>C'est exact !</p> ~<p>Parce\nque c'est la machine la plus puissante.</p>#<p>Et bien, non.</p>\n~<p>Parce qu'elle est en général bien cachée.</p>#<p>Pas du\ntout...</p> ####<p>Parce que toutes les informations transitent par\nelle.</p> }\n",
                    "title": "5.2 Quizz",
                    "type": "auto-evaluation"
                }
            ],
            "title": "Que se passe-t-il quand on se connecte à Internet?"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/6-1-cours_webcontent.html",
                    "sub_src": "\n  [Les supports physiques](https://player.vimeo.com/video/122104443){: .lien_video }\n\n\nInternet et plus généralement les réseaux informatiques peuvent\nutiliser plusieurs types de supports pour transporter l'information\nnumérique. On distinguera les supports physiques, les câbles qui\npeuvent être électriques ou optiques et les ondes électromagnétiques\ncomme le Wifi, le bluetooth ou les réseaux de téléphonie mobiles. Nous\nallons voir qu'une connaissance minimale de ces technologies va nous\npermettre de mieux comprendre les enjeux qu'ils cachent.\n\n### Le débit\nTout d'abord nous devons introduire la notion de débit. Si on prend\nl'image d'un robinet d'eau, on voit bien qu'un robinet avec un gros\ntuyau me permettra de remplir mon seau beaucoup plus vite qu'avec un\npetit robinet qui ne laisse passer qu'un léger filet d'eau. Le débit\ndans ce cas est une quantité d'eau par seconde.  La problématique est\nla même pour le réseau Internet. Nous avons vu précédemment que les\ninformations numériques étaient ramenées à des suites de bits (des 0\net des1). Le débit sera donc pour les réseaux en nombre de bits par\nseconde. Comme cette information circule très vite on parlera en fait\nde milliers de bits par seconde (kb/s), de millions de bits par\nseconde (Mb/s) voire de milliards de bits par seconde (Gb/s).  À titre\nindicatif, voici quelques ordres de grandeur, un document texte d'une\ndizaine de pages se code avec quelques kbits, un fichier mp3 de\nmusique de quelques minutes se compte en Mbits alors qu'un film d'une\nheure correspond à plusieurs Gbits.\n\n### Les supports et les normes relatives à leur utilisation\nNous allons dans la suite présenter les différents supports utilisés\ndans les réseaux. Ils ont connu de fortes évolutions depuis les débuts\nd'internet. Parfois cette évolution est purement matérielle comme\nl'apparition de la fibre optique, d'autres fois l'évolution consiste\nen une meilleure utilisation du support. L'utilisation du support est\ndécrite dans un ensemble de normes comme par exemple la 3G ou la 4G\nqui tous deux utilisent le support des ondes. Aussi la présentation\nsuivante s'appuie à la fois sur les deux notions de norme et de\nsupport.\n\n### Les câbles\nS'agissant des câbles on distingue les câbles électriques et les\nfibres optiques qui transportent la lumière. Ces dernières sont\névidemment beaucoup plus rapides et sont utilisées prioritairement\nquand c'est possible. C'est le cas par exemple de la plupart des\ncâbles sous-marins qui traversent les océans pour relier les\ncontinents, certains ont des débits supérieurs à 100Gb/s.  Des câbles\nélectriques spécifiques pour les réseaux informatiques peuvent\négalement être très rapides mais sur des courtes distances.  C'est en\ngénéral la solution retenue pour connecter les ordinateurs d'un réseau\nlocal dans les entreprises. C'est aussi le cas pour les ordinateurs à\nvotre disposition dans les salles informatiques de l'université.\n\nEn revanche, ce n'est pas le cas de la plupart du réseau français qui\nrelie la majorité des foyers du pays. Les lignes qu'on appelle ADSL,\nsont en fait les câbles de l'ancien réseau téléphonique qui a été\nconstruit à l'origine pour transporter la voix du téléphone et non des\ninformations numériques à très grande vitesse. Cela explique que les\nconnexions dont nous disposons à domicile sont de qualité moyenne et\nne permettent pas le très haut débit, sauf à passer par une fibre\noptique, c'est ce que proposent désormais beaucoup de fournisseurs\nd'accès dans certains quartiers.\n\nÉvidemment, le câblage de toutes les zones habitées avec de la fibre\noptique représente un enjeu social et économique considérable. Alors\nque les lignes de téléphone sont présentes sur l'ensemble du\nterritoire, seules les grandes agglomérations sont couvertes par\nl'équipement en fibres optiques. Cela représente un grand facteur\nd'inégalité...\n\n### Les ondes\nDepuis le XIXème siècle, les hommes ont réussi à s'échanger des\ninformations via les ondes électromagnétiques. La radio puis la\ntélévision ont copieusement utilisé ce principe qui utilise un système\nd'antennes émettrices et réceptrices. Nous savons transporter de la\nmême façon des informations numériques. À chaque réseau son antenne,\ncertains appareils sont équipés d'une antenne Wifi, d'une antenne\nBluetooth et pour les téléphones d'une antenne de réseau de données\nmobiles.  Ces différentes technologies sont essentiellement utilisées\npour nos connexions nomades, c'est-à-dire avec des appareils mobiles\ntels que des ordinateurs portables, des tablettes ou des\nsmartphones. Fondamentalement, elles permettent toutes la même chose,\nc'est à dire un accès complet à Internet.\n\n \n[Connexions nomades](https://player.vimeo.com/video/122104499){: .lien_video }\n### Les connexions nomades\n\n\nOn se retrouve régulièrement à devoir choisir parmi plusieurs moyens\npour se connecter à internet avec nos appareils nomades. Les arguments\nqui entrent dans ce choix sont très variés. On pense bien entendu au\ncoût. Par exemple, l'utilisation du wifi de l'université est\ngratuite. Les accès internet par le biais d'une box sont généralement\ninclus dans un forfait illimité, en revanche le coût de l'utilisation\nd'internet à l'aide de connexions 2G/3G/4G peut rapidement exploser.\n\nUn autre élément déterminant est la disponibilité de la connexion. En\neffet, selon les endroits où l'on se trouve, le réseau mobile peut\nêtre indisponible ou de très faible qualité, inversement il n'y a pas\ntoujours un accès Wifi à notre portée. Notons que si l'on se déplace\nde plus de quelques mètres, il devient quasi-impossible de rester\nconnecté à un réseau wifi qui a une portée assez faible. Les réseaux\nde téléphonie mobiles autorisent par contre une connexion permanente\nsur des longues distances à pied ou en voiture par exemple.\n\nDepuis les années 90, le réseau de téléphonie mobile permet le\ntransfert de données numériques.\n\nMais les normes et les techniques évoluent et sont de plus en plus\nrapides. Les premières générations proposaient des débits très faibles\nqui ne permettaient pas par exemple le transfert d'images ou de\nmusique dans des temps raisonnables. Nous en sommes à la quatrième\ngénération de la technologie, la 4G offre maintenant des débits qui\ndépassent parfois ceux des connexions wifi.\n\n### La rapidité du réseau\nToutefois, la qualité du lien qui relie votre appareil électronique au\nréseau n'est pas le seul responsable du débit. Réfléchissons à ce qui\nfait que ma liaison est lente ou rapide. Tout d'abord il faut se\nrappeler que les débits indiqués par les constructeurs ou les\nopérateurs sont toujours théoriques et correspondent au maximum\npossible dans les meilleures conditions. En pratique, ces conditions\nsont rarement réunies et les débits peuvent être considérablement\nralentis en fonction de plusieurs facteurs :\n\n- le premier facteur que l'on peut citer est l'éloignement, celui-ci joue aussi bien pour les connexions par onde que pour les connexions par câble. Par exemple, les accès ADSL sont très différents selon qu'on a la chance d'habiter près d'un noeud de raccordement aux abonnés (qui contient les machines des fournisseurs d'accès) ou si on en est plus éloigné, les débits peuvent alors être 10 ou 20 fois plus rapides, … pour le même prix d'abonnement.\n- De même, si on s'éloigne au fond du jardin avec son portable, la connexion wifi à notre box va considérablement perdre en qualité, jusqu'à ne plus être accessible.\n- un autre facteur important est le nombre d'utilisateurs du réseau, quelle que soit la technologie utilisée, on peut voir les autoroutes de l'information comme de vraies autoroutes, lorsqu'il y a beaucoup de voitures le trafic est ralenti, de la même façon, si une connexion wifi par exemple est partagée par plusieurs utilisateurs, le débit sera reparti entre eux et aucun d'entre eux n'aura accès au débit maximum\n- l'encombrement du réseau est encore un autre facteur, les routeurs peuvent être vus comme les péages des autoroutes, ce sont des goulots d'étranglement qui bouchonnent lorsque beaucoup de demandes arrivent en même temps\n- enfin, il arrive que l'actualité fasse que certains sites soient sollicités au même moment par des milliers ou des millions d'utilisateurs, le site ne pouvant répondre à tout le monde en même temps, le temps de réponse pour chacun se trouve considérablement ralentie.\n\nAinsi, il est très fréquent de constater que la vitesse de\ntransmission des données varie dans le temps ; varie selon les\nendroits ou les moyens avec lesquels on se connecte à Internet ou\nencore varie selon les sites que l'on visite ou les services que l'on\ndemande. Comme nous venons de le voir, la vitesse d'une connexion\ndépend de nombreux facteurs. Difficile donc de savoir d'où vient un\nralentissement quand il intervient. Mais parfois, le simple changement\ndu mode de connexion utilisé peut faire des miracles. Soyez agiles !!!\n\n",
                    "title": "6.1 Cours",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/6-2-quizz_auto-evaluation.html",
                    "sub_src": "\n// question: 165021 name: 1.6.1 Quizz (Q1/3) ::1.6.1 Quizz\n(Q1/3)::[html]<p>Quels supports sont utilisés pour la transmission de\ndonnées et qui peut donc servir pour une connexion internet ?</p>{\n~<p>L'eau dans un tuyau.</p>#<p>Pas à notre connaissance, mais\npourquoi pas ?</p> ~%20%<p>L'électricité dans les câbles\ntéléphonique.</p>#<p>Oui, l'ADSL</p> ~%20%<p>L'électricité dans les\ncâbles spécialisés.</p>#<p>Oui, l'électricité dans les câbles des\nprises électriques (Voir \\:\nhttp\\://fr.wikipedia.org/wiki/Courants_porteurs_en_ligne)</p>\n~%20%<p>La lumière dans les fibres optiques.</p>#<p>Oui, aussi.</p>\n~%20%<p>Les ondes électromagnétiques dans l'air.</p>#<p>Oui, Wifi,\nbluetooth, réseau téléphonique 2G, 3G, 4G, etc.</p>\n~%20%<p>L'électricité dans les câbles des prises\nélectriques.</p>#<p>Oui, voir \\:\nhttp\\://fr.wikipedia.org/wiki/Courants_porteurs_en_ligne</p>\n####<p>Tout, sauf l'eau, évidemment !</p> }\n\n\n// question: 165022 name: 1.6.1 Quizz (Q2/3) ::1.6.1 Quizz\n(Q2/3)::[html]<p>Qu'est-ce qui joue sur la vitesse d'une connexion\n?</p>{ ~%25%<p>Le débit maximal admissible du lien qui me raccorde au\nréseau local.</p>#<p>Oui, c'est l'un des paramètres.</p> ~%25%<p>Le\nnombre d'utilisateurs de ce lien.</p>#<p>Exact, c'est l'un des\nparamètres.</p> ~%25%<p>Le nombre de messages qui passent par les\nmêmes routeurs que les miens.</p>#<p>Oui, c'est un paramètre.</p>\n~%25%<p>Le nombre de requêtes arrivant sur la machine avec qui je\ndésire échanger des messages.</p>#<p>Oui.</p> ~<p>L'âge de\nl'utilisateur.</p>#<p>Sans commentaire !</p> ####<p>Le débit maximal\nadmissible du lien, le nombre d'utilisateurs de ce lien, le nombre de\nrequêtes mais aussi le nombre de messages qui passent par les mêmes\nrouteurs que les miens.</p> }\n\n\n// question: 165023 name: 1.6.1 Quizz (Q3/3) ::1.6.1 Quizz\n(Q3/3)::[html]<p>Pour utiliser le wifi à Lille 3 je dois \\:</p>{\n=<p>Avoir un compte Lille 3 ou un compte dans une autre\nuniversité.</p>#<p>Exact !</p> ~<p>Payer un\nabonnement.</p>#<p>Absolument pas, c'est gratuit.</p> ~<p>Aller en\ncours.</p>#<p>Aucun rapport !</p> ~<p>Utiliser un smartphone produit\nen France.</p>#<p>Aucun rapport !</p> ~<p>Signer la charte graphique\nde Lille 3.</p>#<p>Non mais signer la charte\n<em><strong>informatique</strong> </em>Lille 3 est obligatoire...</p>\n####<p>Avoir un compte Lille 3 ou un compte dans une autre\nuniversité.</p> }\n",
                    "title": "6.2 Quizz",
                    "type": "auto-evaluation"
                }
            ],
            "title": "Les supports physiques de transmission de l'information"
        },
        {
            "subsections": [
                {
                    "source_file": "webcontent/7-1-cours_webcontent.html",
                    "sub_src": "\n[Internet : Qui décide ?](https://player.vimeo.com/video/122104174){: .lien_video }\n\n### Les normes et instituts de normes\nPouvons-nous communiquer si nous ne comprenons pas la même langue?\nNon, sauf bien sûr si nous avons la chance d'avoir un interprète et\ndans ce dernier cas la communication n'est pas aussi simple. La même\nsituation se retrouve dans les réseaux informatiques.\n\nPour faciliter les communications entre les machines, des normes ont\nété établies. L'avantage de la norme si elle est bien documentée,\npublique et libre d'accès est que chacun, constructeur ou éditeur de\nlogiciel, peut la réaliser dans ses produits.\n\nC'est le rôle des instituts de normes, comme l'ISO qui regroupe la\nplupart des pays du monde, et de l'AFNOR en France, d'éditer et\ndiffuser ces normes.\n\nDe très nombreuses normes entrent en jeu dans le fonctionnement\nd'Internet et des réseaux informatiques. C'est le cas de du protocole\nde l'internet dans lequel on retrouve la définition des adresses `IP`\ndont nous avons parlé. C'est aussi le cas des protocoles et langages\ndu Web dont nous parlerons bientôt. L'existence de ces normes est une\nraison majeure du succès planétaire du web. Sans elles, le web serait\nsans doute un archipel d'îles isolées plutôt qu'une toile.\n\n### Pressions\nMais imaginez maintenant un standard industriel breveté et protégé par\nune unique société à la place d'une norme mondiale libre et\nouverte. Cette société aurait un pouvoir considérable. Évidemment, les\nenjeux économiques du numérique étant si importants que de nombreuses\ntentations ont été observées pour contourner les normes ou imposer son\nstandard. C'est un peu le rôle de chacun de veiller à éviter ces\ndérives et une éducation numérique contribue à donner des armes aux\ncitoyens pour comprendre ces enjeux et agir en conséquence.\n\nÀ voir \"Une contre-histoire d'internet\", de Sylvain Bergère. Retour\nsur les mouvements de défense des libertés sur internet, apparus en\nréaction à la régulation croissante du web :\nhttps://www.youtube.com/watch?v=tztUb=IP=b5oQ&feature=youtu.be\n\n### Les structures politiques\nAu niveau d'internet, en plus des normes qui régissent les moyens de\ncommuniquer les informations à travers le réseau, il faut également\ncontrôler l'organisation du réseau. Nous pouvons illustrer cela en\nétudiant la structure politique mise en œuvre pour attribuer les\nadresses `IP` et les noms.\n\nNous avons expliqué que lorsqu'une machine rejoint internet, elle\nrejoint d'abord un réseau local et l'autorité possédant ce réseau\nlocal lui attribue un numéro `IP`. Ce numéro est choisi dans un\nensemble de numéros dont un organisme de tutelle a confié la\nresponsabilité. Cet organisme de tutelle a lui-même un ensemble de\nnuméros à sa disposition et ainsi de suite. Au sommet de cette\nhiérarchie de responsabilités, se trouve l'ICANN. L'ICANN délègue\nensuite à 5 structures correspondant à 5 grandes régions du\nmonde. Ceux-ci délèguent aux organisations locales dans lesquelles on\nretrouve en autres les sociétés qui vous louent les BOX ADSL. Il y en\na plusieurs centaines en France.\n\nPour les noms de l'internet l'organisation politique est très\nsimilaire, hiérarchique également avec au sommet encore une fois\nl'ICANN. On retrouve cette hiérarchie dans la façon avec laquelle sont\nconstruit les noms. Par exemple la machine appelée\n`www.univ-lille3.fr` désigne une machine appelée `www` dans un domaine\nde nommage plus grand, `univ-lille3.fr`, qui comprend également\n`live3.univ-lille3.fr` ou `formations.univ-lille3.fr` ... Le domaine\n`univ-lille3.fr` est lui même dans un domaine plus grand encore le\n`.fr`.\n\nL'université gère les noms dans son domaine alors que l'AFNIC gère\ntous les noms en `.fr`.\n\n### À qui appartient internet ?\nLa structure politique que nous venons de décrire a son miroir\ntechnologique. En effet, l'ensemble machines qui assurent le service\nd'associer noms et adresses forme également une hiérarchie. Comme nous\nl'avons vu dans une activité précédente, au sommet de cette hiérarchie\nse trouvent seulement 13 machines. Si elles s'arrêtaient, internet\nserait inutilisable. Des cyberattaques ont même eu lieu plusieurs fois\npour tenter de les mettre en panne... Ces 13 ordinateurs sont presque\ntous aux États-Unis et appartiennent souvent à des sociétés\nprivées. On est en droit de se demander une fois de plus à qui donc\nappartient internet ?\n\nL'organisation politique des noms et des `IP` est elle aussi souvent\nremise en cause car les institutions importantes comme l'ICANN sont de\ndroit américain.\n\nLa plupart des câbles qui sillonnent la planète appartiennent\négalement à des sociétés privées. Aux États-Unis, Comcast, le plus\ngros opérateur est en passe de racheter le second (Time Warner Cable).\n\nEt les routeurs dont nous avons parlé sont très souvent fabriqués par\nl'entreprise Cisco, une entreprise américaine....\n\nÀ tout niveau, des situations de monopole peuvent apparaître et avec\nelles, le risque de perdre des libertés pour l'usager : liberté de\nchoix, liberté de communiquer.\n\n### Une société de surveillance généralisée\nNous avons vu que les informations que nous communiquons passent par\ndes routeurs. Ceux-ci peuvent assurer des fonctions de filtrage des\ncontenus et de journalisation (ou mémorisation de l'historique des\néchanges). En France, les fournisseurs d'accès à internet, dont\nl'université, sont tenus de pouvoir répondre à des enquêtes provenant\nde juges : qui a consulté ce site tel jour à telle heure ? Donc, à\nl'université, au travail ou chez vous, une mémorisation est faite.\n\nToutefois mémorisation ne signifie pas systématiquement surveillance\nou espionnage. La CNIL par exemple, et bien sûr la justice, doivent\nprotéger les citoyens contre ces abus. Mais leurs moyens ne sont pas\ntoujours à la hauteur de leurs missions... Et les affaires comme PRISM\nont montré que cette question dépasse largement le cadre Français.\n\n",
                    "title": "7.1 Cours",
                    "type": "webcontent"
                },
                {
                    "source_file": "auto-evaluation/7-2-quizz_auto-evaluation.html",
                    "sub_src": "\n// question: 165024 name: 1.8.1 (Q1/3) ::1.8.1\n(Q1/3)::[html]<p>Comment s'appelle l'organisme qui gère les noms de\ndomaine et les adresses IP ?</p>{ =<p>Au niveau mondial \\:</p> ->\nICANN =<p>Au niveau de la France \\:</p> -> AFNIC = -> CNIL\n####<p>ICANN pour le niveau mondial et l'AFNIC pour la France.</p> }\n\n// question: 165028 name: 1.8.1 (Q2/3)_NEW ::1.8.1\n(Q2/3)_NEW::[html]<p>L'ISO est l'organisation internationale de\nnormalisation.</p>{TRUE#<p>Il faut revoir la vidéo...</p>#<p>Exact\n!</p>####<p>Vrai, l'ISO est bien l'organisation internationale de\nnormalisation (International Organization for Standardization).<br\n/><br /></p>}\n\n// question: 165029 name: 1.8.1 (Q3/3) Noms pleinement qualifiés_NEW\n::1.8.1 (Q3/3) Noms pleinement qualifiés_NEW::[html]<p>Comment s'écrit\nle nom d'une machine C, située dans un domaine B, lui même dans un\ndomaine général A ?</p>{ ~<p>ABC</p> ~<p>ACB</p> =<p>CBA</p>\n~<p>CAB</p> ~<p>BAC</p> ~<p>BCA</p> ####<p>C.B.A \\: le nom de la\nmachine, puis le nom du domaine de 1er niveau et enfin le nom du\ndomaine général.</p> }\n",
                    "title": "7.2 Quizz",
                    "type": "auto-evaluation"
                }
            ],
            "title": "Société : qui décide sur Internet?"
        }
    ]
}